[{"description": "Make the perfect baked potato every time using this simple step-by-step recipe.", "title": "Baked Potato", "url": "http://allrecipes.com/recipe/16505/baked-potato/", "image": "http://images.media-allrecipes.com/userphotos/560x315/537950.jpg", "ingredients": ["1 baking potato"], "directions": ["Preheat oven to 350 degrees F (175 degrees C).", "Scrub the potato and prick it with a fork to prevent steam from building up and causing the potato to explode in your oven.", "Bake for 1 1/2 hours."]},
{"description": "Quick and easy homemade spaghetti sauce with tomatoes, onions, garlic, basil and oregano.  Add your favorite vegetables and use fresh herbs if you have them.", "title": "Spaghetti Sauce", "url": "http://allrecipes.com/recipe/21066/spaghetti-sauce/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1044864.jpg", "ingredients": ["2 teaspoons olive oil", "1/2 small onion, chopped", "2 green onions, chopped", "2 teaspoons crushed garlic", "1 (28 ounce) can peeled and diced tomatoes", "4 teaspoons dried basil", "4 teaspoons dried oregano", "1 teaspoon white sugar"], "directions": ["In a large saucepan heat oil over medium heat.  Saute onion, green onion and garlic.  When onions are clear, stir in tomatoes, basil, oregano and sugar.  Bring to a boil, reduce heat to low, and simmer for 20 minutes."]},
{"description": "Spicy, tangy, flavorful chicken that can be prepared in a snap! Ingredients can be adjusted to taste.", "title": "Quick Lemon Dijon Chicken", "url": "http://allrecipes.com/recipe/87079/quick-lemon-dijon-chicken/", "image": "http://images.media-allrecipes.com/userphotos/250x250/723875.jpg", "ingredients": ["2 skinless, boneless chicken breast halves - cut into 2 inch pieces", "1/4 lime, juiced", "1/2 lemon, juiced", "4 tablespoons Dijon mustard", "freshly ground black pepper", "Creole-style seasoning to taste"], "directions": ["Place chicken in a skillet over medium heat. Pour in lime and lemon juices, and stir in Dijon, black pepper, and Creole-seasoning. Cook, turning chicken occasionally, until the chicken pieces are done, about 15 minutes."]},
{"description": "A delicious taste of homemade beans which can be served as a meal or as a side dish. Especially great for football Sundays, or frozen for a later occasion.", "title": "Slow Cooker Homemade Beans", "url": "http://allrecipes.com/recipe/58389/slow-cooker-homemade-beans/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2196632.jpg", "ingredients": ["3 cups dry navy beans, soaked overnight or boiled for one hour", "1 1/2 cups ketchup", "1 1/2 cups water", "1/4 cup molasses", "1 large onion, chopped", "1 tablespoon dry mustard", "1 tablespoon salt", "6 slices thick cut bacon, cut into 1 inch pieces", "1 cup brown sugar"], "directions": ["Drain soaking liquid from beans, and place them in a Slow Cooker.", "Stir ketchup, water, molasses, onion, mustard, salt, bacon, and brown sugar into the beans until well mixed.", "Cover, and cook on LOW for 8 to 10 hours, stirring occasionally if possible, though not necessary."]},
{"description": "This thick, flavorful salsa will please everyone with it's exciting array of flavors and textures.", "title": "Black Bean Salsa", "url": "http://allrecipes.com/recipe/24182/black-bean-salsa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/8185.jpg", "ingredients": ["3 (15 ounce) cans black beans, drained and rinsed", "1 (11 ounce) can Mexican-style corn, drained", "2 (10 ounce) cans diced tomatoes with green chile peppers, partially drained", "2 tomatoes, diced", "2 bunches green onions, chopped", "cilantro leaves, for garnish"], "directions": ["In a large bowl, mix together black beans, Mexican-style corn, diced tomatoes with green chile peppers, tomatoes and green onion stalks. Garnish with desired amount of cilantro leaves. Chill in the refrigerator at least  8 hours, or overnight, before serving."]},
{"description": "This smoothie is so bright, cheerful, and delicious, it is like a blast of sunshine on even the most rainy, windy days!", "title": "Gloomy Day Smoothie", "url": "http://allrecipes.com/recipe/84189/gloomy-day-smoothie/", "image": "http://images.media-allrecipes.com/userphotos/560x315/607006.jpg", "ingredients": ["1 mango - peeled, seeded, and cut into chunks", "1 banana, peeled and chopped", "1 cup orange juice", "1 cup vanilla nonfat yogurt"], "directions": ["Place mango, banana, orange juice, and yogurt in a blender. Blend until smooth. Serve in clear glasses, and drink with a bendy straw!"]},
{"description": "A little sherry makes all the difference in this succulent grilled chicken recipe with an Asian flair.", "title": "Chicken Marinade", "url": "http://allrecipes.com/recipe/48930/chicken-marinade/", "image": "http://images.media-allrecipes.com/userphotos/560x315/16411.jpg", "ingredients": ["1 cup soy sauce", "1/2 cup vegetable oil", "1 tablespoon cooking sherry", "3 tablespoons brown sugar", "3 cloves garlic, crushed", "4 boneless, skinless chicken breast halves"], "directions": ["In a medium bowl, mix soy sauce, vegetable oil, sherry, brown sugar, and garlic. Pour into a large resealable bag. Place chicken in the bag, and shake to coat. Marinate in the refrigerator at least 4 hours.", "Preheat an outdoor grill for high heat, and lightly oil grate.", "Place chicken on the prepared grill. Cook 6 to 8 minutes on each side, or until no longer pink and juices run clear. Discard remaining marinade."]},
{"description": "Bite-sized bits of sauteed chicken meld with the fresh flavors of tomatoes and broccoli. Onion, garlic and oregano add earthy tones to the sauce. Toss with penne and a zesty handful of chopped fresh basil.", "title": "Chicken and Broccoli Pasta", "url": "http://allrecipes.com/recipe/17670/chicken-and-broccoli-pasta/", "image": "http://images.media-allrecipes.com/userphotos/250x250/857133.jpg", "ingredients": ["3 tablespoons olive oil", "1 pound skinless, boneless chicken breast halves - cut into 1 inch pieces", "1 tablespoon chopped onion", "2 cloves garlic, chopped", "2 (14.5 ounce) cans diced tomatoes", "2 cups fresh broccoli florets", "salt and pepper to taste", "1 pinch dried oregano", "18 ounces dry penne pasta", "1/4 cup fresh basil leaves, cut into thin strips", "2 tablespoons grated Parmesan cheese"], "directions": ["In a large skillet over medium heat, warm oil and add chicken; cook until slightly brown. Add onion and garlic to cook for about 5 minutes or until garlic is golden and onions are translucent.", "Add tomatoes, broccoli, salt, pepper and oregano; stir well and bring to a boil. Cover and turn down heat to simmer for about 10 minutes.", "Meanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until tender; drain and add back into pot. Pour chicken sauce into pot and mix well.", "Add basil and toss well; top with Parmesan cheese. Serve."]},
{"description": "A delicious garlic and fresh tomato sauce covers tender pork cutlets. Serve with crusty bread, a leafy salad, and maybe a side of buttered pasta with a little of the sauce on top. Terrific and fast.", "title": "Spicy Italian Pork Cutlets", "url": "http://allrecipes.com/recipe/68860/spicy-italian-pork-cutlets/", "image": "http://images.media-allrecipes.com/userphotos/560x315/235879.jpg", "ingredients": ["1/4 cup extra virgin olive oil, divided", "4 boneless pork chops, pounded to 1/4 inch thick", "salt and pepper to taste", "4 cloves garlic, thinly sliced", "1 large tomato, diced", "1/3 cup chicken broth", "1/4 cup dry white wine", "3 tablespoons minced fresh parsley", "1/4 teaspoon red pepper flakes"], "directions": ["Heat 2 tablespoons olive oil in a skillet over medium-high heat. Season the pork chops with salt and pepper, and quickly sear on both sides. Remove from heat, and set aside.", "Heat the remaining olive oil in the skillet over medium-high heat, and saute the garlic about 30 seconds. Mix in the tomato, chicken broth, wine, parsley, and red pepper flakes. Cook and stir until thickened, about 2 minutes.", "Return the pork chops to the skillet, and continue cooking 5 to 10 minutes, to an internal temperature of 145 degrees F (63 degrees C). Serve pork with the tomato and broth mixture from the skillet."]},
{"description": "Lemon, rosemary and garlic are an ideal flavor blend in this quick chicken bake.", "title": "Easy Garlic and Rosemary Chicken", "url": "http://allrecipes.com/recipe/8844/easy-garlic-and-rosemary-chicken/", "image": "http://images.media-allrecipes.com/userphotos/250x250/937774.jpg", "ingredients": ["2 skinless, boneless chicken breasts", "2 cloves garlic, chopped", "2 tablespoons dried rosemary", "1 tablespoon lemon juice", "salt and pepper to taste"], "directions": ["Preheat oven to 375 degrees F (190 degrees C).", "Cover the chicken breasts with garlic, then sprinkle with rosemary, lemon juice, and salt and pepper to taste. Place in a 9x13 inch baking dish and bake in the preheated oven for 25 minutes or until done and juices run clear (baking time will depend on the thickness of your chicken breasts)."]},
{"description": "This recipe is bursting with flavor! It is fresh and spicy, and did I mention easy? This is the closest thing to restaurant style salsa you will find. The jalapenos and hot pepper sauce (e.g., Tabasco) add spice to the mix and the cilantro, lime juice, and green onions create freshness.", "title": "Jen's Fresh and Spicy Salsa", "url": "http://allrecipes.com/recipe/74591/jens-fresh-and-spicy-salsa/", "image": "http://images.media-allrecipes.com/userphotos/250x250/40068.jpg", "ingredients": ["5 roma (plum) tomatoes, seeded and chopped", "10 green onions", "2 fresh jalapeno peppers, seeded", "1/4 cup chopped fresh cilantro", "2 tablespoons fresh lime juice", "2 tablespoons hot pepper sauce", "1 teaspoon ground black pepper", "1 teaspoon garlic powder", "1 teaspoon salt"], "directions": ["In a blender or food processor, pulse the tomatoes, green onions, jalapeno peppers, and cilantro to desired consistency. Transfer to a bowl, and mix in the lime juice, hot pepper sauce, black pepper, garlic powder, and salt."]},
{"description": "This recipe uses only half of what 's in your spice cabinet: chili powder, mustard powder and garlic powder are mixed up with paprika, oregano and brown sugar. It smells wonderful and adds such a great flavor to grilled meat.", "title": "Johnny's Spice Rub", "url": "http://allrecipes.com/recipe/16100/johnnys-spice-rub/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2274417.jpg", "ingredients": ["1 tablespoon garlic powder", "2 tablespoons ground black pepper", "1 tablespoon salt", "1 tablespoon mustard powder", "1 tablespoon chili powder", "1 tablespoon ground cumin", "1 tablespoon brown sugar", "4 tablespoons ground paprika", "1/2 teaspoon dried oregano"], "directions": ["In a small, nonporous bowl, combine the garlic powder, ground black pepper, salt, mustard powder, chili powder, cumin, brown sugar, paprika and oregano. Mix well and apply to meat."]},
{"description": "This flavorful quinoa dish is a delicious and higher protein alternative to Spanish rice.  This is a nice side dish to a Mexican meal, or it can be used as a filling in burritos. I like my food on the less-salty side, so you may have to adjust the seasonings to your taste.", "title": "Spanish-Style Quinoa", "url": "http://allrecipes.com/recipe/151343/spanish-style-quinoa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/681579.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 cup uncooked quinoa", "1 medium onion, finely chopped", "3 cloves garlic, minced", "1 small green bell pepper, chopped", "1 (8 ounce) can tomato sauce", "2 1/2 cups water", "1 teaspoon chili powder", "1/4 teaspoon garlic powder", "1/4 teaspoon ground cumin"], "directions": ["Heat the vegetable oil in a large saucepan over medium-high heat. Stir in the quinoa, onion, garlic, and green pepper. Cook and stir 5 to 10 minutes until the onion is tender, and the quinoa has lightly toasted. Stir in the tomato sauce and water, then season with the chili powder, garlic powder, and cumin. Bring to a boil, then reduce heat to medium-low, cover, and simmer until the quinoa is tender, and the liquid is absorbed, about 30 minutes. Stir the quinoa occasionally as it cooks."]},
{"description": "A warm and cozy comfort food that goes great with anything, fancy or plain. Use whatever type of condensed cream soup you like.  I normally use broccoli, mushroom, or chicken depending on the accompanying entree.  Use any milk, but not cream or half and half.", "title": "Baked Scalloped Potatoes", "url": "http://allrecipes.com/recipe/18346/baked-scalloped-potatoes/", "image": "http://images.media-allrecipes.com/userphotos/250x250/3848.jpg", "ingredients": ["6 large peeled, cubed potatoes", "1 (10.75 ounce) can condensed cream of mushroom soup", "1 1/4 cups milk", "1 onion, diced", "1/2 teaspoon ground black pepper"], "directions": ["Preheat oven to 375  degrees F (190 degrees C). Grease a 2 quart casserole dish.", "Layer potatoes and onions into the casserole dish. Combine soup, milk and pepper in a bowl, then pour soup mixture over the potatoes and onions.  The soup mixture should almost cover the potatoes and onion, if it does not add extra milk.", "Cover dish and bake in preheated 375 degrees F (190 degrees C) oven for 60 minutes or until the potatoes are cooked through. At 30 minutes, remove the casserole from the oven and stir once before returning the dish to the oven. Remove from oven and serve."]},
{"description": "An easy Italian-style preparation of kale. The simple additions of balsamic vinegar and minced garlic show off kale's natural sweetness and rich texture.", "title": "Italian Kale", "url": "http://allrecipes.com/recipe/141869/italian-kale/", "image": "http://images.media-allrecipes.com/userphotos/250x250/422796.jpg", "ingredients": ["1 bunch kale, stems removed and leaves coarsely chopped", "1 clove garlic, minced", "1 tablespoon olive oil", "2 tablespoons balsamic vinegar", "Salt and ground black pepper to taste"], "directions": ["Cook the kale in a large, covered saucepan over medium-high heat until the leaves wilt. Once the volume of the kale is reduced by half, uncover and stir in the garlic, olive oil and vinegar. Cook while stirring for 2 more minutes. Add salt and pepper to taste."]},
{"description": "This is my original recipe and can be either vegetarian or meat based.  It also freezes well - just thaw, heat and add cream or yoghurt before serving.  It's delicious and well worth the extra steps of roasting and pureeing.  Enjoy!", "title": "Roasted and Curried Butternut Squash Soup", "url": "http://allrecipes.com/recipe/22956/roasted-and-curried-butternut-squash-soup/", "image": "http://images.media-allrecipes.com/userphotos/250x250/21782.jpg", "ingredients": ["1 butternut squash, halved and seeded", "2 large onions, peeled and quartered", "1 medium head garlic", "6 cups vegetable broth", "1 bay leaf", "1 teaspoon brown sugar", "1 teaspoon mild curry powder", "1/2 teaspoon dried oregano", "1/2 teaspoon ground cinnamon", "1/4 teaspoon ground nutmeg", "salt and pepper to taste", "1 cup plain yogurt", "1/4 cup chopped fresh parsley (optional)"], "directions": ["Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper or aluminum foil.", "Place squash halves and onion onto the prepared baking sheet. Wrap garlic in foil and set with other vegetables.", "Roast in the center of the oven for 45 to 60 minutes, until the squash is tender. Remove from oven and set aside until cool enough to handle.", "Squeeze garlic cloves out of their skin like paste into a food processor. Scrape the flesh from the squash and place into the food processor along with the roasted onion. Puree until smooth. Add vegetable broth if necessary. Transfer the pureed mixture to a stockpot and stir in  vegetable broth. Season with the bay leaf, brown sugar, curry powder, oregano, cinnamon, nutmeg and salt and pepper to taste. Bring to a boil and simmer gently for 10 minutes. Remove from heat and stir in yogurt.", "Remove bay leaf and serve hot. Garnish with fresh parsley if desired."]},
{"description": "This recipe brings the authentic flavor of India into your kitchen. It's a delicious combination of red lentils (masoor daal), ginger, turmeric, cayenne pepper, onion and cumin. Serve over plain or spiced rice.", "title": "Easy Masoor Daal", "url": "http://allrecipes.com/recipe/22765/easy-masoor-daal/", "image": "http://images.media-allrecipes.com/userphotos/250x250/833984.jpg", "ingredients": ["1 cup red lentils", "1 slice ginger, 1 inch piece, peeled", "1/4 teaspoon ground turmeric", "1 teaspoon salt", "1/2 teaspoon cayenne pepper, or to taste", "4 teaspoons vegetable oil", "4 teaspoons dried minced onion", "1 teaspoon cumin seeds"], "directions": ["Rinse lentils thoroughly and place in a medium saucepan along with ginger, turmeric, salt and cayenne pepper.  Cover with about 1 inch of water and bring to a boil.  Skim off any foam that forms on top of the lentils.  Reduce heat and simmer, stirring occasionally, until beans are tender and soupy.", "Meanwhile, in a microwave safe dish combine oil, dried onion and cumin seeds.  Microwave on high for 45 seconds to 1 minute; be sure to brown, but not burn, onions.  Stir into lentil mixture."]},
{"description": "Bran muffins are made with bran cereal, apple, banana, honey, and plump raisins.", "title": "Roxie's Bran Muffins", "url": "http://allrecipes.com/recipe/159466/roxies-bran-muffins/", "image": "http://images.media-allrecipes.com/userphotos/250x250/275517.jpg", "ingredients": ["1/2 cup raisins", "1 egg", "3/4 cup milk", "1 1/2 cups bran cereal (such as Kellogg's All-Bran® Original Cereal)", "1 cup whole wheat flour", "1 teaspoon baking soda", "1 teaspoon ground cinnamon", "2 tablespoons melted butter", "1 apple, cored and shredded", "1 ripe banana, mashed", "1/2 cup honey"], "directions": ["Preheat an oven to 400 degrees F (200 degrees C). Grease 12 muffin cups, or line with paper cupcake liners.", "Cover raisins with water in a microwave-safe bowl, and microwave on High for 1 minute to plump. Drain the raisins, and set aside.", "Beat the egg with milk in a bowl, and mix in the bran cereal. Let the mixture stand until the cereal absorbs the liquid, about 5 minutes. Gently mix in the plumped raisins, flour, baking soda, cinnamon, melted butter, shredded apple, mashed banana, and honey, and stir a few times to mix.", "Spoon the batter into the prepared muffin cups, and bake in the preheated oven for about 20 minutes, or until a toothpick inserted into the center of a muffin comes out clean."]},
{"description": "See in the new year with a hearty bowl of black-eyed peas cooked with garlic, onion, tomatoes and diced country ham. A real country ham is quite salty, but the flavor and seasoning is just right for this homey dish.", "title": "New Year's Day Black-Eyed Peas", "url": "http://allrecipes.com/recipe/16022/new-years-day-black-eyed-peas/", "image": "http://images.media-allrecipes.com/userphotos/560x315/3062070.jpg", "ingredients": ["1 pound dry black-eyed peas", "2 cups chopped cooked ham", "salt and pepper to taste", "1 pinch garlic powder", "2 onions, diced", "1 (14.5 ounce) can whole tomatoes"], "directions": ["Place black-eyed peas in 8 quart pot.  Add enough water to fill pot 3/4 full.  Stir in ham and diced onions, and season with salt, pepper, and garlic powder.  Place tomatoes in a blender or food processor, and blend until the tomatoes are liquefied.  Add tomatoes to pot.  Bring all ingredients to boil.  Cover the pot, and simmer on low heat for 2 1/2 to 3 hours, or until the peas are tender."]},
{"description": "Quinoa is a high-protein, good-for-you grain. It can be substituted for couscous and makes a lovely side dish. This recipe is a crunchy, lemony, healthy dish that can be used as a side or as a light meal.", "title": "Lemony Quinoa", "url": "http://allrecipes.com/recipe/155552/lemony-quinoa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/557448.jpg", "ingredients": ["1/4 cup pine nuts", "1 cup quinoa", "2 cups water", "sea salt to taste", "1/4 cup fresh lemon juice", "2 stalks celery, chopped", "1/4 red onion, chopped", "1/4 teaspoon cayenne pepper", "1/2 teaspoon ground cumin", "1 bunch fresh parsley, chopped"], "directions": ["Toast the pine nuts briefly in a dry skillet over medium heat. This will take about 5 minutes, and stir constantly as they will burn easily. Set aside to cool.", "In a saucepan, combine the quinoa, water and salt. Bring to a boil, then reduce heat to medium and cook until quinoa is tender and water has been absorbed, about 10 minutes. Cool slightly, then fluff with a fork.", "Transfer the quinoa to a serving bowl and stir in the pine nuts, lemon juice, celery, onion, cayenne pepper, cumin and parsley. Adjust salt and pepper if needed before serving."]},
{"description": "This is great for a gourmet taste on a tight schedule. Red snapper is pan seared with an Asian-inspired sauce featuring ginger, green onions, and rice wine vinegar.", "title": "Pan Seared Red Snapper", "url": "http://allrecipes.com/recipe/36124/pan-seared-red-snapper/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1854.jpg", "ingredients": ["2 (4 ounce) fillets red snapper", "1 tablespoon olive oil", "1 lemon, juiced", "2 tablespoons rice wine vinegar", "1 teaspoon Dijon mustard", "1 tablespoon honey", "1/4 cup chopped green onions", "1 teaspoon ground ginger"], "directions": ["Rinse snapper under cold water, and pat dry. In a shallow bowl, mix together olive oil, lemon juice, rice vinegar, mustard, honey, green onions, and ginger.", "Heat a non-stick skillet over medium heat. Dip snapper fillets in marinade to coat both sides, and place in skillet. Cook for 2 to 3 minutes on each side. Pour remaining marinade into skillet. Reduce heat, and simmer for 2 to 3 minutes, or until fish flakes easily with a fork."]},
{"description": "Rich and savory, a wonderful soup, it can be a meal in itself, serve with garlic toast, its great!", "title": "Pasta e Fagioli I", "url": "http://allrecipes.com/recipe/13238/pasta-e-fagioli-i/", "image": "http://images.media-allrecipes.com/userphotos/250x250/186054.jpg", "ingredients": ["2 tablespoons olive oil", "1 cup chopped onion", "3 cloves garlic, minced", "2 (14.5 ounce) cans stewed tomatoes", "3 cups low-sodium chicken broth", "1 (15 ounce) can cannellini beans", "1/4 cup chopped fresh parsley", "1 teaspoon dried basil leaves", "1/4 teaspoon ground black pepper", "1/4 pound seashell pasta"], "directions": ["Heat oil in 4-quart Dutch oven over medium heat until hot.  Add onion and garlic and cook for 5 minutes or until onion is tender.", "Add undrained tomatoes, undrained cannellini beans, chicken broth, parsley, basil and pepper to Dutch oven and bring to a boil over high heat, stirring occasionally. Let boil for approximately 1 minute and then let simmer for 10 minutes, covered.", "Add pasta to Dutch oven and simmer approximately 10 to 12 minutes or until pasta is tender. Serve immediately and enjoy."]},
{"description": "Inspired by Panera Bread's version, this soup delivers on flavor. Tender chicken in a lemony broth with orzo pasta, carrots, onions, celery, and baby spinach.", "title": "Lemon Chicken Orzo Soup", "url": "http://allrecipes.com/recipe/233968/lemon-chicken-orzo-soup/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1052559.jpg", "ingredients": ["8 ounces orzo pasta", "1 teaspoon olive oil", "3 carrots, chopped, or more to taste", "3 ribs celery, chopped", "1 onion, chopped", "2 cloves garlic, minced", "1/2 teaspoon dried thyme", "1/2 teaspoon dried oregano", "salt and ground black pepper to taste", "1 bay leaf", "3 (32 ounce) cartons fat-free, low-sodium chicken broth", "1/2 cup fresh lemon juice", "1 lemon, zested", "8 ounces cooked chicken breast, chopped", "1 (8 ounce) package baby spinach leaves", "1 lemon, sliced for garnish (optional)", "1/4 cup grated Parmesan cheese (optional)"], "directions": ["Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water until partially cooked through but not yet soft, about 5 minutes; drain and rinse with cold water until cooled completely.", "Heat olive oil in a large pot over medium heat. Cook and stir carrots, celery, and onion in hot oil until the vegetables begin to soften and the onion becomes translucent, 5 to 7 minutes. Add garlic; cook and stir until fragrant, about 1 minute more. Season mixture with thyme, oregano, salt, black pepper, and bay leaf; continue cooking another 30 seconds before pouring chicken broth into the pot.", "Bring the broth to a boil. Partially cover the pot, reduce heat to medium-low, and simmer until the vegetables are just tender, about 10 minutes.", "Stir orzo, lemon juice, and lemon zest into the broth; add chicken. Cook until the chicken and orzo are heated through, about 5 minutes. Add baby spinach; cook until the spinach wilts into the broth and the orzo is tender, 2 to 3 minutes. Ladle soup into bowls; garnish with lemon slices and Parmesan cheese."]},
{"description": "Orange roughy is a versatile fish, and this simple citrus preparation is an excellent complement to its mild flavor.", "title": "Lemon-Orange Orange Roughy", "url": "http://allrecipes.com/recipe/40061/lemon-orange-orange-roughy/", "image": "http://images.media-allrecipes.com/userphotos/250x250/153437.jpg", "ingredients": ["1 tablespoon olive oil", "4 (4 ounce) fillets orange roughy", "1 orange, juiced", "1 lemon, juiced", "1/2 teaspoon lemon pepper"], "directions": ["Heat oil in a large skillet over medium-high heat. Arrange fillets in the skillet, and drizzle with orange juice and lemon juice. Sprinkle with lemon pepper. Cook for 5 minutes, or until fish is easily flaked with a fork."]},
{"description": "I have made this dish for company, and every time they ask for the recipe! I hope everyone else likes it as much as we do!", "title": "Winter Vegetable Hash", "url": "http://allrecipes.com/recipe/91894/winter-vegetable-hash/", "image": "http://images.media-allrecipes.com/userphotos/560x315/707859.jpg", "ingredients": ["3 tablespoons olive oil", "2 tablespoons butter", "1 pound Yukon Gold potatoes, diced", "1/2 pound fresh shiitake mushrooms, diced", "1 red bell pepper, diced", "1 small acorn squash, diced", "1 shallot, finely chopped", "2 teaspoons garlic powder", "1 pinch salt", "1 pinch ground black pepper", "1 cup chopped kale", "4 sprigs fresh sage"], "directions": ["Place oil and butter in a large skillet over medium heat. Melt butter and mix in potatoes, mushrooms, pepper, squash, and shallot. Season with garlic powder, salt, and pepper. Cook 25 minutes, stirring occasionally, until potatoes are tender.", "Mix kale and sage into skillet. Continue cooking 5 minutes, until kale is wilted. Serve and enjoy!"]},
{"description": "Light and delicate vegetarian pasta entree that's easy!", "title": "Angel's Pasta", "url": "http://allrecipes.com/recipe/18351/angels-pasta/", "image": "http://images.media-allrecipes.com/userphotos/250x250/284179.jpg", "ingredients": ["8 ounces angel hair pasta", "1 tablespoon crushed garlic", "1 tablespoon olive oil", "2 zucchini, sliced", "salt and pepper to taste", "3 tomatoes, chopped", "12 leaves fresh basil", "4 ounces mozzarella cheese, shredded"], "directions": ["Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.", "Meanwhile, heat a medium skillet over medium heat. Pour in oil and saute garlic until golden. Stir in zucchini, salt and pepper. Saute 2 minutes, then mix in tomato and cook a few minutes more. Chop basil and add to vegetables right before mixing with pasta.", "Combine pasta and vegetables. Serve topped with mozzarella."]},
{"description": "I love quinoa and I wanted to make something that was flavorful and filling. The vegetables can be changed to your liking!", "title": "Quinoa with Veggies", "url": "http://allrecipes.com/recipe/163044/quinoa-with-veggies/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1339471.jpg", "ingredients": ["1 cup quinoa", "3 cups water", "1 pinch salt", "3 tablespoons olive oil", "3 cloves garlic, minced", "1 red bell pepper, chopped", "1/2 cup corn kernels", "1/2 teaspoon cumin", "1 teaspoon dried oregano", "salt and pepper to taste", "2 green onions, chopped"], "directions": ["Bring the quinoa, water, and 1 pinch of salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the quinoa is tender, about 20 minutes. Once done, drain a mesh strainer, and set aside.", "Meanwhile, heat the olive oil in a saucepan over medium heat. Stir in the garlic, and cook until the garlic softens and the aroma mellows, about 2 minutes. Add the red pepper, and corn; continue cooking until the pepper softens, about 5 minutes. Season with cumin, oregano, salt, and pepper, and cook for 1 minute more, then stir in the cooked quinoa and green onions. Serve hot or cold."]},
{"description": "Wonderful for entertaining, this high volume hummus recipe is made with chipotle pepper, roasted red peppers, and sun dried tomatoes. The Middle-Eastern-inspired dip is a beautiful color and has a smoky, bright flavor. Serve with pita chips and fresh vegetables.", "title": "Smoky Chipotle Hummus", "url": "http://allrecipes.com/recipe/101341/smoky-chipotle-hummus/", "image": "http://images.media-allrecipes.com/userphotos/250x250/619335.jpg", "ingredients": ["2 (15.5 ounce) cans garbanzo beans, drained", "1/2 cup water", "1/4 cup tahini (sesame-seed paste)", "1/4 cup fresh lemon juice", "2 tablespoons olive oil", "1 canned chipotle pepper in adobo sauce", "2 cloves garlic", "1 1/2 teaspoons cumin", "1 (7 ounce) jar roasted red bell peppers, drained", "6 oil-packed sun-dried tomatoes, drained", "1/2 cup chopped cilantro", "1/2 teaspoon salt", "ground black pepper to taste"], "directions": ["Place the garbanzo beans, water, tahini, lemon juice, olive oil, chipotle pepper, garlic, and cumin in the bowl of a food processor;  blend until smooth. Add the red peppers, sun-dried tomatoes, cilantro, salt, and pepper. Pulse the mixture until the ingredients are coarsely chopped into the hummus base. Transfer to a serving bowl, cover, and chill until ready to serve."]},
{"description": "Some wheat bread recipes are hard to make, but this isn't one of them, thanks to the use of your bread machine.", "title": "Good 100% Whole Wheat Bread", "url": "http://allrecipes.com/recipe/6963/good-100-whole-wheat-bread/", "image": "http://images.media-allrecipes.com/userphotos/250x250/7666.jpg", "ingredients": ["1 1/2 teaspoons active dry yeast", "3 cups whole wheat flour", "1 1/2 teaspoons salt", "1 1/2 tablespoons white sugar", "1 1/2 tablespoons nonfat dry milk powder", "1 1/2 tablespoons margarine", "1 1/4 cups warm water (110 degrees F/45 degrees C)"], "directions": ["Place ingredients in the bread machine pan in the order suggested by the manufacturer.", "Select Whole Wheat or Basic Bread setting.  Press Start."]},
{"description": "A mixture of chicken, eggs, bread crumbs, sauteed onion, parsley and light seasoning make croquettes you'll go crazy for! My grandmother used to make salmon cakes; I adapted that recipe to use leftover cooked chicken.", "title": "Leftover Chicken Croquettes", "url": "http://allrecipes.com/recipe/17868/leftover-chicken-croquettes/", "image": "http://images.media-allrecipes.com/userphotos/560x315/216863.jpg", "ingredients": ["3 cups cooked, finely chopped chicken meat", "1 1/2 cups seasoned dry bread crumbs", "2 eggs, lightly beaten", "2 cups sauteed chopped onion", "1 tablespoon chopped fresh parsley", "1 teaspoon salt", "1/2 teaspoon ground black pepper"], "directions": ["In a large bowl combine the chicken, bread crumbs, 2 eggs and onion and mix well; if mixture is too dry to form patties, mix in another lightly beaten egg. Then add parsley, salt and pepper to taste, mix well and form into small patties.", "Heat oil in a large skillet over medium heat and fry patties in oil until golden brown."]},
{"description": "Summer is for salmon on the grill! This sensational salmon marinade combines honey, lime, garlic, and cilantro.", "title": "Grilled Cilantro Salmon", "url": "http://allrecipes.com/recipe/85158/grilled-cilantro-salmon/", "image": "http://images.media-allrecipes.com/userphotos/560x315/7397.jpg", "ingredients": ["1 bunch cilantro leaves, chopped", "2 cloves garlic, chopped", "2 cups honey", "juice from one lime", "4 salmon steaks", "salt and pepper to taste"], "directions": ["In a small saucepan over medium-low heat, stir together cilantro, garlic, honey, and lime juice. Heat until the honey is easily stirred, about 5 minutes. Remove from heat, and let cool slightly.", "Place salmon steaks in a baking dish, and season with salt and pepper. Pour marinade over salmon, cover, and refrigerate 10 minutes.", "Preheat an outdoor grill for high heat.", "Lightly oil grill grate. Place salmon steaks on grill, cook 5 minutes on each side, or until fish is easily flaked with a fork."]},
{"description": "This is a great smoothie for breakfast - and sometimes dinner! You can substitute the orange juice with any mix of juices or even soy milk! The soy milk adds more of a milk shake quality than the juice does.", "title": "Purple Monstrosity Fruit Smoothie", "url": "http://allrecipes.com/recipe/16490/purple-monstrosity-fruit-smoothie/", "image": "http://images.media-allrecipes.com/userphotos/250x250/696215.jpg", "ingredients": ["2 frozen bananas, skins removed and cut in chunks", "1/2 cup frozen blueberries", "1 cup orange juice", "1 tablespoon honey (optional)", "1 teaspoon vanilla extract (optional)"], "directions": ["Place bananas, blueberries and  juice in a blender, puree.  Use honey and/or vanilla to taste. Use more or less liquid depending on the thickness you want for your smoothie."]},
{"description": "People who have tasted this thick mix of beans, spices and chicken say: 'So good it'll make you perky and stupid!'  I've placed in my workplace's annual Halloween chili cook-off for the last three years.  Looks strange -- tastes great! Serve with shredded Monterey Jack cheese and warm flour tortillas.", "title": "Michelle's Blonde Chicken Chili", "url": "http://allrecipes.com/recipe/22846/michelles-blonde-chicken-chili/", "image": "http://images.media-allrecipes.com/userphotos/560x315/783691.jpg", "ingredients": ["1 tablespoon vegetable oil", "3 pounds skinless, boneless chicken breast meat - cubed", "1 cup chopped onion", "2 cups chicken broth", "2 (4 ounce) cans chopped green chile peppers", "5 (14.5 ounce) cans great Northern beans, undrained", "1 tablespoon garlic powder", "1 tablespoon ground cumin", "1 tablespoon dried oregano", "2 teaspoons chopped fresh cilantro", "1 teaspoon crushed red pepper"], "directions": ["In a large skillet over medium-high heat, place the vegetable oil and chicken. Cook the chicken, stirring occasionally, until all pieces are evenly brown. Stir in the onions. Cook until translucent. Drain mixture and set aside.", "In a large saucepan over medium heat, bring the chicken broth and green chile peppers to a boil. Stir in  3 cans great northern beans, garlic powder, cumin, oregano, cilantro and crushed red pepper. Stir in the chicken and onion mixture, and reduce heat. Simmer 30 minutes or longer, adding additional beans from the remaining cans for a thicker consistency as desired."]},
{"description": "Bright red tomatos are peeled and chopped and cooked very briefly with tomato paste and sauteed garlic to make a fresh and colorful sauce for hot pasta. Stir in fresh basil just before combining the sauce with the pasta, then top with Parmesan cheese.", "title": "Tomato and Garlic Pasta", "url": "http://allrecipes.com/recipe/11691/tomato-and-garlic-pasta/", "image": "http://images.media-allrecipes.com/userphotos/560x315/837215.jpg", "ingredients": ["1 (8 ounce) package angel hair pasta", "2 pounds tomatoes", "4 cloves crushed garlic", "1 tablespoon olive oil", "1 tablespoon chopped fresh basil", "1 tablespoon tomato paste", "salt to taste", "ground black pepper to taste", "1/4 cup grated Parmesan cheese"], "directions": ["Place tomatoes in a kettle, and cover with cold water.  Bring just to the boil.  Pour off water, and cover again with cold water.  Peel.  Cut into small pieces.", "Cook the pasta in a large pot of boiling salted water until al dente.", "In a large skillet or saute pan, saute the garlic in enough olive oil to cover the bottom of the pan. The garlic should just become opaque, not brown.  Stir in the tomato paste.  Immediately stir in the tomatoes, and salt and pepper.  Reduce heat, and simmer until the pasta is ready; add the basil.", "Drain the pasta, but do not rinse in cold water.  Toss with a couple of tablespoons of olive oil, and then mix into the sauce. Reduce the heat as low as possible.  Keep warm, uncovered, for about 10 minutes when it is ready to serve.  Garnish generously with fresh Parmesan cheese.", "VARIATIONS:  Saute fresh quartered mushrooms with the garlic, or add shoestring zucchini along with the tomato."]},
{"description": "A thick sauce packed with zucchini and chicken is the perfect topping for a delicious summer pasta dish!", "title": "Zucchini Pasta II", "url": "http://allrecipes.com/recipe/74345/zucchini-pasta-ii/", "image": "http://images.media-allrecipes.com/userphotos/250x250/694726.jpg", "ingredients": ["1 (8 ounce) package uncooked pasta shells", "1 teaspoon olive oil", "1/2 onion, chopped", "3 cloves garlic, sliced", "1 zucchini, chopped", "1/2 teaspoon dried oregano", "salt and freshly ground black pepper to taste", "1/4 teaspoon crushed red pepper flakes", "3/4 cup chicken broth", "1/2 cup chopped cooked chicken", "1 ounce diced roasted red peppers", "2 tablespoons light cream cheese", "1/4 cup chopped fresh basil leaves", "1/4 cup grated Parmesan cheese"], "directions": ["Bring a large pot of lightly salted water to a boil. Place pasta shells in the pot, cook for 8 to 10 minutes, until al dente, and drain.", "Heat the olive oil in a skillet over medium heat, and cook the onion and garlic until tender. Mix in the zucchini, and season with oregano, salt and pepper, and red pepper. Cook 10 minutes, until tender.", "Stir the chicken broth into the skillet, and cook 5 minutes, until heated through. Mix in the chicken, roasted red peppers, and cream cheese, and continue cooking 5 minutes. Serve over the cooked pasta, and top with fresh basil and Parmesan cheese."]},
{"description": "Couldn't be simpler...couldn't be more delicious. Slices of eggplant are topped with sliced tomatoes and fat-free Parmesan cheese and baked.", "title": "Eggplant Tomato Bake", "url": "http://allrecipes.com/recipe/15068/eggplant-tomato-bake/", "image": "http://images.media-allrecipes.com/userphotos/560x315/384711.jpg", "ingredients": ["1 eggplant, sliced into 1/2 inch rounds", "1 tomato, sliced", "1/4 cup grated fat-free Parmesan cheese"], "directions": ["Preheat oven to 400 degrees F (200 degrees C).", "Spray a cookie sheet with non-stick oil spray. Arrange eggplant rounds on the cookie sheet and sprinkle Parmesan over the eggplant. Layer one slice of tomato on top of each eggplant round. Sprinkle with Parmesan cheese.", "Bake for 10 to 15 minutes."]},
{"description": "Strawberries and bananas are blended with yogurt and milk in this easy and delicious smoothie.", "title": "Groovie Smoothie", "url": "http://allrecipes.com/recipe/32334/groovie-smoothie/", "image": "http://images.media-allrecipes.com/userphotos/560x315/415851.jpg", "ingredients": ["2 small bananas, broken into chunks", "1 cup frozen unsweetened strawberries", "1 (8 ounce) container vanilla low-fat yogurt", "3/4 cup milk"], "directions": ["In a blender, combine bananas, frozen strawberries, yogurt and milk. Blend until smooth. Pour into glasses and serve."]},
{"description": "In this recipe serving two, dried lentils are cooked with garlic and stewed tomatoes in curry seasoned broth with onions and celery.", "title": "Tomato-Curry Lentil Stew", "url": "http://allrecipes.com/recipe/12991/tomato-curry-lentil-stew/", "image": "http://images.media-allrecipes.com/userphotos/250x250/137582.jpg", "ingredients": ["1/2 cup dry lentils", "1 cup water", "5 ounces stewed tomatoes", "1/8 cup chopped onion", "2 stalks celery, chopped, with leaves", "1/4 teaspoon curry powder", "3 cloves garlic, minced", "salt to taste", "ground black pepper to taste"], "directions": ["Combine lentils and water, bring to a boil.", "Lower heat to simmer, add tomatoes, onion, and celery. Cover and let simmer 45 minutes. Check every 15 minutes to stir, and add water if necessary. Add spices last 15 minutes to taste. Taste and re-spice if necessary before serving."]},
{"description": "An easy, quick applesauce recipe. I have doubled it and canned it so we always have some on hand. My family loves it.", "title": "Applesauce", "url": "http://allrecipes.com/recipe/54346/applesauce/", "image": "http://images.media-allrecipes.com/userphotos/250x250/931907.jpg", "ingredients": ["6 cups apples - peeled, cored and chopped", "3/4 cup water", "1/8 teaspoon ground cinnamon", "1/8 teaspoon ground cloves", "1/2 cup white sugar"], "directions": ["In a 2 quart saucepan over medium heat, combine apples, water, cinnamon, and cloves. Bring to a boil, reduce heat, and simmer 10 minutes. Stir in sugar, and simmer 5 more minutes."]},
{"description": "Chicken and pan-fried potatoes baked in a potent lemon, garlic and herb sauce.", "title": "Italian Chicken with Garlic and Lemon", "url": "http://allrecipes.com/recipe/8733/italian-chicken-with-garlic-and-lemon/", "image": "http://images.media-allrecipes.com/userphotos/560x315/6951.jpg", "ingredients": ["15 chicken thighs", "8 large potatoes, peeled and quartered", "1 cup vegetable oil, or as needed", "1/2 cup wine vinegar", "5 lemons, juiced", "10 cloves crushed garlic", "2 tablespoons dried oregano", "2 tablespoons dried parsley", "1 onion, minced", "salt and pepper to taste"], "directions": ["Preheat the oven to 350 degrees F (175 degrees C).", "Arrange the chicken pieces in a 10x15-inch enameled roasting pan. In a large skillet over medium high heat, fry the potatoes in 1/2-inch-deep oil until golden brown, then put them in the pan with the chicken.", "Combine the vinegar, lemon juice, garlic, oregano, parsley, onion, salt and pepper with the 1/2 cup reserved frying oil and pour this mixture over the chicken and potatoes.", "Bake in the preheated oven for 1 1/4 hours, basting the chicken and potatoes with the sauce mixture. Let rest for 5 minutes and serve hot."]},
{"description": "This is a recipe I just throw together, but it is very popular. Serve with tortilla chips.", "title": "Salsa", "url": "http://allrecipes.com/recipe/16542/salsa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/3983029.jpg", "ingredients": ["4 large tomatoes, chopped", "1 onion, chopped", "1/2 cup chopped fresh cilantro", "3 cloves garlic, minced", "1 tablespoon lime juice", "1 tomatillo, diced (optional)", "salt to taste", "1 jalapeno pepper, minced"], "directions": ["In a medium-size mixing bowl, combine tomatoes, onion, cilantro, garlic, lime juice, tomatillo, and salt to taste. Mix well. Add 1/2 of the jalapeno pepper, and taste. If you desire your salsa with more of a kick, add the remaining 1/2 jalapeno. If you are satisfied with the salsa's heat, do not add the remaining jalapeno pepper. Cover the salsa, and chill until ready to serve."]},
{"description": "Artichoke hearts, with tomato, olives, onion, and basil, is a great new twist on 'salsa'.", "title": "Artichoke Salsa", "url": "http://allrecipes.com/recipe/44921/artichoke-salsa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/8186.jpg", "ingredients": ["1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped", "3 roma (plum) tomatoes, chopped", "2 tablespoons chopped red onion", "1/4 cup chopped black olives", "1 tablespoon chopped garlic", "2 tablespoons chopped fresh basil", "salt and pepper to taste"], "directions": ["In a medium bowl, mix together the artichoke hearts, tomatoes, onion, olives, garlic, salt, and pepper. Serve chilled, or at room temperature, with tortilla chips."]},
{"description": "Try this one! This recipe is by far the best complement for salmon. Not only is this recipe delicious, it has the added bonus of being an very healthy dish. Great for dinner parties, paired with rice pilaf, green beans, and salad.", "title": "Sweet 'n' Hot Glazed Salmon", "url": "http://allrecipes.com/recipe/58213/sweet-n-hot-glazed-salmon/", "image": "http://images.media-allrecipes.com/userphotos/250x250/9971.jpg", "ingredients": ["1 1/2 cups apricot nectar", "1/3 cup chopped dried apricots", "2 tablespoons honey", "2 tablespoons reduced sodium soy sauce", "1 tablespoon grated fresh ginger", "2 cloves garlic, minced", "1/8 teaspoon cayenne pepper", "1/4 teaspoon ground cinnamon", "1 (3/4 pound) salmon filet without skin"], "directions": ["Preheat your oven's broiler, and grease a broiling pan.", "In a saucepan over medium heat, mix together the apricot nectar, dried apricots, honey, soy sauce, ginger, garlic, cinnamon and cayenne. Bring to a boil, then reduce heat to medium-low, and simmer for about 20 minutes, or until reduced by about half. Stir occasionally to prevent burning. Remove 1/4 cup of the glaze for basting, and set the remaining aside.", "Place the salmon filet on the greased broiling pan, and brush with glaze. Broil 3 inches from the heat for 8 to 12 minutes, or until salmon flakes easily with a fork. Gently turn over once during cooking, and baste frequently during the last 4 minutes. Serve with remaining glaze."]},
{"description": "Diced, minced and chopped veggies and herbs--tomatoes, peppers, onion, garlic and cilantro--are stirred with a splash of lime juice.", "title": "Fresh California Salsa", "url": "http://allrecipes.com/recipe/14137/fresh-california-salsa/", "image": "http://images.media-allrecipes.com/userphotos/250x250/20712.jpg", "ingredients": ["4 large tomatoes, diced", "1/2 large onion, minced", "3 cloves garlic, chopped", "2/3 cup chopped fresh cilantro", "1 jalapeno pepper, seeded and minced", "2 tablespoons fresh lime juice", "salt to taste"], "directions": ["In a small mixing bowl, combine tomatoes, onion, garlic, cilantro and lime juice. Add jalapenos 2 teaspoons at a time, tasting after each addition to see how hot the salsa has become. Jalapeno peppers vary in heat, so it is important to taste the salsa to ensure you do not make it too hot to handle. Salt to taste. Enjoy!"]},
{"description": "A fun, beautiful, and distinctive way to serve fruit at your next party! Try these fruit skewers out with a variety of fruit dips to make them even more exciting!", "title": "Fruity Fun Skewers", "url": "http://allrecipes.com/recipe/142779/fruity-fun-skewers/", "image": "http://images.media-allrecipes.com/userphotos/250x250/126729.jpg", "ingredients": ["5 large strawberries, halved", "1/4 cantaloupe, cut into balls or cubes", "2 bananas, peeled and cut into chunks", "1 apple, cut into chunks", "20 skewers"], "directions": ["Thread the strawberries, cantaloupe, banana and apple pieces alternately onto skewers, placing at least 2 pieces of fruit on each skewer. Arrange the fruit skewers decoratively on a serving platter."]},
{"description": "Spaghetti squash lives up to its name by standing in for pasta in this vegetarian-friendly recipe for a delicious main or side dish.", "title": "Spaghetti Squash with Pine Nuts, Sage, and Romano", "url": "http://allrecipes.com/recipe/152211/spaghetti-squash-with-pine-nuts-sage-and-romano/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2447314.jpg", "ingredients": ["1 spaghetti squash, halved lengthwise and seeded", "1/4 cup toasted pine nuts", "1/4 cup grated Pecorino Romano cheese", "2 tablespoons chopped fresh sage", "2 teaspoons butter, melted", "salt and pepper to taste"], "directions": ["Preheat oven to 350 degrees F (175 degrees C).", "Place the squash, cut side down, in a large baking dish.", "Bake the squash in the preheated oven for 50 minutes.", "Scrape flesh of squash from the rind using a fork and place in a bowl. Add the pine nuts, cheese, sage, butter, salt, and pepper; toss to combine. Serve immediately."]},
{"description": "A beautiful crimson gelatin salad filled with delicious stuff--jellied cranberry sauce, pineapple, sweet-pitted cherries and chopped pecans. This lovely mixture is stirred into cherry gelatin and chilled.", "title": "Cranberry Gelatin Salad", "url": "http://allrecipes.com/recipe/14243/cranberry-gelatin-salad/", "image": "http://images.media-allrecipes.com/userphotos/250x250/146448.jpg", "ingredients": ["1 (16 ounce) can jellied cranberry sauce", "1 (16.5 ounce) can pitted dark sweet cherries, drained", "10 1/2 ounces crushed pineapple with juice", "1 (6 ounce) package cherry Jell-O®", "2 cups boiling water", "1 cup chopped pecans (optional)"], "directions": ["In a medium saucepan over low heat, melt the cranberry sauce.", "Cut the cherries into pieces and add them to the melted sauce. Stir in the pineapple with its juice. Remove mixture from heat.", "In a medium bowl pour the boiling water over the gelatin. And stir until all the gelatin has dissolved.", "Add the gelatin mixture to the cranberry mixture and stir. Stir in the optional nuts. Pour into a 9x13 inch pan and chill until set."]},
{"description": "Fresh lemon juice brightens the flavors of this garlic and curry hummus.", "title": "Curried Hummus", "url": "http://allrecipes.com/recipe/85534/curried-hummus/", "image": "http://images.media-allrecipes.com/userphotos/250x250/68692.jpg", "ingredients": ["2 (15.5 ounce) cans chick peas (garbanzo beans), rinsed and drained", "2 tablespoons olive oil", "3 garlic cloves, crushed", "4 teaspoons curry powder", "6 tablespoons fresh lemon juice", "1/2 cup water", "Salt, to taste", "Hot sauce, to taste"], "directions": ["Put all ingredients in a food processor and blend until smooth. Serve (drizzled with olive oil, if desired) with pita chips."]},
{"description": "Let your oven do the cooked when you spread your home-made pizza with a delicious unsimmered blend of tomato sauce, minced garlic, dried oregano and basil.", "title": "Easy Pizza Sauce II", "url": "http://allrecipes.com/recipe/15454/easy-pizza-sauce-ii/", "image": "http://images.media-allrecipes.com/userphotos/560x315/3443240.jpg", "ingredients": ["1 (8 ounce) can tomato sauce", "1/2 teaspoon minced garlic", "1/2 teaspoon dried oregano", "1/2 teaspoon dried basil"], "directions": ["In a medium bowl, combine tomato sauce, garlic, oregano and basil and mix all  together. Spread mixture over pizza crust, if desired."]},
{"description": "Canned tomatoes make this delicious and versatile salsa fast and easy. Adjust the ingredients to taste.", "title": "Sarah's Salsa", "url": "http://allrecipes.com/recipe/26942/sarahs-salsa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/655449.jpg", "ingredients": ["2 (14.5 ounce) cans diced tomatoes", "1 1/2 (10 ounce) cans diced tomatoes with green chile peppers", "2 tablespoons lemon juice", "1 fresh jalapeno pepper, chopped", "1/3 cup chopped fresh cilantro", "1/2 large yellow onion, chopped", "3 drops hot pepper sauce", "1 clove garlic, minced"], "directions": ["In a blender, place diced tomatoes, diced tomatoes with green chile peppers, lemon juice, jalapeno pepper, cilantro, yellow onion, hot pepper sauce and garlic. Blend until smooth. Chill in the refrigerator until serving."]},
{"description": "A quick and easy Italian favorite. Garnish with grated Romano cheese.", "title": "Pasta Fagioli Soup II", "url": "http://allrecipes.com/recipe/13334/pasta-fagioli-soup-ii/", "image": "http://images.media-allrecipes.com/userphotos/250x250/351105.jpg", "ingredients": ["1 (29 ounce) can diced tomatoes", "2 (14 ounce) cans great Northern beans, undrained", "1 (14 ounce) can chopped spinach, drained", "2 (14.5 ounce) cans chicken broth", "1 (8 ounce) can tomato sauce", "3 cups water", "1 tablespoon minced garlic", "8 slices crisp cooked bacon, crumbled", "1 tablespoon dried parsley", "1 teaspoon garlic powder", "1 1/2 teaspoons salt", "1/2 teaspoon ground black pepper", "1/2 teaspoon dried basil", "1/2 pound seashell pasta"], "directions": ["In a large stock pot, combine diced tomatoes, beans, spinach, chicken broth, tomato sauce, water, garlic, bacon, parsley, garlic powder, salt, pepper, and basil.  Bring to a boil, and let simmer for 40 minutes, covered.", "Add pasta and cook uncovered until pasta is tender, approximately 10 minutes.  Ladle soup into individual serving bowls, sprinkle cheese on top, and serve."]},
{"description": "A mixture of spices and a little cornstarch for thickening, that closely resembles The packaged taco seasoning you might find in the store. There is no salt or MSG in this mixture.", "title": "Taco Seasoning II", "url": "http://allrecipes.com/recipe/46654/taco-seasoning-ii/", "image": "http://images.media-allrecipes.com/userphotos/560x315/204973.jpg", "ingredients": ["6 teaspoons chili powder", "5 teaspoons paprika", "4 1/2 teaspoons ground cumin", "2 1/2 teaspoons onion powder", "2 1/2 teaspoons garlic powder", "1 1/2 teaspoons cornstarch", "1/8 teaspoon cayenne pepper"], "directions": ["In a jar with a tight fitting lid, combine chili powder, paprika, cumin, onion powder, garlic powder, cayenne pepper and cornstarch. Close lid securely, and shake well to mix contents. 7 teaspoons is equivalent to 1 (1.25 ounce) package of taco seasoning."]},
{"description": "This is a simple stir fry recipe with broccoli, green onions, eggs, soy sauce and rice. You can modify this recipe to include any veggies you choose.", "title": "Broccoli and Rice Stir Fry", "url": "http://allrecipes.com/recipe/22916/broccoli-and-rice-stir-fry/", "image": "http://images.media-allrecipes.com/userphotos/250x250/356279.jpg", "ingredients": ["1 1/2 cups uncooked long-grain rice", "1 tablespoon vegetable oil", "1 (16 ounce) package frozen broccoli florets, thawed", "3 green onions, diced", "2 eggs, beaten", "2 tablespoons soy sauce", "1/2 teaspoon salt", "1/4 teaspoon ground black pepper"], "directions": ["In a saucepan, bring 3 cups water to a boil. Stir in rice. Reduce heat, cover, and simmer for 20 minutes.", "Heat oil in a large skillet over medium heat. Saute broccoli until tender crisp, and add scallions. Remove from skillet. Scramble eggs; return broccoli mixture to pan. Stir in cooked rice, soy sauce, salt and pepper."]},
{"description": "This is a dry soup mix packed with split peas, pearl parley, lentils, onion flakes, rice and alphabet macaroni. Just add tomato paste, diced tomato, ground beef, and garlic for a rich and flavorful soup. Makes a wonderful gift.", "title": "Friendship Soup Mix in a Jar", "url": "http://allrecipes.com/recipe/16927/friendship-soup-mix-in-a-jar/", "image": "http://images.media-allrecipes.com/userphotos/250x250/6117.jpg", "ingredients": ["1/2 cup dry split peas", "1/3 cup beef bouillon granules", "1/4 cup pearl barley", "1/2 cup dry lentils", "1/4 cup dried onion flakes", "2 teaspoons dried Italian seasoning", "1/2 cup uncooked long-grain white rice", "2 bay leaves", "1/2 cup uncooked alphabet pasta"], "directions": ["In a 1 1/2 pint jar, layer the split peas, bouillon, barley, lentils, onion flakes, Italian seasoning, rice, and bay leaves. Wrap the pasta in plastic wrap, and place in the jar. Seal tightly.", "Attach a label to the jar with the following instructions: Friendship Soup ADDITIONAL INGREDIENTS:  1 pound ground beef, black pepper to taste, garlic powder to taste, 1 (28 ounce) can diced tomatoes - undrained, 1 (6 ounce) can tomato paste, and 3 quarts water. TO PREPARE SOUP:  Remove pasta from top of jar, and set aside. In a large pot over medium heat, brown beef with pepper and garlic; drain excess fat. Add diced tomatoes, tomato paste, water, and soup mix. Bring to a boil, then reduce heat to low. Cover, and simmer for 45 minutes. Stir in the pasta, cover, and simmer 15 to 20 minutes, or until the pasta, peas, lentils and barley are tender."]},
{"description": "A dry ranch-style seasoning mix which can be combined with either mayonnaise and buttermilk (for a dressing) or mixed with sour cream, and served as a dip.", "title": "Dry Ranch Style Seasoning for Dip or Dressing", "url": "http://allrecipes.com/recipe/85504/dry-ranch-style-seasoning-for-dip-or-dressing/", "image": "http://images.media-allrecipes.com/userphotos/250x250/656119.jpg", "ingredients": ["1 teaspoon dried parsley", "3/4 teaspoon ground black pepper", "1 teaspoon seasoned salt", "1/2 teaspoon garlic powder", "1/4 teaspoon onion powder", "1/8 teaspoon dried thyme"], "directions": ["In a small bowl, stir together the parsley, pepper, seasoned salt, garlic powder, onion powder and thyme. Use as a substitute for Ranch Dressing Mix."]},
{"description": "This is super easy and very tasty. You can make more or less; I usually feed my family of 4. My husband who doesn't like chicken says he would eat this every night without complaint.", "title": "Super Easy Slow Cooker Chicken", "url": "http://allrecipes.com/recipe/24776/super-easy-slow-cooker-chicken/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1113379.jpg", "ingredients": ["1 (10.75 ounce) can condensed low fat cream of chicken and herbs soup", "1 (4 ounce) can mushroom pieces, drained", "1/2 red onion, chopped", "1 1/2 pounds skinless, boneless chicken breast halves - cut into strips", "1 dash Marsala wine"], "directions": ["Combine soup, mushroom pieces, onion, chicken, and wine in slow cooker.", "Cook on Low setting for 2 1/2 to 3 hours."]},
{"description": "Strawberries and plain yogurt are pureed with sugar, orange juice and ground cardamom in this recipe for a refreshing chilled summer soup.", "title": "Strawberry Soup I", "url": "http://allrecipes.com/recipe/13104/strawberry-soup-i/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2106.jpg", "ingredients": ["2 pints strawberries", "2 cups plain yogurt", "1/2 cup orange juice", "1/2 cup white sugar", "1/2 cup water", "1/8 teaspoon ground cardamom"], "directions": ["In a blender, combine the strawberries, yogurt, orange juice, sugar, water and cardamom. Puree until well mixed. Chill and serve."]},
{"description": "A VERY easy vegetarian meal in a bowl.  The combination of garbanzo beans (chick peas) with pasta creates the complex proteins a vegetarian needs. Very palatable for the garlic and tomato lover.", "title": "Garbanzo Tomato Pasta Soup", "url": "http://allrecipes.com/recipe/25916/garbanzo-tomato-pasta-soup/", "image": "http://images.media-allrecipes.com/userphotos/560x315/3753131.jpg", "ingredients": ["3 (14.5 ounce) cans vegetable broth", "3/4 cup small seashell pasta", "1 tablespoon olive oil", "1 onion, chopped", "2 cloves garlic, minced", "1 (15 ounce) can garbanzo beans, drained and rinsed", "1 (28 ounce) can whole peeled tomatoes, chopped, juice reserved", "1/2 teaspoon dried basil", "1/2 teaspoon dried thyme", "salt and pepper to taste"], "directions": ["Bring vegetable broth to a boil in a large pot.  Add pasta and cook for 8 to 10 minutes or until al dente.", "Meanwhile, heat oil in a small skillet over medium heat.  Saute onions and garlic until translucent.  Stir into pasta and add garbanzo beans, tomatoes, basil, thyme, salt and pepper.  Heat through and serve."]},
{"description": "Eggplant cubes are stir-fried until browned, then simmered in a spicy Asian-inspired sauce with onion and garlic until meltingly tender. ", "title": "Spicy Eggplant", "url": "http://allrecipes.com/recipe/215026/spicy-eggplant/", "image": "http://images.media-allrecipes.com/userphotos/250x250/666476.jpg", "ingredients": ["2 tablespoons vegetable oil", "4 Japanese eggplants, cut into 1-inch cubes", "2 tablespoons vegetable oil", "2 onions, thinly sliced", "1 tablespoon minced garlic", "2 tablespoons soy sauce", "2 tablespoons water", "1 1/2 tablespoons oyster sauce", "1 tablespoon chili garlic sauce", "1 teaspoon white sugar", "ground black pepper to taste", "1/2 teaspoon Asian (toasted) sesame oil"], "directions": ["Heat 2 tablespoons of oil in a large skillet or wok over medium-high heat until almost smoking. Cook and stir the eggplant cubes until they begin to brown, 3 to 5 minutes. Remove the eggplant with a slotted spoon, and set aside.", "Heat 2 more tablespoons of oil in the skillet over medium-high heat, and cook and stir the onions just until they begin to soften, about 30 seconds. Stir in the garlic, and cook and stir an additional 30 seconds. Mix in the soy sauce, water, oyster sauce, chili garlic sauce, sugar, and black pepper, and stir to form a smooth sauce. Return the eggplant to the skillet, lower the heat, and allow the vegetables and sauce to simmer until the eggplant is tender and almost all the liquid has been absorbed, about 5 minutes. Drizzle sesame oil over the dish, and give one final brief stir to combine."]},
{"description": "Using less olive oil and more fresh herbs, this healthier version of potatoes are roasted to perfection.", "title": "Healthier Oven Roasted Potatoes", "url": "http://allrecipes.com/recipe/222077/healthier-oven-roasted-potatoes/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1131436.jpg", "ingredients": ["1 tablespoon olive oil", "1 tablespoon minced garlic", "1 tablespoon chopped fresh basil", "1 tablespoon chopped fresh rosemary", "1 tablespoon chopped fresh parsley", "1/2 teaspoon red pepper flakes", "1/2 teaspoon salt", "4 large potatoes, peeled and cubed"], "directions": ["Preheat oven to 475 degrees F (245 degrees C).", "Combine oil, garlic, basil, rosemary, parsley, red pepper flakes, and salt in a large bowl. Toss in potatoes until evenly coated. Place potatoes in a single layer on a roasting pan or baking sheet.", "Roast in preheated oven, turning occasionally, until potatoes are brown on all sides, 20 to 30 minutes."]},
{"description": "Ground chicken mixed with green onion, bread crumbs, coriander, chili sauce and lemon juice for a uniquely Thai flavor.", "title": "Thai Chicken Balls", "url": "http://allrecipes.com/recipe/23764/thai-chicken-balls/", "image": "http://images.media-allrecipes.com/userphotos/560x315/255920.jpg", "ingredients": ["2 pounds ground chicken", "1 cup dry bread crumbs", "4 green onions, sliced", "1 tablespoon ground coriander seed", "1 cup chopped fresh cilantro", "1/4 cup sweet chili sauce", "2 tablespoons fresh lemon juice", "oil for frying"], "directions": ["In a large bowl, mix together the chicken and bread crumbs. Season with green onion, ground coriander, cilantro, chili sauce and lemon juice; mix well.", "Using damp hands, form mixture into evenly shaped balls that are either small enough to eat with your fingers, or large enough to use as burgers.", "Heat oil in a large skillet over medium heat. Fry the chicken balls in batches until well browned all over."]},
{"description": "A hearty, healthy bread that combines bread, rye, and whole wheat flours with cocoa and molasses.", "title": "Bread Machine Pumpernickel Bread", "url": "http://allrecipes.com/recipe/80663/bread-machine-pumpernickel-bread/", "image": "http://images.media-allrecipes.com/userphotos/250x250/138736.jpg", "ingredients": ["1 1/8 cups warm water", "1 1/2 tablespoons vegetable oil", "1/3 cup molasses", "3 tablespoons cocoa", "1 tablespoon caraway seed (optional)", "1 1/2 teaspoons salt", "1 1/2 cups bread flour", "1 cup rye flour", "1 cup whole wheat flour", "1 1/2 tablespoons vital wheat gluten (optional)", "2 1/2 teaspoons bread machine yeast"], "directions": ["Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select  Basic cycle; press Start."]},
{"description": "Eat your muesli! If you've never tried this granola-like breakfast treat, this is a great recipe. Lots of bran and oats and raisins and nuts, with just enough brown sugar to add a bit of sweetness. Serve as is with soy milk, or plop the bowl in the microwave and eat it warm.", "title": "Muesli", "url": "http://allrecipes.com/recipe/14009/muesli/", "image": "http://images.media-allrecipes.com/userphotos/560x315/888014.jpg", "ingredients": ["4 1/2 cups rolled oats", "1/2 cup toasted wheat germ", "1/2 cup wheat bran", "1/2 cup oat bran", "1 cup raisins", "1/2 cup chopped walnuts", "1/4 cup packed brown sugar", "1/4 cup raw sunflower seeds"], "directions": ["In a large mixing bowl combine oats, wheat germ, wheat bran, oat bran, dried fruit, nuts, sugar, and seeds. Mix well. Store muesli in an airtight container. It keeps for 2 months at room temperature."]},
{"description": "Breaded and fried zucchini with onions.", "title": "Fried Zucchini", "url": "http://allrecipes.com/recipe/20889/fried-zucchini/", "image": "http://images.media-allrecipes.com/userphotos/250x250/454372.jpg", "ingredients": ["2 zucchini, quartered and sliced", "1 onion, sliced into rings", "1/2 cup all-purpose flour", "1/2 cup cornmeal", "1/2 teaspoon salt", "1/2 teaspoon ground black pepper", "1/4 teaspoon garlic powder", "1 cup vegetable oil for frying"], "directions": ["Place zucchini and onions in a medium bowl and mix together.", "In a small bowl mix flour, cornmeal, salt, pepper and garlic powder.", "Pour dry mixture over zucchini/onion mixture, cover bowl and shake well.  Let mixture sit for about 30 minutes; a batter will form on the vegetables.", "In a medium skillet heat oil over medium heat.  When oil is hot add breaded vegetables and fry, turning to brown evenly."]},
{"description": "Get every last bit of turkey goodness from your turkey by making broth from the carcass and simmering it into a hearty soup with lots of delicious vegetables and barley.", "title": "Turkey Carcass Soup", "url": "http://allrecipes.com/recipe/218804/turkey-carcass-soup/", "image": "http://images.media-allrecipes.com/userphotos/250x250/726270.jpg", "ingredients": ["1 turkey carcass", "4 quarts water", "6 small potatoes, diced", "4 large carrots, diced", "2 stalks celery, diced", "1 large onion, diced", "1 1/2 cups shredded cabbage", "1 (28 ounce) can whole peeled tomatoes, chopped", "1/2 cup uncooked barley", "1 tablespoon Worcestershire sauce", "1 1/2 teaspoons salt", "1 teaspoon dried parsley", "1 teaspoon dried basil", "1 bay leaf", "1/4 teaspoon freshly cracked black pepper", "1/4 teaspoon paprika", "1/4 teaspoon poultry seasoning", "1 pinch dried thyme"], "directions": ["Place the turkey carcass into a large soup pot or stock pot and pour in the water; bring to a boil, reduce heat to a simmer, and cook the turkey frame until the remaining meat falls off the bones, about 1 hour. Remove the turkey carcass and remove and chop any remaining turkey meat. Chop the meat.", "Strain the broth through a fine mesh strainer into a clean soup pot. Add the chopped turkey to the strained broth; bring the to a boil, reduce heat, and stir in the potatoes, carrots, celery, onion, cabbage, tomatoes, barley, Worcestershire sauce, salt, parsley, basil, bay leaf, black pepper, paprika, poultry seasoning, and thyme. Simmer until the vegetables are tender, about 1 more hour. Remove bay leaf before serving."]},
{"description": "This is best when prepared a day ahead. Makes zesty flavorful fajitas every time. Great for beef OR chicken.", "title": "Super Fajita Marinade", "url": "http://allrecipes.com/recipe/17475/super-fajita-marinade/", "image": "http://images.media-allrecipes.com/userphotos/560x315/3872449.jpg", "ingredients": ["3 limes, juiced", "2 green onions, chopped", "3 cloves garlic, minced", "3 tablespoons chopped fresh cilantro", "2 tablespoons vegetable oil", "1/2 teaspoon red pepper flakes", "1/4 teaspoon ground coriander", "1/4 teaspoon ground anise seed (optional)"], "directions": ["In a medium bowl, combine the lime juice, green onions, garlic, cilantro, oil, red pepper, coriander, and anise. Whisk until well blended.", "Pour mixture over your favorite meat, cover, and marinate for 12 to 24 hours before cooking as desired."]},
{"description": "Zucchini is sauteed with red onion, mushrooms, tomato and herbs.  You can use any veggies you like.  Serve over pasta, if desired.", "title": "Zucchini Saute", "url": "http://allrecipes.com/recipe/25267/zucchini-saute/", "image": "http://images.media-allrecipes.com/userphotos/560x315/3980640.jpg", "ingredients": ["1 tablespoon olive oil", "1/2 red onion, diced", "salt and pepper to taste", "4 zucchini, halved and sliced", "1/2 pound fresh mushrooms, sliced", "1 tomato, diced", "1 clove garlic, minced", "1 teaspoon Italian seasoning"], "directions": ["Heat oil in a large skillet over medium heat.  Saute onion with salt and pepper for 2 minutes.  Stir in zucchini and mushrooms.  When zucchini begins to soften, add tomatoes, garlic and Italian seasoning.  Cook until heated through."]},
{"description": "Chock full of nutritious cracked wheat, sunflower and flax seeds, this robust whole-wheat bread has a wonderfully complex flavor.", "title": "Dee's Health Bread", "url": "http://allrecipes.com/recipe/6670/dees-health-bread/", "image": "http://images.media-allrecipes.com/userphotos/250x250/111116.jpg", "ingredients": ["2 tablespoons active dry yeast", "1 teaspoon white sugar", "1/2 cup warm water", "3 1/2 cups warm water", "1/4 cup honey", "1/4 cup molasses", "1/2 cup vegetable oil", "2 eggs", "2 tablespoons lemon juice", "7 cups whole wheat flour", "1/4 cup flax seed", "1/4 cup cracked wheat", "1/4 cup sunflower seeds", "4 teaspoons salt", "4 cups bread flour"], "directions": ["In a small bowl, dissolve the yeast and sugar in 1/2 cup warm water. In a large bowl, mix remaining 3 1/2 cups warm water, honey, molasses, oil, eggs and lemon juice. Mix well. Add yeast mixture and stir.", "Gradually add 5 cups whole wheat flour beating well after each addition.  Add the flax, cracked wheat and sunflower seeds, stir well.", "Let stand for 20 minutes, until mixture is very light. Stir in salt and the rest of the flours until dough pulls away from the sides of the bowl.", "Knead 10 to 15 minutes until dough is smooth and elastic. Put into a greased bowl and cover, let rise in the oven with light on until doubled, about 1 hour.", "Punch down and shape into 6 round balls.  Cover and let rest for 20 minutes.", "Form into loaves and let rise covered in oven until doubled. Bake at 375 degrees F (190 degrees C) 25-35  minutes."]},
{"description": "This is a simple method for preparing pureed pumpkin. The pumpkin may be stored in the freezer for later usage in pies, muffins, etc.", "title": "Pumpkin Puree", "url": "http://allrecipes.com/recipe/22935/pumpkin-puree/", "image": "http://images.media-allrecipes.com/userphotos/560x315/300659.jpg", "ingredients": ["1 sugar pumpkin"], "directions": ["Preheat oven to 325 degrees F (165 degrees C).", "Cut the pumpkin in half, stem to base. Remove seeds and pulp. Cover each half with foil.", "Bake in the preheated oven, foil side up, 1 hour, or until tender.", "Scrape pumpkin meat from shell halves and puree in a blender. Strain to remove any remaining stringy pieces. Store in the freezer in freezer safe bags."]},
{"description": "Russet, red and sweet potatoes are roasted with olive oil, garlic and balsamic vinegar in this tasty low-fat side dish.", "title": "Roasted Potato Medley", "url": "http://allrecipes.com/recipe/15636/roasted-potato-medley/", "image": "http://images.media-allrecipes.com/userphotos/250x250/128318.jpg", "ingredients": ["1 russet potato, cubed", "1 red potato, cubed", "1 sweet potato, peeled and cubed", "2 tablespoons olive oil", "2 tablespoons balsamic vinegar", "2 teaspoons minced fresh thyme", "3 cloves garlic, minced", "1/4 cup low fat, low sodium chicken broth"], "directions": ["Preheat oven to 375 degrees F (190 degrees C).", "In a mixing bowl, combine the russet potato, red potato, sweet potato, olive oil, vinegar, thyme, garlic and chicken broth. Toss well to coat.", "Place into casserole dish and roast uncovered for 40 minutes, or until potatoes are tender."]},
{"description": "Ham is basted on the grill with an eye-opening horseradish sauce.", "title": "Doreen's Ham Slices on the Grill", "url": "http://allrecipes.com/recipe/25454/doreens-ham-slices-on-the-grill/", "image": "http://images.media-allrecipes.com/userphotos/560x315/847247.jpg", "ingredients": ["1 cup packed brown sugar", "1/4 cup lemon juice", "1/3 cup prepared horseradish", "2 slices ham"], "directions": ["Preheat an outdoor grill for high heat and lightly oil grate.", "In a small bowl, mix brown sugar, lemon juice and prepared horseradish.", "Heat the brown sugar mixture in the microwave on high heat 1 minute, or until warm.", "Score both sides of ham slices. Place on the prepared grill. Baste continuously with the brown sugar mixture while grilling. Grill 6 to 8 minutes per side, or to desired doneness."]},
{"description": "A wonderful, fresh, light way to serve chicken. Good over rice.", "title": "Chicken Scampi I", "url": "http://allrecipes.com/recipe/8593/chicken-scampi-i/", "image": "http://images.media-allrecipes.com/userphotos/560x315/469.jpg", "ingredients": ["5 (4 ounce) skinless, boneless chicken breast halves - cut into 1 inch strips", "1/4 teaspoon ground black pepper", "3 tablespoons grated Parmesan cheese", "1 tablespoon dried parsley", "1 clove garlic, minced", "1/4 teaspoon salt", "1 teaspoon dried oregano", "3 tablespoons lemon juice", "3 tablespoons Worcestershire sauce", "1/4 cup white wine"], "directions": ["Combine chicken with ground pepper, cheese, parsley, garlic, salt, oregano, lemon juice, Worcestershire sauce and wine in a shallow bowl.  Marinate in the refrigerator for several hours (overnight is best).", "Preheat broiler. Remove chicken from marinade (save marinade) and place in a shallow pan. Broil 8 inches from heat, turning once, until chicken is no longer pink inside (about 15 minutes).", "In a small saucepan, bring marinade to a boil. Pour over chicken, toss and serve. Yummy!"]},
{"description": "Tart green apples and sweet, tangy dried cherries and cranberries are nestled in cool, creamy vanilla yogurt in this easy side dish salad.", "title": "Autumn Apple Salad II", "url": "http://allrecipes.com/recipe/24832/autumn-apple-salad-ii/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1049369.jpg", "ingredients": ["4 tart green apples, cored and chopped", "1/4 cup blanched slivered almonds, toasted", "1/4 cup dried cranberries", "1/4 cup chopped dried cherries", "1 (8 ounce) container vanilla yogurt"], "directions": ["In a medium bowl, stir together the apples, almonds, cranberries, cherries and yogurt until evenly coated."]},
{"description": "Cool summer vegetables and warm spices make for a colorful, zesty salad!", "title": "Mexican Cucumber Salad", "url": "http://allrecipes.com/recipe/56136/mexican-cucumber-salad/", "image": "http://images.media-allrecipes.com/userphotos/560x315/212037.jpg", "ingredients": ["1 medium cucumber, chopped", "1 (8.75 ounce) can whole kernel corn, drained", "1 (16 ounce) can stewed tomatoes, drained and sliced", "1 green bell pepper, chopped", "1 red bell pepper, chopped", "2 tablespoons red wine vinegar", "1 tablespoon crushed red pepper flakes", "1/2 teaspoon garlic, minced", "1/2 teaspoon cumin", "1/4 teaspoon dried cilantro", "1/4 teaspoon salt", "1/8 teaspoon ground black pepper"], "directions": ["In a large bowl, toss together the cucumber, corn, tomatoes, green bell pepper, red bell pepper, and red wine vinegar. Season with crushed red pepper flakes, garlic, cumin, cilantro, salt, and black pepper. Cover, and chill at least 30 minutes before serving."]},
{"description": "Soy sauce and peanut butter add a nice Thai-style flavor to this stir-fry. Using frozen vegetables makes it a very quick and tasty vegetable side dish.", "title": "Frozen Vegetable Stir-Fry", "url": "http://allrecipes.com/recipe/222658/frozen-vegetable-stir-fry/", "image": "http://images.media-allrecipes.com/userphotos/560x315/4139937.jpg", "ingredients": ["2 tablespoons soy sauce", "1 tablespoon brown sugar", "2 teaspoons garlic powder", "2 teaspoons peanut butter", "2 teaspoons olive oil", "1 (16 ounce) package frozen mixed vegetables"], "directions": ["Combine soy sauce, brown sugar, garlic powder, and peanut butter in a small bowl.", "Heat oil in a large skillet over medium heat; cook and stir frozen vegetables until just tender, 5 to 7 minutes. Remove from heat and fold in soy sauce mixture."]},
{"description": "A wonderful, delightful fruit smoothie...it will help you cool down after a hot day in the sun.", "title": "Triple Threat Fruit Smoothie", "url": "http://allrecipes.com/recipe/87961/triple-threat-fruit-smoothie/", "image": "http://images.media-allrecipes.com/userphotos/250x250/213964.jpg", "ingredients": ["1 kiwi, sliced", "1 banana, peeled and chopped", "1/2 cup blueberries", "1 cup strawberries", "1 cup ice cubes", "1/2 cup orange juice", "1 (8 ounce) container peach yogurt"], "directions": ["In a blender, blend the kiwi, banana, blueberries, strawberries, ice, orange juice, and yogurt until smooth."]},
{"description": " Diced tomatoes and cucumbers, chopped onion, and a splash of lemon juice. Chill and serve to four.", "title": "Tomato Cucumber Salad", "url": "http://allrecipes.com/recipe/14157/tomato-cucumber-salad/", "image": "http://images.media-allrecipes.com/userphotos/250x250/850666.jpg", "ingredients": ["2 tomatoes, chopped", "1 cucumber, peeled and diced", "1 onion, chopped", "1 tablespoon lemon juice", "salt to taste", "ground black pepper to taste"], "directions": ["Combine tomatoes, cucumbers, and onions in a salad bowl. Season to taste with salt and black pepper.  Sprinkle with lemon juice.  Chill."]},
{"description": "Best eaten at room temperature. Originally submitted to ThanksgivingRecipe.com.", "title": "Baked Sweet Potato Sticks", "url": "http://allrecipes.com/recipe/9075/baked-sweet-potato-sticks/", "image": "http://images.media-allrecipes.com/userphotos/560x315/39922.jpg", "ingredients": ["1 tablespoon olive oil", "1/2 teaspoon paprika", "8 sweet potatoes, sliced lengthwise into quarters"], "directions": ["Preheat oven to 400 degrees F (200 degrees C). Spray a baking sheet with cooking spay or vegetable oil.", "In a large bowl, mix oil and paprika. Add potato sticks, and stir by hand to coat.  Place on the prepared baking sheet.", "Bake 40 minutes in the preheated oven. Best eaten at room temperature."]},
{"description": "No need for alarm: the vinegar tenderizes the chicken while imparting an uncommon tang.", "title": "Cider Vinegar Chicken", "url": "http://allrecipes.com/recipe/15889/cider-vinegar-chicken/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2272485.jpg", "ingredients": ["6 skinless, boneless chicken breasts", "5 teaspoons garlic salt", "1 cup cider vinegar"], "directions": ["Preheat oven to 350 degrees F (175 degrees C).", "Place chicken breasts in a 9x13 inch baking dish. Sprinkle with garlic salt, then pour vinegar over all.", "Bake at 350 degrees F (175 degrees C) for 35 minutes or until chicken is browned and cooked through, and juices run clear."]},
{"description": "This is a low-fat, low-cal soup that's incredibly filling and delicious.  I eat this at least once a week!  I don't know how it tastes cold, though. Don't be afraid to vary the proportions of various foods on your own!", "title": "Thai Chicken Cabbage Soup", "url": "http://allrecipes.com/recipe/22139/thai-chicken-cabbage-soup/", "image": "http://images.media-allrecipes.com/userphotos/560x315/272376.jpg", "ingredients": ["3 skinless, boneless chicken breast halves", "8 cups chicken broth", "2 leeks, sliced", "6 carrots, cut into 1 inch pieces", "1 medium head cabbage, shredded", "1 (8 ounce) package uncooked egg noodles", "1 teaspoon Thai chile sauce"], "directions": ["Place chicken breasts and broth in to a stockpot or Dutch oven. Bring to a boil and let simmer for about 20 minutes, or until chicken is cooked through. Remove the chicken from the broth and set aside to cool.", "Put the leeks and carrots into the pot and simmer them for 10 minutes, or until tender. Shred the cooled chicken in to bite sized pieces and return it to the pot. Add the cabbage and egg noodles and cook another 5 minutes or until the noodles are soft. The soup should be thick like a stew. Serve hot and flavor to taste with Thai chili sauce."]},
{"description": "Delicious halibut is cooked with an array of spicy flavors to make the perfect filling for tacos!", "title": "Anaheim Fish Tacos", "url": "http://allrecipes.com/recipe/53604/anaheim-fish-tacos/", "image": "http://images.media-allrecipes.com/userphotos/560x315/14863.jpg", "ingredients": ["1 teaspoon vegetable oil", "1 Anaheim chile pepper, chopped", "1 leek, chopped", "2 cloves garlic, crushed", "salt and pepper to taste", "1 cup chicken broth", "2 large tomatoes, diced", "1/2 teaspoon ground cumin", "1 1/2 pounds halibut fillets", "1 lime", "12 corn tortillas"], "directions": ["Heat the oil in a large skillet over medium heat, and saute the chile, leek, and garlic until tender and lightly browned. Season with salt and pepper.", "Mix the chicken broth and tomatoes into the skillet, and season with cumin. Bring to a boil. Reduce heat to low. Place the halibut into the mixture. Sprinkle with lime juice. Cook 15 to 20 minutes until the halibut is easily flaked with a fork. Wrap in warmed corn tortillas to serve."]},
{"description": "This blueberry, banana, and flax smoothie is to die for!  It tastes so good, you forget that it's good for ya!", "title": "Heavenly Blueberry Smoothie", "url": "http://allrecipes.com/recipe/100822/heavenly-blueberry-smoothie/", "image": "http://images.media-allrecipes.com/userphotos/560x315/410436.jpg", "ingredients": ["1 frozen banana, thawed for 10 to 15 minutes", "1/2 cup vanilla soy milk", "1 cup vanilla fat-free yogurt", "1 1/2 teaspoons flax seed meal", "1 1/2 teaspoons honey", "2/3 cup frozen blueberries"], "directions": ["Cut banana into small pieces and place into the bowl of a blender.  Add the soy milk, yogurt, flax seed meal, and honey.  Blend on lowest speed until smooth, about 5 seconds.  Gradually add the blueberries while continuing to blend on low.  Once the blueberries have been incorporated, increase speed, and blend to desired consistency."]},
{"description": "Nutrient-rich kale is hidden in this delicious banana smoothie. . . perfect for those of us who have a hard time getting our daily dose of veggies!", "title": "Kale and Banana Smoothie", "url": "http://allrecipes.com/recipe/173730/kale-and-banana-smoothie/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1069114.jpg", "ingredients": ["1 banana", "2 cups chopped kale", "1/2 cup light unsweetened soy milk", "1 tablespoon flax seeds", "1 teaspoon maple syrup"], "directions": ["Place the banana, kale, soy milk, flax seeds, and maple syrup into a blender. Cover, and puree until smooth. Serve over ice."]},
{"description": "This is a wonderful, simple recipe for an apple cinnamon oatmeal.  Even the kids can make this one!", "title": "Apple Cinnamon Oatmeal", "url": "http://allrecipes.com/recipe/79828/apple-cinnamon-oatmeal/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1023606.jpg", "ingredients": ["1 cup water", "1/4 cup apple juice", "1 apple, cored and chopped", "2/3 cup rolled oats", "1 teaspoon ground cinnamon", "1 cup milk"], "directions": ["Combine the water, apple juice, and apples in a saucepan. Bring to a boil over high heat, and stir in the rolled oats and cinnamon. Return to a boil, then reduce heat to low, and simmer until thick, about 3 minutes. Spoon into serving bowls, and pour milk over the servings."]},
{"description": "Sauteed shrimp braised with white wine and lime juice and seasoned with cilantro and cayenne pepper. Simple, quick and delicious. Serve with a grilled corn and salsa salad.", "title": "Shrimp Durango", "url": "http://allrecipes.com/recipe/18130/shrimp-durango/", "image": "http://images.media-allrecipes.com/userphotos/250x250/190427.jpg", "ingredients": ["1 pound dry fettuccine pasta", "3 tablespoons butter", "1 pound shrimp, peeled and deveined", "1/2 cup white wine", "2 tablespoons lime juice", "1/2 bunch cilantro, finely chopped", "1/8 teaspoon cayenne pepper", "salt and pepper to taste"], "directions": ["Bring a large pot of water to boil, add fettuccine noodles and return water to boil. Cook until noodles are al dente. Drain well.", "Meanwhile, in a large skillet, melt butter over medium heat, add shrimp and cook about 3 minutes, until shrimp turn pink. Remove shrimp from heat and set aside.", "Pour wine and lime juice into the skillet used to cook the shrimp. Bring the mixture to a boil. Boil until the mixture is reduced by half, about 2 minutes. Return shrimp to skillet. Add cilantro, cayenne pepper and salt and pepper. Stir to heat the mixture through, about 2 minutes. Toss with pasta and serve."]},
{"description": "I have tried a lot of recipes of Eastern North Carolina BBQ Sauce. This is the closest to what you will find in any of the BBQ Restaurants here in North Carolina. It is on the hot side, so you may wish to adjust the cayenne pepper and Tabasco(TM) sauce for milder flavor.", "title": "Eastern North Carolina BBQ Sauce", "url": "http://allrecipes.com/recipe/58486/eastern-north-carolina-bbq-sauce/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2253447.jpg", "ingredients": ["1 cup white vinegar", "1 cup cider vinegar", "1 tablespoon brown sugar", "1 tablespoon cayenne pepper", "1 tablespoon hot pepper sauce (e.g. Tabasco™), or to taste", "1 teaspoon salt", "1 teaspoon ground black pepper"], "directions": ["Combine the white vinegar, cider vinegar, brown sugar, cayenne pepper, hot pepper sauce, salt and pepper in a jar or bottle with a tight-fitting lid. Refrigerate for 1 to 2 days before using so that the flavors will blend. Shake occasionally, and store for up to 2 months in the refrigerator."]},
{"description": "Use a little sugar and lemon juice in the water to make the sweetest, quickest, tastiest boiled corn on the cob.", "title": "Jamie's Sweet and Easy Corn on the Cob", "url": "http://allrecipes.com/recipe/222352/jamies-sweet-and-easy-corn-on-the-cob/", "image": "http://images.media-allrecipes.com/userphotos/560x315/840195.jpg", "ingredients": ["2 tablespoons white sugar", "1 tablespoon lemon juice", "6 ears corn on the cob, husks and silk removed"], "directions": ["Fill a large pot about 3/4 full of water and bring to a boil. Stir in sugar and lemon juice, dissolving the sugar. Gently place ears of corn into boiling water, cover the pot, turn off the heat, and let the corn cook in the hot water until tender, about 10 minutes."]},
{"description": "Leftover brown rice is reborn in this chicken fried rice with peppers and onions. Black pepper, paprika, or dried parsley may be used to season after this is cooked.", "title": "Garlic Chicken Fried Brown Rice", "url": "http://allrecipes.com/recipe/78144/garlic-chicken-fried-brown-rice/", "image": "http://images.media-allrecipes.com/userphotos/560x315/278676.jpg", "ingredients": ["2 tablespoons vegetable oil, divided", "8 ounces skinless, boneless chicken breast, cut into strips", "1/2 red bell pepper, chopped", "1/2 cup green onion, chopped", "4 cloves garlic, minced", "3 cups cooked brown rice", "2 tablespoons light soy sauce", "1 tablespoon rice vinegar", "1 cup frozen peas, thawed"], "directions": ["Heat 1 tablespoon of vegetable oil in a large skillet set over medium heat. Add the chicken, bell pepper, green onion and garlic. Cook and stir until the chicken is cooked through, about 5 minutes. Remove the chicken to a plate and keep warm.", "Heat the remaining tablespoon of oil in the same skillet over medium-high heat. Add the rice; cook and stir to heat through. Stir in the soy sauce, rice vinegar and peas, and continue to cook for 1 minute. Return the chicken mixture to the skillet and stir to blend with the rice and heat through before serving."]},
{"description": "Baby lima beans are steamed in chicken broth. This is a very tasty lima bean recipe that is also low in fat.", "title": "Easy Lima Beans", "url": "http://allrecipes.com/recipe/46990/easy-lima-beans/", "image": "http://images.media-allrecipes.com/userphotos/250x250/64103.jpg", "ingredients": ["cooking spray", "1/2 medium onion, finely chopped", "1 1/2 cups chicken broth", "1 (16 ounce) package frozen baby lima beans"], "directions": ["Heat a large saucepan over medium heat, and spray with cooking spray. Saute onions until soft and translucent. Pour in chicken broth, and bring to a boil. Add lima beans, and enough water just to cover. Bring to a boil, then reduce heat to low, cover, and simmer for 30 minutes, until beans are tender."]},
{"description": "Delicious waffles with banana cooked inside the waffle!", "title": "Banana Waffles", "url": "http://allrecipes.com/recipe/21271/banana-waffles/", "image": "http://images.media-allrecipes.com/userphotos/250x250/454371.jpg", "ingredients": ["1 1/4 cups all-purpose flour", "3 teaspoons baking powder", "1/2 teaspoon salt", "1 pinch ground nutmeg", "1 cup 1% milk", "1 egg", "2 ripe bananas, sliced"], "directions": ["Preheat waffle iron. In a large mixing bowl, sift together flour, baking powder, salt and nutmeg. Stir in milk and eggs until mixture is smooth.", "Spray preheated waffle iron with non-stick cooking spray. Pour two tablespoons of the waffle batter onto the hot waffle iron. Place two slices of banana on top of the batter and then spoon another two tablespoons of batter on top of the banana. Cook until golden brown. Serve hot."]},
{"description": "A warm, flavorful dish filled with mahi-mahi, fresh fruit and an exotic ginger-lime dressing. Unique, yet tasteful, this recipe is inspired by the fresh seafood recipes in Mexico and Central America.", "title": "Soft Mahi Mahi Tacos with Ginger-Lime Dressing", "url": "http://allrecipes.com/recipe/164313/soft-mahi-mahi-tacos-with-ginger-lime-dressing/", "image": "http://images.media-allrecipes.com/userphotos/250x250/829701.jpg", "ingredients": ["1 tablespoon olive oil", "salt and pepper to taste", "6 (3 ounce) fillets mahi mahi fillets", "1/3 cup sour cream", "1 tablespoon lime juice", "1 teaspoon minced fresh ginger root", "1/4 teaspoon ground cumin", "1 dash cayenne pepper", "1 large mango - peeled, seeded and diced", "1 cup diced fresh pineapple", "1 avocado - peeled, pitted and diced", "1 jalapeno pepper, minced", "6 (6 inch) flour tortillas, warmed", "1 cup chopped fresh cilantro"], "directions": ["Heat the olive oil in a large skillet over medium-high heat. Season the mahi-mahi with salt and pepper. Cook the fillets in the hot oil until the fish is golden brown on each side, and no longer translucent in the center, about 3 minutes per side.", "Meanwhile, whisk together the sour cream, lime juice, ginger, cumin, cayenne pepper, salt and pepper to taste; set aside. Gently combine the mango, pineapple, avocado, and jalapeno in a bowl.", "To assemble, place a cooked mahi-mahi fillet into the center of a warmed tortilla. Place a scoop of the mango salsa onto the fish, then drizzle with the sour cream sauce, and finish with a generous pinch of chopped cilantro."]},
{"description": "Made in minutes in a food processor, this sweet-tangy cranberry salsa gets its heat from a jalapeno pepper combined with chopped cilantro, green onions, lime juice, and sugar.", "title": "Cranberry Salsa", "url": "http://allrecipes.com/recipe/141135/cranberry-salsa/", "image": "http://images.media-allrecipes.com/userphotos/250x250/525441.jpg", "ingredients": ["1 (12 ounce) bag cranberries, fresh or frozen", "1 bunch cilantro, chopped", "1 bunch green onions, cut into 3 inch lengths", "1 jalapeno pepper, seeded and minced", "2 limes, juiced", "3/4 cup white sugar", "1 pinch salt"], "directions": ["Combine cranberries, cilantro, green onions, jalapeno pepper, lime juice, sugar, and salt in the bowl of a food processor fitted with a medium blade. Chop to medium consistency. Refrigerate if not using immediately. Serve at room temperature."]},
{"description": "Here's an Asian twist to making quinoa. What a little ginger, garlic, and soy sauce can do to update your favorite side dish!", "title": "Quinoa with Asian Flavors", "url": "http://allrecipes.com/recipe/199598/quinoa-with-asian-flavors/", "image": "http://images.media-allrecipes.com/userphotos/250x250/470894.jpg", "ingredients": ["1 tablespoon extra-virgin olive oil", "1 cup quinoa", "2 cups chicken broth", "2 tablespoons soy sauce", "1 tablespoon minced fresh ginger root", "1 clove garlic, minced", "2 green onions, chopped"], "directions": ["Heat olive oil in a saucepan over medium heat. Stir in quinoa and allow to toast for 2 to 3 minutes, then add chicken broth, soy sauce, ginger and garlic. Increase heat and bring to a boil. Cover and reduce heat to low. Simmer  until all liquid has been absorbed, 25 to 30 minutes. Fluff quinoa with fork and top with green onions before serving."]},
{"description": "This is my interpretation of the green beans from my favorite Japanese restaurant. Serve with a grilled steak! You can omit the miso paste if you choose.", "title": "Quick Sesame Green Beans", "url": "http://allrecipes.com/recipe/99322/quick-sesame-green-beans/", "image": "http://images.media-allrecipes.com/userphotos/250x250/39842.jpg", "ingredients": ["8 ounces fresh green beans, trimmed", "2 tablespoons low sodium soy sauce", "1/2 tablespoon miso paste", "1/2 teaspoon red pepper flakes", "4 cloves garlic, minced", "1 teaspoon grated fresh ginger root", "1 tablespoon sesame seeds, toasted"], "directions": ["Place the green beans into a steamer insert and set in a pot over one inch of water. Bring to a boil, cover and steam for 5 minutes. Remove from the heat and transfer beans to a serving bowl.", "Meanwhile, in a small bowl, stir together the soy sauce, miso paste, red pepper flakes, garlic and ginger. Pour over the green beans and toss to coat. Sprinkle sesame seeds on top."]},
{"description": "A great way to use up some of the extra kale you might have in your garden! You can use other similar greens in this recipe - spinach, mustard greens, and arugula will all work.  A mixture of greens is also quite good.  Serve as a salad, as a side dish, or as a main dish with rice.", "title": "Stir Fried Kale", "url": "http://allrecipes.com/recipe/14091/stir-fried-kale/", "image": "http://images.media-allrecipes.com/userphotos/560x315/35820.jpg", "ingredients": ["3 tablespoons olive oil", "1 onion, chopped", "3 cloves garlic, minced", "1 cup bread crumbs", "3 bunches kale - washed, dried, and shredded"], "directions": ["Heat oil over medium-high heat in a large frying pan.  Add onions and garlic; cook and stir until soft.", "Mix in breadcrumbs, and cook and stir until brown.", "Stir in kale, and cook until wilted.  Serve hot or warm."]},
{"description": "Replace spaghetti noodles with \"zoodles\", noodles made from zucchini, in this Greek salad with olive, tomato, and feta cheese.", "title": "Greek Zoodle Salad", "url": "http://allrecipes.com/recipe/241792/greek-zoodle-salad/", "image": "http://images.media-allrecipes.com/userphotos/560x315/3458112.jpg", "ingredients": ["2 zucchini", "1/4 English cucumber, chopped", "10 cherry tomatoes, halved, or more to taste", "10 pitted kalamata olives, halved, or more to taste", "1/4 cup thinly sliced red onion", "2 ounces crumbled reduced-fat feta cheese", "2 tablespoons extra-virgin olive oil", "2 tablespoons fresh lemon juice", "1 teaspoon dried oregano", "salt and ground black pepper to taste"], "directions": ["Cut zucchini into noodle-shaped strands using a spiralizing tool. Place \"zoodles\" in a large bowl and top with cucumber, tomatoes, olives, red onion, and feta cheese.", "Whisk olive oil, lemon juice, oregano, salt, and pepper together in a bowl until dressing is smooth; pour over \"zoodle\" mixture and toss to coat. Marinate salad in refrigerator for 10 to 15 minutes."]},
{"description": "An unbelievably simple, yet flavorful dish! Serve with rice, a green salad and a nice glass of red wine. It's low in fat, too!", "title": "Pork with Peach and Black Bean Salsa", "url": "http://allrecipes.com/recipe/17454/pork-with-peach-and-black-bean-salsa/", "image": "http://images.media-allrecipes.com/userphotos/250x250/682663.jpg", "ingredients": ["1 pound pork tenderloin, cubed", "salt and pepper to taste", "1/4 cup cornmeal", "1 tablespoon olive oil", "1/4 cup beer", "1 cup prepared salsa", "1 (15 ounce) can sliced canned peaches, drained", "1/2 (15 ounce) can black beans; drain and reserve liquid", "1 tablespoon chopped fresh cilantro"], "directions": ["Season cubed pork with salt and pepper to taste. Place meat in a large plastic bag with the cornmeal. Shake well to coat the meat.", "Heat the oil in a large skillet over medium high heat. Place the coated meat in the skillet and saute for 5 to 10 minutes, or until browned. Reduce heat to medium.", "Pour in the beer, salsa, peaches and beans with 2 tablespoons reserved liquid. Stir well and simmer for 15 to 20 minutes. Stir in the cilantro."]},
{"description": "Tender quinoa is simmered with apple juice, raisins, and lemon juice and spiced with cinnamon and vanilla and served warm.", "title": "Quinoa Pudding", "url": "http://allrecipes.com/recipe/19587/quinoa-pudding/", "image": "http://images.media-allrecipes.com/userphotos/250x250/27678.jpg", "ingredients": ["1 cup quinoa", "2 cups water", "2 cups apple juice", "1 cup raisins", "2 tablespoons lemon juice", "1 teaspoon ground cinnamon, or to taste", "salt to taste", "2 teaspoons vanilla extract"], "directions": ["Place quinoa in a sieve and rinse thoroughly. Allow to drain, then place quinoa in a medium saucepan with water. Bring to a boil over high heat. Cover pan with lid, lower heat, and allow to simmer until all water is absorbed and quinoa is tender, about 15 minutes.", "Mix in apple juice, raisins, lemon juice, cinnamon, and salt. Cover pan and allow to simmer for 15 minutes longer. Stir in vanilla extract. Serve warm."]},
{"description": "These cookies are nutritious, as well as delicious.", "title": "Healthy Banana Cookies", "url": "http://allrecipes.com/recipe/9615/healthy-banana-cookies/", "image": "http://images.media-allrecipes.com/userphotos/250x250/77047.jpg", "ingredients": ["3 ripe bananas", "2 cups rolled oats", "1 cup dates, pitted and chopped", "1/3 cup vegetable oil", "1 teaspoon vanilla extract"], "directions": ["Preheat oven to 350 degrees F (175 degrees C).", "In a large bowl, mash the bananas.  Stir in oats, dates, oil, and vanilla.  Mix well, and allow to sit for 15 minutes. Drop by teaspoonfuls onto an ungreased cookie sheet.", "Bake for 20 minutes in the preheated oven, or until lightly brown."]},
{"description": "A family favourite that fills the house with a cinnamon aroma. A delicious plum dessert, dusted with icing sugar!", "title": "Plum Clafouti", "url": "http://allrecipes.com/recipe/41234/plum-clafouti/", "image": "http://images.media-allrecipes.com/userphotos/560x315/420558.jpg", "ingredients": ["6 tablespoons white sugar, divided", "14 Italian prune plums, halved and pitted", "3 eggs", "1 1/3 cups milk", "2/3 cup all-purpose flour", "1 1/2 teaspoons grated lemon zest", "2 teaspoons vanilla", "1 pinch salt", "1/2 teaspoon ground cinnamon", "2 tablespoons confectioners' sugar"], "directions": ["Preheat the oven to 375 degrees F (190 degrees C). Butter a 10 inch pie plate, and sprinkle 1 tablespoon of sugar over the bottom.", "Arrange the plum halves, cut side down, so that they cover the entire bottom of the pie plate. Sprinkle 2 tablespoons of sugar over the top of the plums. In a blender, combine the remaining 3 tablespoons of sugar, eggs, milk, flour, lemon zest, cinnamon, vanilla, and salt. Process until smooth, about 2 minutes. Pour over the fruit in the pan.", "Bake for 50 to 60 minutes in the preheated oven, or until firm and lightly browned.  Let stand 5 minutes before slicing. Dust with confectioners' sugar before serving."]},
{"description": "This muffin has a little bit of everything - carrots, raisins, apple butter, wheat germ, nuts. A perfect start for your day!", "title": "Morning Glory Muffins I", "url": "http://allrecipes.com/recipe/7159/morning-glory-muffins-i/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2655387.jpg", "ingredients": ["1 1/2 cups all-purpose flour", "1/2 cup whole wheat flour", "1 1/4 cups white sugar", "1 tablespoon ground cinnamon", "2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "2 cups grated carrots", "1 apple - peeled, cored, and chopped", "1 cup raisins", "1 egg", "2 egg whites", "1/2 cup apple butter", "1/4 cup vegetable oil", "1 tablespoon vanilla extract", "2 tablespoons chopped walnuts", "2 tablespoons toasted wheat germ"], "directions": ["Preheat oven to 375 degrees F (190 degrees C).  Lightly oil 18 muffin cups, or coat with nonstick cooking spray.", "In a medium bowl, whisk together eggs, egg whites, apple butter, oil and vanilla.", "In a large bowl, stir together flours, sugar, cinnamon, baking powder, baking soda and salt.  Stir in carrots, apples and raisins. Stir in apple butter mixture until just moistened.  Spoon the batter into the prepared muffin cups, filling them about 3/4 full.", "In a small bowl, combine walnuts and wheat germ; sprinkle over the muffin tops.", "Bake at 375 degrees F (190 degrees C) for 15 to 20 minutes, or until the tops are golden and spring back when lightly pressed."]},
{"description": "Break out your soup pot and fix up a batch of this delicious, spicy vegetarian chili today! It's ready in no time, and packed with vegetables, beans - and flavor!", "title": "The Best Vegetarian Chili in the World", "url": "http://allrecipes.com/recipe/72508/the-best-vegetarian-chili-in-the-world/", "image": "http://images.media-allrecipes.com/userphotos/250x250/176541.jpg", "ingredients": ["1 tablespoon olive oil", "1/2 medium onion, chopped", "2 bay leaves", "1 teaspoon ground cumin", "2 tablespoons dried oregano", "1 tablespoon salt", "2 stalks celery, chopped", "2 green bell peppers, chopped", "2 jalapeno peppers, chopped", "3 cloves garlic, chopped", "2 (4 ounce) cans chopped green chile peppers, drained", "2 (12 ounce) packages vegetarian burger crumbles", "3 (28 ounce) cans whole peeled tomatoes, crushed", "1/4 cup chili powder", "1 tablespoon ground black pepper", "1 (15 ounce) can kidney beans, drained", "1 (15 ounce) can garbanzo beans, drained", "1 (15 ounce) can black beans", "1 (15 ounce) can whole kernel corn"], "directions": ["Heat the olive oil in a large pot over medium heat. Stir in the onion, and season with bay leaves, cumin, oregano, and salt. Cook and stir until onion is tender, then mix in the celery, green bell peppers, jalapeno peppers, garlic, and green chile peppers. When vegetables are heated through, mix in the vegetarian burger crumbles. Reduce heat to low, cover pot, and simmer 5 minutes.", "Mix the tomatoes into the pot. Season chili with chili powder and pepper. Stir in the kidney beans, garbanzo beans, and black beans. Bring to a boil, reduce heat to low, and simmer 45 minutes. Stir in the corn, and continue cooking 5 minutes before serving."]},
{"description": "This hearty black bean chili has ground turkey, is flavored with chili powder, oregano and basil, and perked up with a spoonful of red wine vinegar.", "title": "Fantastic Black Bean Chili", "url": "http://allrecipes.com/recipe/23336/fantastic-black-bean-chili/", "image": "http://images.media-allrecipes.com/userphotos/250x250/211159.jpg", "ingredients": ["1 tablespoon vegetable oil", "1 onion, diced", "2 cloves garlic, minced", "1 pound ground turkey", "3 (15 ounce) cans black beans, undrained", "1 (14.5 ounce) can crushed tomatoes", "1 1/2 tablespoons chili powder", "1 tablespoon dried oregano", "1 tablespoon dried basil leaves", "1 tablespoon red wine vinegar"], "directions": ["Heat the oil in a large heavy pot over medium heat; cook onion and garlic until onions are translucent. Add turkey and cook, stirring, until meat is brown.  Stir in beans, tomatoes, chili powder, oregano, basil and vinegar.  Reduce heat to low, cover and simmer 60 minutes or more, until flavors are well blended."]},
{"description": "Best brine for smoked turkey around. This recipe was given to me by my uncle. He is always smoking meat.", "title": "Out of this World Turkey Brine", "url": "http://allrecipes.com/recipe/85839/out-of-this-world-turkey-brine/", "image": "http://images.media-allrecipes.com/userphotos/250x250/53148.jpg", "ingredients": ["2 gallons water", "1 1/2 cups canning salt", "3 tablespoons minced garlic", "1 tablespoon ground black pepper", "1/4 cup Worcestershire sauce", "1/3 cup brown sugar"], "directions": ["In a food-grade large bucket or container large enough to hold your turkey, mix together the water, salt, garlic, pepper, Worcestershire sauce and brown sugar. Store in a refrigerator, and soak turkey for 2 days before smoking or roasting."]},
{"description": "Serve this tasty sandwich spread on crusty whole grain rolls or pita bread, with lettuce and tomato.", "title": "Vegetarian Chickpea Sandwich Filling", "url": "http://allrecipes.com/recipe/16715/vegetarian-chickpea-sandwich-filling/", "image": "http://images.media-allrecipes.com/userphotos/560x315/362677.jpg", "ingredients": ["1 (19 ounce) can garbanzo beans, drained and rinsed", "1 stalk celery, chopped", "1/2 onion, chopped", "1 tablespoon mayonnaise", "1 tablespoon lemon juice", "1 teaspoon dried dill weed", "salt and pepper to taste"], "directions": ["Drain and rinse chickpeas. Pour chickpeas into a medium size mixing bowl and mash with a fork. Mix in celery, onion, mayonnaise (to taste), lemon juice, dill, salt and pepper to taste."]},
{"description": "Finely chopped Serrano chilies make this salsa nippy and nice. Combine with tomatoes, onions, cilantro and lime juice, and this salsa is ready for dipping.", "title": "Fresh Tomato Salsa", "url": "http://allrecipes.com/recipe/14088/fresh-tomato-salsa/", "image": "http://images.media-allrecipes.com/userphotos/250x250/456311.jpg", "ingredients": ["3 tomatoes, chopped", "1/2 cup finely diced onion", "5 serrano chiles, finely chopped", "1/2 cup chopped fresh cilantro", "1 teaspoon salt", "2 teaspoons lime juice"], "directions": ["In a medium bowl, stir together tomatoes, onion, chili peppers, cilantro, salt, and lime juice. Chill for one hour in the refrigerator before serving."]},
{"description": "Tomato sauce, cannelini beans, navy beans and ditalini pasta are seasoned with parsley, basil and oregano in this chunky soup.", "title": "Andrea's Pasta Fagioli", "url": "http://allrecipes.com/recipe/25690/andreas-pasta-fagioli/", "image": "http://images.media-allrecipes.com/userphotos/250x250/223672.jpg", "ingredients": ["3 tablespoons olive oil", "1 onion, quartered then halved", "2 cloves garlic, minced", "1 (29 ounce) can tomato sauce", "5 1/2 cups water", "1 tablespoon dried parsley", "1 1/2 teaspoons dried basil", "1 1/2 teaspoons dried oregano", "1 teaspoon salt", "1 (15 ounce) can cannellini beans", "1 (15 ounce) can navy beans", "1/3 cup grated Parmesan cheese", "1 pound ditalini pasta"], "directions": ["In a large pot over medium heat, cook onion in olive oil until translucent.  Stir in garlic and cook until tender.  Reduce heat, and stir in tomato sauce, water, parsley, basil, oregano, salt, cannelini beans, navy beans and Parmesan.  Simmer 1 hour.", "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.  Stir into soup."]},
{"description": "Delicious fajita marinade made with lime juice, olive oil, and soy sauce, and spiced up with cayenne and black pepper. Makes enough marinade for 2 pounds of meat.", "title": "Fajita Marinade I", "url": "http://allrecipes.com/recipe/19963/fajita-marinade-i/", "image": "http://images.media-allrecipes.com/userphotos/560x315/687200.jpg", "ingredients": ["1/4 cup lime juice", "1/3 cup water", "2 tablespoons olive oil", "4 cloves garlic, crushed", "2 teaspoons soy sauce", "1 teaspoon salt", "1/2 teaspoon liquid smoke flavoring", "1/2 teaspoon cayenne pepper", "1/2 teaspoon ground black pepper"], "directions": ["In a large resealable plastic bag, mix together the lime juice, water, olive oil, garlic, soy sauce, salt, and liquid smoke flavoring. Stir in cayenne and black pepper.", "Place desired meat in the marinade, and refrigerate at least 2 hours, or overnight. Cook as desired."]},
{"description": "Use a slow cooker to make this chili with chicken, pinto beans, and corn, flavored with salsa, cumin, and chili powder.", "title": "Chicken and Corn Chili", "url": "http://allrecipes.com/recipe/12906/chicken-and-corn-chili/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1964141.jpg", "ingredients": ["4 skinless, boneless chicken breast halves", "1 (16 ounce) jar salsa", "2 teaspoons garlic powder", "1 teaspoon ground cumin", "1 teaspoon chili powder", "salt to taste", "ground black pepper to taste", "1 (11 ounce) can Mexican-style corn", "1 (15 ounce) can pinto beans"], "directions": ["Place chicken and salsa in the slow cooker the night before you want to eat this chili. Season with garlic powder, cumin, chili powder, salt, and pepper. Cook 6 to 8 hours on Low setting.", "About 3 to 4 hours before you want to eat, shred the chicken with 2 forks. Return the meat to the pot, and continue cooking.", "Stir the corn and the pinto beans into the slow cooker. Simmer until ready to serve."]},
{"description": "A light marinade of soy sauce, brown sugar, and sherry with sesame and spices tenderizes these chicken pineapple kabobs into an aloha grilled dream of a dish!", "title": "Hawaiian Chicken Kabobs", "url": "http://allrecipes.com/recipe/20415/hawaiian-chicken-kabobs/", "image": "http://images.media-allrecipes.com/userphotos/560x315/393772.jpg", "ingredients": ["3 tablespoons soy sauce", "3 tablespoons brown sugar", "2 tablespoons sherry", "1 tablespoon sesame oil", "1/4 teaspoon ground ginger", "1/4 teaspoon garlic powder", "8 skinless, boneless chicken breast halves - cut into 2 inch pieces", "1 (20 ounce) can pineapple chunks, drained", "skewers"], "directions": ["In a shallow glass dish, mix the soy sauce, brown sugar, sherry, sesame oil, ginger, and garlic powder. Stir the chicken pieces and pineapple into the marinade until well coated. Cover, and marinate in the refrigerator at least 2 hours.", "Preheat grill to medium-high heat.", "Lightly oil the grill grate. Thread chicken and pineapple alternately onto skewers. Grill 15 to 20 minutes, turning occasionally, or until chicken juices run clear."]},
{"description": "Spicy grilled fish are cooled down with a fresh crunchy veggie salsa featuring fresh corn. Your guests will swim back for seconds!", "title": "Fiery Fish Tacos with Crunchy Corn Salsa", "url": "http://allrecipes.com/recipe/74337/fiery-fish-tacos-with-crunchy-corn-salsa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/289814.jpg", "ingredients": ["2 cups cooked corn kernels", "1/2 cup diced red onion", "1 cup peeled, diced jicama", "1/2 cup diced red bell pepper", "1 cup fresh cilantro leaves, chopped", "1 lime, juiced and zested", "2 tablespoons cayenne pepper, or to taste", "1 tablespoon ground black pepper", "2 tablespoons salt, or to taste", "6 (4 ounce) fillets tilapia", "2 tablespoons olive oil", "12 corn tortillas, warmed", "2 tablespoons sour cream, or to taste"], "directions": ["Preheat grill for high heat.", "In a medium bowl, mix together corn, red onion, jicama, red bell pepper, and cilantro. Stir in lime juice and zest.", "In a small bowl, combine cayenne pepper, ground black pepper, and salt.", "Brush each fillet with olive oil, and sprinkle with spices to taste.", "Arrange fillets on grill grate, and cook for 3 minutes per side. For each fiery fish taco, top two corn tortillas with fish, sour cream, and corn salsa."]},
{"description": "Skewered chicken tenders are brushed with a tropical mixture of pineapple juice, brown sugar, and soy sauce, and  grilled.", "title": "Pineapple Chicken Tenders", "url": "http://allrecipes.com/recipe/14526/pineapple-chicken-tenders/", "image": "http://images.media-allrecipes.com/userphotos/560x315/227447.jpg", "ingredients": ["1 cup pineapple juice", "1/2 cup packed brown sugar", "1/3 cup light soy sauce", "2 pounds chicken breast tenderloins or strips", "skewers"], "directions": ["In a small saucepan over medium heat, mix pineapple juice, brown sugar, and soy sauce. Remove from heat just before the mixture comes to a boil.", "Place chicken tenders in a medium bowl. Cover with the pineapple marinade, and refrigerate for at least 30 minutes.", "Preheat grill for medium heat. Thread chicken lengthwise onto wooden skewers.", "Lightly oil the grill grate. Grill chicken tenders 5 minutes per side, or until juices run clear. They cook quickly, so watch them closely."]},
{"description": "Grab your slow cooker and the ingredients for this wonderful chili and you have a party in the making. Everything goes into the cooker and emerges two hours later as vegetarian chili.", "title": "Grandma's Slow Cooker Vegetarian Chili", "url": "http://allrecipes.com/recipe/14021/grandmas-slow-cooker-vegetarian-chili/", "image": "http://images.media-allrecipes.com/userphotos/560x315/804518.jpg", "ingredients": ["1 (19 ounce) can black bean soup", "1 (15 ounce) can kidney beans, rinsed and drained", "1 (15 ounce) can garbanzo beans, rinsed and drained", "1 (16 ounce) can vegetarian baked beans", "1 (14.5 ounce) can chopped tomatoes in puree", "1 (15 ounce) can whole kernel corn, drained", "1 onion, chopped", "1 green bell pepper, chopped", "2 stalks celery, chopped", "2 cloves garlic, chopped", "1 tablespoon chili powder, or to taste", "1 tablespoon dried parsley", "1 tablespoon dried oregano", "1 tablespoon dried basil"], "directions": ["In a slow cooker, combine black bean soup, kidney beans, garbanzo beans, baked beans, tomatoes, corn, onion, bell pepper and celery. Season with garlic, chili powder, parsley, oregano and basil. Cook for at least two hours on High."]},
{"description": "Balsamic vinegar adds a delicious zip to easy bruschetta.", "title": "Balsamic Bruschetta", "url": "http://allrecipes.com/recipe/54165/balsamic-bruschetta/", "image": "http://images.media-allrecipes.com/userphotos/560x315/866248.jpg", "ingredients": ["8 roma (plum) tomatoes, diced", "1/3 cup chopped fresh basil", "1/4 cup shredded Parmesan cheese", "2 cloves garlic, minced", "1 tablespoon balsamic vinegar", "1 teaspoon olive oil", "1/4 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper", "1 loaf French bread, toasted and sliced"], "directions": ["In a bowl, toss together the tomatoes, basil, Parmesan cheese, and garlic. Mix in the balsamic vinegar, olive oil, kosher salt, and pepper. Serve on toasted bread slices."]},
{"description": "Lightly seasoned potatoes, zucchini, and red bell pepper are baked together in this easy side dish.", "title": "Zucchini and Potato Bake", "url": "http://allrecipes.com/recipe/89195/zucchini-and-potato-bake/", "image": "http://images.media-allrecipes.com/userphotos/560x315/269912.jpg", "ingredients": ["2 medium zucchini, quartered and cut into large pieces", "4 medium potatoes, peeled and cut into large chunks", "1 medium red bell pepper, seeded and chopped", "1 clove garlic, sliced", "1/2 cup dry bread crumbs", "1/4 cup olive oil", "paprika to taste", "salt to taste", "ground black pepper to taste"], "directions": ["Preheat oven to 400 degrees F (200 degrees C).", "In a medium baking pan, toss together the zucchini, potatoes, red bell pepper, garlic, bread crumbs, and olive oil. Season with paprika, salt, and pepper.", "Bake 1 hour in the preheated oven, stirring occasionally, until potatoes are tender and lightly brown."]},
{"description": "Whole wheat flour, oats and wheat germ lend a hearty texture to these delicious muffins. An awesome healthy alternative to the usual blueberry muffin.", "title": "Health Nut Blueberry Muffins", "url": "http://allrecipes.com/recipe/86894/health-nut-blueberry-muffins/", "image": "http://images.media-allrecipes.com/userphotos/250x250/693412.jpg", "ingredients": ["3/4 cup all-purpose flour", "3/4 cup whole wheat flour", "3/4 cup white sugar", "1/4 cup oat bran", "1/4 cup quick cooking oats", "1/4 cup wheat germ", "1 teaspoon baking powder", "1 teaspoon baking soda", "1/4 teaspoon salt", "1 cup blueberries", "1/2 cup chopped walnuts", "1 banana, mashed", "1 cup buttermilk", "1 egg", "1 tablespoon vegetable oil", "1 teaspoon vanilla extract"], "directions": ["Preheat the oven to 350 degrees F (175 degrees C). Grease a 12 cup muffin pan, or line with paper muffin cups.", "In a large bowl, stir together the all-purpose flour, whole wheat flour, sugar, oat bran, quick-cooking oats, wheat germ, baking powder, baking soda and salt. Gently stir in the blueberries and walnuts. In a separate bowl, mix together the mashed banana, buttermilk, egg, oil and vanilla. Pour the wet ingredients into the dry, and mix just until blended. Spoon into muffin cups, filling all the way to the top.", "Bake for 15 to 18 minutes in the preheated oven, or until the tops of the muffins spring back when lightly touched."]},
{"description": "Chicken simmered with tomato sauce, salsa and seasonings -  a great standard burrito filling.", "title": "Salsa Chicken Burrito Filling", "url": "http://allrecipes.com/recipe/22970/salsa-chicken-burrito-filling/", "image": "http://images.media-allrecipes.com/userphotos/250x250/631176.jpg", "ingredients": ["2 skinless, boneless chicken breast halves", "1 (4 ounce) can tomato sauce", "1/4 cup salsa", "1 (1.25 ounce) package taco seasoning mix", "1 teaspoon ground cumin", "2 cloves garlic, minced", "1 teaspoon chili powder", "hot sauce to taste"], "directions": ["Place chicken breasts and tomato sauce in a medium saucepan over medium high heat. Bring to a boil, then add the salsa, seasoning, cumin, garlic and chili powder. Let simmer for 15 minutes.", "With a fork, start pulling the chicken meat apart into thin strings. Keep cooking pulled chicken meat and sauce, covered, for another 5 to 10 minutes. Add hot sauce to taste and stir together (Note: You may need to add a bit of water if the mixture is cooked too high and gets too thick.)"]},
{"description": "Easy and delicious bowtie pasta with chicken, sun-dried tomatoes and pesto sauce. Using homemade pesto will taste even better, but it adds to prep time.", "title": "Pesto Pasta with Chicken", "url": "http://allrecipes.com/recipe/46982/pesto-pasta-with-chicken/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1363711.jpg", "ingredients": ["1 (16 ounce) package bow tie pasta", "1 teaspoon olive oil", "2 cloves garlic, minced", "2 boneless skinless chicken breasts, cut into bite-size pieces", "crushed red pepper flakes to taste", "1/3 cup oil-packed sun-dried tomatoes, drained and cut into strips", "1/2 cup pesto sauce"], "directions": ["Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.", "Heat oil in a large skillet over medium heat. Saute garlic until tender, then stir in chicken. Season with red pepper flakes. Cook until chicken is golden, and cooked through.", "In a large bowl, combine pasta, chicken, sun-dried tomatoes and pesto. Toss to coat evenly."]},
{"description": "This is great as a party appetizer or a full meal. Tasty, full of flavor and good for you. The crunchy crust is what I really like! You can play with the veggie toppings and cheeses for a great meal that is fast and delicious! Our favorite quick meal!", "title": "Spinach and Feta Pita Bake", "url": "http://allrecipes.com/recipe/93666/spinach-and-feta-pita-bake/", "image": "http://images.media-allrecipes.com/userphotos/560x315/46448.jpg", "ingredients": ["1 (6 ounce) tub sun-dried tomato pesto", "6 (6 inch) whole wheat pita breads", "2 roma (plum) tomatoes, chopped", "1 bunch spinach, rinsed and chopped", "4 fresh mushrooms, sliced", "1/2 cup crumbled feta cheese", "2 tablespoons grated Parmesan cheese", "3 tablespoons olive oil", "ground black pepper to taste"], "directions": ["Preheat the oven to 350 degrees F (175 degrees C).", "Spread tomato pesto onto one side of each pita bread and place them pesto-side up on a baking sheet. Top pitas with tomatoes, spinach, mushrooms, feta cheese, and Parmesan cheese; drizzle with olive oil and season with pepper.", "Bake in the preheated oven until pita breads are crisp, about 12 minutes. Cut pitas into quarters."]},
{"description": "A simple red wine sauce with brown sugar, garlic, paprika, salt, and pepper makes this dish simply yummy! Braised chicken breasts, brazenly good taste.", "title": "Chicken and Red Wine Sauce", "url": "http://allrecipes.com/recipe/19125/chicken-and-red-wine-sauce/", "image": "http://images.media-allrecipes.com/userphotos/250x250/565645.jpg", "ingredients": ["1 tablespoon olive oil", "1 tablespoon minced garlic", "3 pounds skinless, boneless chicken breast halves", "1 tablespoon paprika", "1 cup brown sugar", "1 cup red wine", "salt and pepper to taste"], "directions": ["Heat oil in a large skillet over medium high heat. Cook garlic in oil until tender. Place chicken in the skillet, and cook about 10 minutes on each side, until no longer pink and juices run clear.", "Drain oil from skillet. Sprinkle chicken with paprika and 1 cup brown sugar. Pour red wine around chicken. Cover, and simmer about 15 to 20 minutes; lightly baste chicken with wine sauce while cooking. Season to taste with salt and pepper."]},
{"description": "This 100 percent whole wheat loaf from the bread machine is substantial and flavor-packed.", "title": "Whole Wheat Honey Bread", "url": "http://allrecipes.com/recipe/7058/whole-wheat-honey-bread/", "image": "http://images.media-allrecipes.com/userphotos/560x315/19436.jpg", "ingredients": ["1 1/8 cups water", "3 cups whole wheat flour", "1 1/2 teaspoons salt", "1/3 cup honey", "1 tablespoon dry milk powder", "1 1/2 tablespoons shortening", "1 1/2 teaspoons active dry yeast"], "directions": ["Place ingredients in bread machine pan in the order suggested by the manufacturer. Select Whole Wheat setting, and then press Start."]},
{"description": "Quick and easy pizza sauce. No cooking and quick to make.", "title": "Easy Pizza Sauce III", "url": "http://allrecipes.com/recipe/44975/easy-pizza-sauce-iii/", "image": "http://images.media-allrecipes.com/userphotos/560x315/551241.jpg", "ingredients": ["1 (15 ounce) can tomato sauce", "1 (6 ounce) can tomato paste", "1 tablespoon ground oregano", "1 1/2 teaspoons dried minced garlic", "1 teaspoon ground paprika"], "directions": ["In a medium bowl, Mix together tomato sauce and tomato paste until smooth. Stir in oregano, garlic and paprika."]},
{"description": "These muffins are just as delicious and moist as regular muffins!  They'll be gone before they have time to cool. Low-fat, healthy and yummy, imagine that.", "title": "Low-Fat Blueberry Bran Muffins", "url": "http://allrecipes.com/recipe/52635/low-fat-blueberry-bran-muffins/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1911886.jpg", "ingredients": ["1 1/2 cups wheat bran", "1 cup nonfat milk", "1/2 cup unsweetened applesauce", "1 egg", "2/3 cup brown sugar", "1/2 teaspoon vanilla extract", "1/2 cup all-purpose flour", "1/2 cup whole wheat flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 cup blueberries"], "directions": ["Preheat oven to 375 degrees F (190 degrees C). Grease muffin cups or use paper muffin liners. Mix together wheat bran and milk, and let stand for 10 minutes.", "In a large bowl, mix together applesauce, egg, brown sugar, and vanilla. Beat in bran mixture. Sift together all-purpose flour, whole wheat flour, baking soda, baking powder, and salt. Stir into bran mixture until just blended. Fold in blueberries. Scoop into muffin cups.", "Bake in preheated oven for 15 to 20 minutes, or until tops spring back when lightly tapped."]},
{"description": "Marinated tilapia fillets are grilled instead of fried in this tangy, flavorful twist on fish tacos.", "title": "Grilled Fish Tacos with Chipotle-Lime Dressing", "url": "http://allrecipes.com/recipe/142614/grilled-fish-tacos-with-chipotle-lime-dressing/", "image": "http://images.media-allrecipes.com/userphotos/560x315/374569.jpg", "ingredients": ["Marinade", "1/4 cup extra virgin olive oil", "2 tablespoons distilled white vinegar", "2 tablespoons fresh lime juice", "2 teaspoons lime zest", "1 1/2 teaspoons honey", "2 cloves garlic, minced", "1/2 teaspoon cumin", "1/2 teaspoon chili powder", "1 teaspoon seafood seasoning, such as Old Bay™", "1/2 teaspoon ground black pepper", "1 teaspoon hot pepper sauce, or to taste", "1 pound tilapia fillets, cut into chunks", "Dressing", "1 (8 ounce) container light sour cream", "1/2 cup adobo sauce from chipotle peppers", "2 tablespoons fresh lime juice", "2 teaspoons lime zest", "1/4 teaspoon cumin", "1/4 teaspoon chili powder", "1/2 teaspoon seafood seasoning, such as Old Bay™", "salt and pepper to taste", "Toppings", "1 (10 ounce) package tortillas", "3 ripe tomatoes, seeded and diced", "1 bunch cilantro, chopped", "1 small head cabbage, cored and shredded", "2 limes, cut in wedges"], "directions": ["To make the marinade, whisk together the olive oil, vinegar, lime juice, lime zest, honey, garlic, cumin, chili powder, seafood seasoning, black pepper, and hot sauce in a bowl until blended. Place the tilapia in a shallow dish, and pour the marinade over the fish. Cover, and refrigerate 6 to 8 hours.", "To make the dressing, combine the sour cream and adobo sauce in a bowl. Stir in the lime juice, lime zest, cumin, chili powder, seafood seasoning. Add salt, and pepper in desired amounts. Cover, and refrigerate until needed.", "Preheat an outdoor grill for high heat and lightly oil grate. Set grate 4 inches from the heat.", "Remove fish from marinade, drain off any excess and discard marinade. Grill fish pieces until easily flaked with a fork, turning once, about 9 minutes.", "Assemble tacos by placing fish pieces in the center of tortillas with desired amounts of tomatoes, cilantro, and cabbage; drizzle with dressing. To serve, roll up tortillas around fillings, and garnish with lime wedges."]},
{"description": "This is a quick light meal. Wilted spinach, bacon and tomatoes are tossed with penne pasta. Good for any season and will complement anything.", "title": "Penne Pasta with Spinach and Bacon", "url": "http://allrecipes.com/recipe/73757/penne-pasta-with-spinach-and-bacon/", "image": "http://images.media-allrecipes.com/userphotos/560x315/638486.jpg", "ingredients": ["1 (12 ounce) package penne pasta", "2 tablespoons olive oil, divided", "6 slices bacon, chopped", "2 tablespoons minced garlic", "1 (14.5 ounce) can diced tomatoes", "1 bunch fresh spinach, rinsed and torn into bite-size pieces"], "directions": ["Bring a large pot of lightly salted water to a boil. Add the penne pasta, and cook until tender, 8 to 10 minutes.", "Meanwhile, heat 1 tablespoon of olive oil in a skillet over medium heat. Place bacon in the skillet, and cook until browned and crisp. Add garlic, and cook for about 1 minute.  Stir in the tomatoes, and cook until heated through.", "Place the spinach into a colander, and drain the hot pasta over it so it is wilted. Transfer to a large serving bowl, and toss with the remaining olive oil, and the bacon and tomato mixture."]},
{"description": "You can make this salsa as fiery as you like by adding more or less peppers. But whatever you do, don't leave them out. And because everything goes into the food processor, you can make the salsa chunky or smooth with just a flick of the switch.", "title": "D's Famous Salsa", "url": "http://allrecipes.com/recipe/16259/ds-famous-salsa/", "image": "http://images.media-allrecipes.com/userphotos/560x315/866636.jpg", "ingredients": ["2 (14.5 ounce) cans stewed tomatoes", "1/2 onion, finely diced", "1 teaspoon minced garlic", "1/2 lime, juiced", "1 teaspoon salt", "1/4 cup canned sliced green chiles, or to taste", "3 tablespoons chopped fresh cilantro"], "directions": ["Place the tomatoes, onion, garlic, lime juice, salt, green chiles, and cilantro in a blender or food processor. Blend on low to desired consistency."]},
{"description": "Good old fashioned restaurant-style hash browns. Perfect with hot pepper sauce and ketchup!", "title": "Emily's Famous Hash Browns", "url": "http://allrecipes.com/recipe/57783/emilys-famous-hash-browns/", "image": "http://images.media-allrecipes.com/userphotos/560x315/801447.jpg", "ingredients": ["2 medium russet potatoes, shredded", "1/2 medium onion, finely chopped", "1/4 cup all-purpose flour", "1 egg", "1 cup oil for frying, or as needed", "salt and pepper to taste"], "directions": ["Rinse shredded potatoes until water is clear, then drain and squeeze dry. Place shreds in a bowl, and mix in the onion, flour and egg until evenly distributed.", "Heat about 1/4 inch of oil in a large heavy skillet over medium-high heat. When oil is sizzling hot, place potatoes into the pan in a 1/2 inch thick layer. Cover the whole bottom of the pan, or make separate piles like pancakes. Cook until nicely browned on the bottom, then flip over and brown on the other side. It should take at least 5 minutes per side.  If you are cooking them in one big piece, it can be cut into quarters for easier flipping.", "Remove from pan, and drain on paper towels. Season with salt and pepper and serve immediately."]},
{"description": "White beans, cannellini or navy, and chicken broth form the base of this soup made with fresh kale and tomatoes.", "title": "Bean Soup With Kale", "url": "http://allrecipes.com/recipe/78023/bean-soup-with-kale/", "image": "http://images.media-allrecipes.com/userphotos/250x250/328678.jpg", "ingredients": ["1 tablespoon olive oil or canola oil", "8 large garlic cloves, crushed or minced", "1 medium yellow onion, chopped", "4 cups chopped raw kale", "4 cups low-fat, low-sodium chicken or vegetable broth", "2 (15 ounce) cans white beans, such as cannellini or navy, undrained", "4 plum tomatoes, chopped", "2 teaspoons dried Italian herb seasoning", "Salt and pepper to taste", "1 cup chopped parsley"], "directions": ["In a large pot, heat olive oil. Add garlic and onion; saute until soft. Add kale and saute, stirring, until wilted. Add 3 cups of broth, 2 cups of beans, and all of the tomato, herbs, salt and pepper. Simmer 5 minutes. In a blender or food processor, mix the remaining beans and broth until smooth. Stir into soup to thicken. Simmer 15 minutes. Ladle into bowls; sprinkle with chopped parsley."]},
{"description": "This is a hearty split pea soup has a flavorful ham bone cooked with carrots, potatoes, onions, and a pinch of marjoram.", "title": "Split Pea Soup", "url": "http://allrecipes.com/recipe/13384/split-pea-soup/", "image": "http://images.media-allrecipes.com/userphotos/560x315/46633.jpg", "ingredients": ["2 1/4 cups dried split peas", "2 quarts cold water", "1 1/2 pounds ham bone", "2 onions, thinly sliced", "1/2 teaspoon salt", "1/4 teaspoon ground black pepper", "1 pinch dried marjoram", "3 stalks celery, chopped", "3 carrots, chopped", "1 potato, diced"], "directions": ["In a large stock pot, cover peas with 2 quarts cold water and soak overnight.  If you need a faster method, simmer the peas gently for 2 minutes, and then soak for l hour.", "Once peas are soaked, add ham bone, onion, salt, pepper and marjoram.  Cover, bring to boil and then simmer for 1 1/2 hours, stirring occasionally.", "Remove bone; cut off meat, dice and return meat to soup.  Add celery, carrots and potatoes.  Cook slowly, uncovered for 30 to 40 minutes, or until vegetables are tender."]},
{"description": "White rice, garlic and onion is cooked in a nice vegetable stock for about 20 minutes. Black beans, cayenne and cumin are added to the pot, given a stir ...and that's it. Black Beans and Rice for six.", "title": "Black Beans and Rice", "url": "http://allrecipes.com/recipe/15559/black-beans-and-rice/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2119665.jpg", "ingredients": ["1 teaspoon olive oil", "1 onion, chopped", "2 cloves garlic, minced", "3/4 cup uncooked white rice", "1 1/2 cups low sodium, low fat vegetable broth", "1 teaspoon ground cumin", "1/4 teaspoon cayenne pepper", "3 1/2 cups canned black beans, drained"], "directions": ["In a stockpot over medium-high heat, heat the oil. Add the onion and garlic and saute for 4 minutes. Add the rice and saute for 2 minutes.", "Add the vegetable broth, bring to a boil, cover and lower the heat and cook for 20 minutes. Add the spices and black beans."]},
{"description": "Canned white beans and cooked chicken meat are mixed in chicken stock with tomatillos, green chilies, chopped tomatoes, and fresh corn kernels in this lightly seasoned chili.", "title": "White Bean Chicken Chili", "url": "http://allrecipes.com/recipe/13010/white-bean-chicken-chili/", "image": "http://images.media-allrecipes.com/userphotos/560x315/2568455.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 onion, chopped", "2 cloves garlic, minced", "1 (14.5 ounce) can chicken broth", "1 (18.75 ounce) can tomatillos, drained and chopped", "1 (16 ounce) can diced tomatoes", "1 (7 ounce) can diced green chiles", "1/2 teaspoon dried oregano", "1/2 teaspoon ground coriander seed", "1/4 teaspoon ground cumin", "2 ears fresh corn", "1 pound diced, cooked chicken meat", "1 (15 ounce) can white beans", "1 pinch salt and black pepper to taste"], "directions": ["Heat oil, and cook onion and garlic until soft.", "Stir in broth, tomatillos, tomatoes, chilies, and spices.  Bring to a boil, then simmer for 10 minutes.", "Add corn, chicken, and beans; simmer 5 minutes.  Season with salt and pepper to taste."]},
{"description": "This is a fast and filling vegan smoothie with a deep pink color and a rich, creamy texture.", "title": "Strawberry Oatmeal Breakfast Smoothie", "url": "http://allrecipes.com/recipe/23539/strawberry-oatmeal-breakfast-smoothie/", "image": "http://images.media-allrecipes.com/userphotos/560x315/409456.jpg", "ingredients": ["1 cup soy milk", "1/2 cup rolled oats", "1 banana, broken into chunks", "14 frozen strawberries", "1/2 teaspoon vanilla extract", "1 1/2 teaspoons white sugar"], "directions": ["In a blender, combine soy milk, oats, banana and strawberries. Add vanilla and sugar if desired. Blend until smooth. Pour into glasses and serve."]},
{"description": "This is an easy chili recipe that you can throw in the slow cooker and forget about all day. Great topped with Cheddar cheese, crushed corn chips, and a dollop of sour cream.", "title": "Laura's Quick Slow Cooker Turkey Chili", "url": "http://allrecipes.com/recipe/82768/lauras-quick-slow-cooker-turkey-chili/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1009122.jpg", "ingredients": ["1 tablespoon vegetable oil", "1 pound ground turkey", "2 (10.75 ounce) cans low sodium tomato soup", "2 (15 ounce) cans kidney beans, drained", "1 (15 ounce) can black beans, drained", "1/2 medium onion, chopped", "2 tablespoons chili powder", "1 teaspoon red pepper flakes", "1/2 tablespoon garlic powder", "1/2 tablespoon ground cumin", "1 pinch ground black pepper", "1 pinch ground allspice", "salt to taste"], "directions": ["Heat the oil in a skillet over medium heat. Place turkey in the skillet, and cook until evenly brown; drain.", "Coat the inside of a slow cooker with cooking spray, and mix in turkey, tomato soup, kidney beans, black beans and onion. Season with chili powder, red pepper flakes, garlic powder, cumin, black pepper, allspice and salt.", "Cover, and cook 8 hours on Low or 4 hours on High."]},
{"description": "Cubed chicken breast is simmered in a peppery tomato-basil sauce and tossed with fine strands of angel hair pasta.", "title": "Basil Chicken over Angel Hair", "url": "http://allrecipes.com/recipe/8842/basil-chicken-over-angel-hair/", "image": "http://images.media-allrecipes.com/userphotos/250x250/39411.jpg", "ingredients": ["1 (8 ounce) package angel hair pasta", "2 teaspoons olive oil", "1/2 cup finely chopped onion", "1 clove garlic, chopped", "2 1/2 cups chopped tomatoes", "2 cups boneless chicken breast halves, cooked and cubed", "1/4 cup chopped fresh basil", "1/2 teaspoon salt", "1/8 teaspoon hot pepper sauce", "1/4 cup Parmesan cheese"], "directions": ["In a large pot of salted boiling water, cook angel hair pasta until it is al dente, about 8 to 10 minutes. Drain, and set aside.", "In a large skillet, heat oil over medium-high heat. Saute the onions and garlic. Stir in the tomatoes, chicken, basil, salt and hot pepper sauce. Reduce heat to medium, and cover skillet. Simmer for about 5 minutes, stirring frequently, until mixture is hot and tomatoes are soft.", "Toss sauce with hot cooked angel hair pasta to coat. Serve with Parmesan cheese."]},
{"description": "Broccoli florets are roasted after being tossed in olive oil and sprinkled with sea salt, freshly ground black pepper, and minced garlic. A squeeze of lemon juice before serving seals the deal.", "title": "Roasted Garlic Lemon Broccoli", "url": "http://allrecipes.com/recipe/144346/roasted-garlic-lemon-broccoli/", "image": "http://images.media-allrecipes.com/userphotos/560x315/549154.jpg", "ingredients": ["2 heads broccoli, separated into florets", "2 teaspoons extra-virgin olive oil", "1 teaspoon sea salt", "1/2 teaspoon ground black pepper", "1 clove garlic, minced", "1/2 teaspoon lemon juice"], "directions": ["Preheat the oven to 400 degrees F (200 degrees C).", "In a large bowl, toss broccoli florets with the extra virgin olive oil, sea salt, pepper and garlic. Spread the broccoli out in an even layer on a baking sheet.", "Bake in the preheated oven until florets are tender enough to pierce the stems with a fork, 15 to 20 minutes. Remove and transfer to a serving platter. Squeeze lemon juice liberally over the broccoli before serving for a refreshing, tangy finish."]},
{"description": "Just 35 minutes and six simple ingredients are all you need for this top-rated, flavorful tilapia recipe.", "title": "Easy Baked Tilapia", "url": "http://allrecipes.com/recipe/70163/easy-baked-tilapia/", "image": "http://images.media-allrecipes.com/userphotos/560x315/1101614.jpg", "ingredients": ["4 (4 ounce) fillets tilapia", "2 teaspoons butter", "1/4 teaspoon Old Bay Seasoning TM, or to taste", "1/2 teaspoon garlic salt, or to taste", "1 lemon, sliced", "1 (16 ounce) package frozen cauliflower with broccoli and red pepper"], "directions": ["Preheat the oven to 375 degrees F (190 degrees F). Grease a 9x13 inch baking dish.", "Place the tilapia fillets in the bottom of the baking dish and dot with butter. Season with Old Bay seasoning and garlic salt. Top each one with a slice or two of lemon. Arrange the frozen mixed vegetables around the fish, and season lightly with salt and pepper.", "Cover the dish and bake for 25 to 30 minutes in the preheated oven, until vegetables are tender and fish flakes easily with a fork."]},
{"description": "This savory, homemade chicken noodle soup made with chicken broth, egg noodles, vegetables, and chicken  is a real people pleaser.", "title": "Grandma's Chicken Noodle Soup", "url": "http://allrecipes.com/recipe/13206/grandmas-chicken-noodle-soup/", "image": "http://images.media-allrecipes.com/userphotos/250x250/894017.jpg", "ingredients": ["2 1/2 cups wide egg noodles", "1 teaspoon vegetable oil", "12 cups chicken broth", "1 1/2 tablespoons salt", "1 teaspoon poultry seasoning", "1 cup chopped celery", "1 cup chopped onion", "1/3 cup cornstarch", "1/4 cup water", "3 cups diced, cooked chicken meat"], "directions": ["Bring a large pot of lightly salted water to a boil. Add egg noodles and oil, and boil for 8 minutes, or until tender. Drain, and rinse under cool running water.", "In a large saucepan or Dutch oven, combine broth, salt, and poultry seasoning. Bring to a boil. Stir in celery and onion. Reduce heat, cover, and simmer 15 minutes.", "In a small bowl, mix cornstarch and water together until cornstarch is completely dissolved. Gradually add to soup, stirring constantly. Stir in noodles and chicken, and heat through."]},
{"description": "A light but super-tasty pasta dish, with fresh asparagus cooked in broth with sauteed garlic and seasoned chicken.", "title": "Penne with Chicken and Asparagus", "url": "http://allrecipes.com/recipe/90089/penne-with-chicken-and-asparagus/", "image": "http://images.media-allrecipes.com/userphotos/560x315/226134.jpg", "ingredients": ["1 (16 ounce) package dried penne pasta", "5 tablespoons olive oil, divided", "2 skinless, boneless chicken breast halves - cut into cubes", "salt and pepper to taste", "garlic powder to taste", "1/2 cup low-sodium chicken broth", "1 bunch slender asparagus spears, trimmed, cut on diagonal into 1-inch pieces", "1 clove garlic, thinly sliced", "1/4 cup Parmesan cheese"], "directions": ["Bring a large pot of lightly salted water to boil. Add pasta, and cook until al dente, about 8 to 10 minutes. Drain, and set aside.", "Warm 3 tablespoons olive oil in a large skillet over medium-high heat. Stir in chicken, and season with salt, pepper, and garlic powder. Cook until chicken is cooked through and browned, about 5 minutes. Remove chicken to paper towels.", "Pour chicken broth into the skillet. Then stir in asparagus, garlic, and a pinch more garlic powder, salt, and pepper. Cover, and steam until the asparagus is just tender, about 5 to 10 minutes. Return chicken to the skillet, and warm through.", "Stir chicken mixture into pasta, and mix well. Let sit about 5 minutes. Drizzle with 2 tablespoons olive oil, stir again, then sprinkle with Parmesan cheese."]},
{"description": "For a fabulously flavorful dish that takes just minutes to make, simply saute garlic, onion and tender strips of chicken. Add artichoke hearts, tomato, feta cheese, parsley, lemon juice and oregano, and toss with hot pasta.", "title": "Greek Chicken Pasta", "url": "http://allrecipes.com/recipe/12072/greek-chicken-pasta/", "image": "http://images.media-allrecipes.com/userphotos/560x315/220541.jpg", "ingredients": ["1 (16 ounce) package linguine pasta", "1/2 cup chopped red onion", "1 tablespoon olive oil", "2 cloves garlic, crushed", "1 pound skinless, boneless chicken breast meat - cut into bite-size pieces", "1 (14 ounce) can marinated artichoke hearts, drained and chopped", "1 large tomato, chopped", "1/2 cup crumbled feta cheese", "3 tablespoons chopped fresh parsley", "2 tablespoons lemon juice", "2 teaspoons dried oregano", "salt and pepper to taste", "2 lemons, wedged, for garnish"], "directions": ["Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water until tender yet firm to the bit, 8 to 10 minutes; drain.", "Heat olive oil in a large skillet over medium-high heat. Add onion and garlic; saute until fragrant, about 2 minutes. Stir in the chicken and cook, stirring occasionally, until chicken is no longer pink in the center and the juices run clear, about 5 to 6 minutes.", "Reduce heat to medium-low; add artichoke hearts, tomato, feta cheese, parsley, lemon juice, oregano, and cooked pasta. Cook and stir until heated through, about 2 to 3 minutes. Remove from heat, season with salt and pepper, and garnish with lemon wedges."]}]