[{"description": "Poke is the latest food craze you gotta try. Discover our easy way to make a salmon poke bowl with our simple recipe on chowhound.com.", "title": "Easy Salmon Poke Bowl", "url": "http://www.chowhound.com/recipes/salmon-poke-bowl-31837", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/models/promotions/photos/28903/original/salmon-poke.jpg", "ingredients": ["1 pound salmon, diced into 1/2-inch cubes", "1/4 cup soy sauce", "1 tablespoon sesame oil", "1 tablespoon rice wine vinegar", "1 teaspoon ginger, grated", "1/2 teaspoon garlic, minced", "3 green onions, white parts thinly sliced", "brown rice, see instructions", "1 cucumber", "4 radishes ", "1 avocado", "2 carrots ", "black sesame seeds"], "directions": [ "Make a batch of steamed brown rice. Use our ",  "Next, in a medium sized bowl, combine soy sauce, sesame oil, rice wine vinegar, ginger, garlic, and green onions. Stir well to combine. Add salmon and marinate for about 30 minutes in the refrigerator.", "With a vegetable peeler, peel thin, long ribbons of cucumber. Then thinly slice, or mandolin, the radishes. Quarter the avocado, and cut into thin slices. Lastly, peel carrots and then cut into 1-inch long, thin matchsticks.", "Serve the salmon on top of brown rice and top with sesame seeds. Then place the cucumber, radish, avocado, and carrots in the bowl with the salmon poke. "]},
{"description": "A healthy açaí smoothie bowl recipe.", "title": "Açaí Bowl ", "url": "http://www.chowhound.com/recipes/acai-bowl-31759", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/models/promotions/photos/28308/original/31759_acai_bowl_inline_3000_2.jpg", "ingredients": ["1 medium unpeeled banana, frozen", "6 ounces frozen unsweetened sliced peaches", "2 (3.5-ounce) packs frozen unsweetened açaí berry purée, slightly defrosted", "1/2 Fuji apple, unpeeled, in large dice", "2 teaspoons honey", "2 teaspoons almond butter", "1/2 cup unsweetened coconut milk", "Fresh blueberries", "Sliced kiwi", "Flax seeds", "Black sesame seeds", "Granola", "Ripe banana slices", "Pomegranate seeds"], "directions": [ "Put all the smoothie bowl ingredients in a blender and blend until smooth—you’ll end up with a thick, smoothie-like texture.", "Pour into a serving bowl and add your toppings of choice."]},
{"description": "A healthy grain-free cauliflower fried rice recipe.", "title": "Grain-Free Cauliflower Fried Rice", "url": "http://www.chowhound.com/recipes/grain-free-cauliflower-fried-rice-31780", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/models/promotions/photos/28492/original/headr_cauliflower-friedrice_0463_3000x2000_150ppi.jpg", "ingredients": ["1 head of cauliflower", "3 slices of bacon", "2 egg whites and 1 egg", "1 small onion, finely diced", "1 carrot, finely diced", "1 red pepper, finely diced", "1 cup broccoli florets, finely chopped", "1 tablespoon coconut aminos (paleo substitute for soy sauce)", "1/4 teaspoon fish sauce", "1 tablespoon ghee (or other oil of choice)", "Salt and pepper to taste"], "directions": [ "Chop cauliflower into florets and pulverize in a food processor until it resembles “rice”. ", "Heat a large skillet on medium heat. Add ghee and cauliflower; cook for 5 minutes.", "Add remaining vegetables, and cook until soft, another 7-10 minutes.", "While cauliflower is cooking, heat a separate skillet on medium heat, and add bacon and eggs. When they are done, set aside and dice.", "When cauliflower and vegetables are done cooking, add coconut aminos and fish sauce. ", "Taste and adjust seasonings accordingly.", "Add bacon and eggs. Stir until combined. Then, dig in! "]},
{"description": "For a creamy, naturally sweet, healthy, easy frozen dessert that can satisfy your ice cream cravings, we recommend this two-ingredient ice \"cream.\" There isn...", "title": "Two-Ingredient Banana Ice Cream", "url": "http://www.chowhound.com/recipes/easy-banana-ice-cream-31784", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/models/promotions/photos/28482/original/headr_bananaicecream_0684_3000x2000.jpg", "ingredients": ["4 Bananas", "Caramel Sauce (optional)", "Fleur de sel (optional)"], "directions": [ "Peel and slice bananas.", "In a freezer-safe bowl, place sliced bananas in freezer for at least 2-3 hours to freeze through.", "Once frozen solid, add the bananas to a food processor and blend on high until smooth. ", "You will need to scrape the processor bowl a few times in between. ", "Each banana gives you about one scoop. Enjoy with caramel sauce (caramel topped with fleur de sel), if you wish. "]},
{"description": "A light, healthy cilantro-ginger halibut recipe.", "title": "Cilantro-Ginger Halibut", "url": "http://www.chowhound.com/recipes/cilantro-ginger-halibut-31509", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/07/31509_cilantro_halibut.jpg", "ingredients": ["1 clove garlic, peeled", "1/2 small jalapeño pepper", "1 (1/2-inch) piece fresh ginger, peeled and roughly chopped", "3 tablespoons freshly squeezed lime juice (about 2 limes)", "1 cup loosely packed cilantro leaves", "6 tablespoons olive oil", "Salt", "Freshly ground black pepper", "4 halibut fillets (about 1 1/2 pounds), skin removed"], "directions": [ "Combine garlic, jalapeño pepper, ginger, lime juice, and cilantro in the jar of a blender. Cover blender, and remove the stopper. Turn on the blender, and slowly drizzle in the olive oil. Process until the mixture is bright green and smooth. Season to taste with salt and black pepper.", "Season both sides of the fillets with salt and black pepper. Brush the top of each fillet with 1 tablespoon cilantro sauce.", "Fill a large, high-sided skillet with 1 inch of water. Bring to the boil over high heat.", "Place a steamer basket in the skillet, and arrange the fillets in basket. Cover, and steam until the fish is just cooked through but still moist, about 5 to 6 minutes.", "Remove the fish from steamer, drizzle with additional cilantro sauce, and serve."]},
{"description": "A healthy cauliflower rice recipe.", "title": "Cauliflower Rice", "url": "http://www.chowhound.com/recipes/cauliflower-rice-31507", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/07/31507_cauliflower_rice.jpg", "ingredients": ["1 large head cauliflower, cut into florets", "3 tablespoons ghee or clarified butter", "1/2 onion, finely chopped", "1 carrot, peeled and finely chopped", "2 cloves garlic, minced", "1/2 cup chicken broth", "1 tablespoon minced cilantro", "1/2 teaspoon salt", "1/2 teaspoon black pepper"], "directions": [ "To “rice” the cauliflower, place half of the florets in a food processor and pulse into a rice-like consistency, 15 to 20 pulses. (Don’t over-crowd the cauliflower in the food processor, and don’t over-pulse or the florets will get mushy.) Repeat to rice the remaining florets.", "In a large skillet, melt the ghee over medium heat and swirl to coat the bottom of the pan. When the ghee is hot, add the onion and carrot and cook, stirring, until the onion is translucent, 2 to 3 minutes. Stir in the garlic and cook until the garlic is aromatic, about 1 minute.", "Add the riced cauliflower to the skillet and mix thoroughly with the rest of the vegetables. Add the chicken broth, cover the pan with a lid, and steam until you’ve arrived at a rice-like consistency, 10 to 12 minutes. (The cauliflower should be tender, but not mushy or wet.)", "Remove the pan from the heat and mix in the chopped cilantro. Adjust the seasoning with salt and pepper."]},
{"description": "A healthy romesco garlic shrimp with zucchini noodles recipe.", "title": "Romesco Garlic Shrimp with Zucchini Noodles", "url": "http://www.chowhound.com/recipes/romesco-garlic-shrimp-zucchini-noodles-31506", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/07/31506_romesco_shrimp.jpg", "ingredients": ["2 tablespoons cooking fat ", "1/2 cup almonds, chopped ", "1 small onion, diced ", "3 cloves garlic, minced ", "1 teaspoon chili powder ", "1 teaspoon paprika ", "2 tomatoes, seeded and chopped ", "2 tablespoons extra-virgin olive oil ", "1 1/2 teaspoons red wine vinegar ", "1 teaspoon salt ", "1/2 teaspoon pepper", "4 medium zucchini (about 4 cups of “noodles”) ", "2 tablespoons cooking fat ", "1/4 onion, finely chopped ", "2 cloves garlic, minced ", "1 pound large shrimp, peeled and deveined ", "1 teaspoon salt ", "1/2 teaspoon pepper ", "2 teaspoons chopped fresh parsley leaves ", "Romesco Sauce"], "directions": [ "Melt the cooking fat in a large skillet over medium-high heat. When the fat is hot, add the almonds and toast for 3 minutes, stirring often. Add the onion and cook, stirring, for 2 minutes. Add the garlic and cook until aromatic, about 1 minute. Add the chili powder and paprika and cook until the flavors open up, about 30 seconds. Finally, add the tomatoes, mix into the ingredients, and cook, stirring to bring up the tasty bits from the bottom of the pan, until the tomatoes are warmed through, about 2 minutes.", "Transfer the sauce mixture to a food processor. Add the rest of the ingredients and blend on low speed until the sauce is smooth, then pour into a serving dish or glass storage container.", "Allow to cool before refrigerating; the sauce will keep for up to 5 days. Pro Tip: Seeding Tomatoes Seeding a tomato can be messy if you try to dice it before removing the seeds. Try this method: place the tomato on a cutting board, stem facing up. Slice left-to-right across the middle of the tomato, creating two equal halves. Then, scrape out the seeds and white core with a small spoon. You’ll be left with nothing but firm tomato flesh, far easier to slice and dice.", "Peel the zucchini with a regular peeler. Then, using a julienne peeler, make long slices along one side of each zucchini until you get down to the seeded core. Rotate the zucchini and continue to peel until you’ve done all four sides. (If you have a spiral slicer, you can use that instead of a julienne peeler.) Discard the core, and set the noodles aside.", "Add 2 cups of water to a large pot over medium-high heat and bring to a boil while you begin cooking the shrimp.", "Melt the cooking fat in a large skillet over medium heat, swirling to coat the bottom of the pan. When the fat is hot, add the onion and cook, stirring, until translucent, about 2 minutes. Stir in the garlic and cook for until aromatic, about 1 minute. Add the shrimp, toss to coat with the onion and garlic, and cook stirring, an additional 2 minutes. Add 1/4 cup water to the skillet and cover with a lid. Cook until the shrimp form the shape of a “C,” 4 to 6 minutes. Transfer to a serving bowl (draining any remaining water), and season everything with the salt and pepper.", "After you add the water and cover, place a colander or steamer inside the large pot of boiling water. Add the zucchini noodles, cover, and steam until the zucchini is al dente in texture, 2 to 3 minutes. Drain the “zoodles” and transfer to a serving dish or individual plates.", "Sprinkle the shrimp with the parsley, toss, and spoon over the zoodles. Spoon the Romesco Sauce over the shrimp and zucchini and serve."]},
{"description": "A healthy chicken cacciatore recipe.", "title": "Chicken Cacciatore", "url": "http://www.chowhound.com/recipes/chicken-cacciatore-31508", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/07/31508_chicken_cacciatore.jpg", "ingredients": ["4 tablespoons cooking fat (melted ghee, clarified butter or coconut oil; or extra-virgin olive oil)", "1 pound bone-in, skin-on chicken legs", "1/2 pound boneless, skin-on chicken thighs", "1/2 teaspoon salt", "1/2 teaspoon pepper", "1/2 onion, finely chopped", "1/2 red bell pepper, seeded, ribs removed, and finely diced", "1 cup sliced button, cremini, or portabella mushrooms", "2 cloves garlic, minced", "1 (14.5-ounce) can diced tomatoes", "1 tablespoon capers, drained", "1 cup chicken broth, plus more if needed", "1 tablespoon roughly chopped fresh basil leaves"], "directions": [ "In a large deep skillet or Dutch oven, heat 2 tablespoons of the cooking fat over medium-high heat, swirling to coat the bottom of the pan. Season the chicken with the salt and pepper and place in the pan. Sear the chicken until the outside is browned and lifts easily from the bottom of the pot, about 3 minutes on each side. Remove the chicken from the pan and set aside.", "To the same pan over medium-high heat, add the remaining 2 tablespoons cooking fat, the onions, and bell peppers and cook, stirring, until the onion becomes translucent, 2 to 3 minutes. Add the mushrooms and continue to cook, stirring, for 2 minutes. Add the garlic and stir until aromatic, about 1 minute. Add the diced tomatoes and capers.", "Return the chicken to the pan and add the chicken broth. (If needed, add more broth so the chicken is fully covered.) Reduce the heat to medium and bring everything to a simmer. Turn the heat down to low, cover, and continue to simmer (not boil) until the chicken reaches an internal temperature of 160°F, about 30 minutes. Garnish with the chopped basil and serve."]},
{"description": "A quick watercress-walnut pesto recipe. You will need watercress, lemon juice, balsamic, Parmesan, extra-virgin olive oil, garlic, and walnuts.", "title": "Watercress-Walnut Pesto", "url": "http://www.chowhound.com/recipes/watercress-walnut-pesto-31257", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/01/31257_RecipeImage_watercress_walnut_pesto_inline_3.jpg", "ingredients": ["1 bunch (about 2 1/2 ounces, including the stems) watercress", "5 tablespoons freshly squeezed lemon juice", "2 tablespoons balsamic vinegar", "1/2 cup grated Parmesan cheese", "1/2 cup walnut pieces", "1/2 cup extra-virgin olive oil", "4 garlic cloves, peeled but whole", "1 teaspoon kosher salt"], "directions": [ "Combine everything in the bowl of a food processor and process for 30 seconds. ", "Use a spatula to scrape down the sides of the bowl, then process for 30 seconds more. Transfer to a serving bowl, or store in an airtight container for up to 3 days in the fridge."]},
{"description": "An easy chicken breast recipe with crispy skin and a quick pan sauce of garlic, white wine, and butter.", "title": "Crispy-Skin Chicken Breasts", "url": "http://www.chowhound.com/recipes/chicken-breasts-crispy-skin-31287", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/02/31287_RecipeImage_chicken_breast_under_brick.jpg", "ingredients": ["4 boneless, skin-on chicken breasts, about 8 ounces each", "Kosher salt", "Freshly ground black pepper", "1/4 cup olive oil", "6 medium garlic cloves, 3 peeled and smashed, 3 minced", "1/2 teaspoon dried oregano", "1/2 teaspoon dried thyme", "1/4 teaspoon dried rosemary, crushed", "2 tablespoons canola oil", "1 cup dry white wine", "3 to 4 tablespoons (1/3 to 1/2 stick) unsalted butter, chilled "], "directions": [ "Season the chicken all over with salt and pepper. In a large zippered plastic bag, combine the olive oil, whole smashed garlic, oregano, thyme, and rosemary. Add the chicken and rub the marinade all over to coat each breast. Seal the bag and refrigerate for at least 2 hours or as long as overnight.", "Remove the chicken breasts from the bag, letting the excess marinade drip off. Transfer the chicken to a plate and set aside. Place a large cast-iron or other heavy frying pan over medium-high heat. Have ready a second cast-iron or heavy frying pan that fits just inside the first one, as if they’re nesting.", "When the first pan is very hot, add the canola oil. When the oil is hot (it should shimmer but not smoke), put the chicken breasts in the pan skin-side down. ", " Cover with a piece of aluminum foil that just covers the breasts. ", " Place the second frying pan on top of the foil covering the chicken breasts. ", "Reduce the heat to medium and cook, without moving the chicken, until the skin is crispy and a deep golden brown, about 5 minutes. Remove the pan and foil, turn the chicken halves over, and continue to cook until a thermometer in the thickest part of the breast registers 160°F, about 5 minutes longer. ", " Transfer the chicken to a warm platter and let rest for 10 minutes while you make the sauce.", "Return the frying pan to the stovetop over medium-high heat. Add the wine and minced garlic and bring to a boil, scraping the bottom of the pan to loosen any browned bits. Cook for about 4 minutes. ", " Add the butter in pieces, whisking it into the sauce until the sauce is smooth and silky. ", " Transfer the chicken to warmed serving plates and spoon over the sauce."]},
{"description": "An easy Thai grilled chicken breast recipe. You will need cilantro, garlic, brown sugar, white pepper, Asian fish sauce, and soy sauce for marinating.", "title": "Easy Thai Grilled Chicken Breasts", "url": "http://www.chowhound.com/recipes/easy-thai-grilled-chicken-breasts-31288", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/02/31288_RecipeImage_thai_grilled_chicken_breasts.jpg", "ingredients": ["4 boneless, skin-on chicken breasts, about 8 ounces each", "1/2 bunch cilantro", "4 medium garlic cloves ", "2 tablespoons dark brown sugar", "1/2 teaspoon ground white pepper", "2 tablespoons Asian fish sauce", "1 tablespoon soy sauce or tamari", "Oil, for the grill pan", "Thai sweet chili sauce, for serving"], "directions": [ "Trim the chicken breasts of fat and membrane, if necessary, and flatten the thicker parts slightly using the flat side of a mallet.", "In a blender, purée the cilantro, garlic, brown sugar, white pepper, fish sauce, and soy sauce until smooth. ", " Pour the marinade all over the chicken breasts, and rub over and under the skin. Put the chicken on a plate, cover with plastic wrap, and leave at room temperature for 30 minutes. (You can also refrigerate the breasts for up to 2 hours, letting them sit out on the counter for 1 hour before cooking.) ", "Place a stovetop grill pan over medium heat and let it get hot, then brush the pan with oil. Place the marinated chicken breasts on the grill pan skin-side down and cook until nicely browned, about 5 minutes. Use tongs to flip the breasts and cook until firm to the touch, about 5 minutes more. Remove the chicken to a warmed platter and let rest for about 10 minutes.", "Slice the breasts against the grain and serve with Thai sweet chili sauce on the side."]},
{"description": "A vegan falafel burger recipe. You will need dried garbanzos, red onion, garlic, cilantro, parsley, and spices for this recipe.", "title": "Falafel Burgers", "url": "http://www.chowhound.com/recipes/falafel-burgers-31319", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/02/31319_falafel_burgers.jpg", "ingredients": ["1 1/2 cups dried garbanzo beans, also known as chickpeas", "1/2 medium red onion, coarsely chopped", "4 medium garlic cloves, peeled", "1 cup finely chopped cilantro", "1 cup finely chopped flat-leaf parsley", "1 tablespoon freshly squeezed lemon juice", "1 tablespoon ground cumin", "1 tablespoon chili powder", "1 1/2 teaspoons kosher salt", "1 teaspoon baking powder", "3 tablespoons vegetable oil", "6 brioche or hamburger buns (see Game Plan note), split", "1/2 cup plain Greek yogurt", "6 tablespoons tomato jam (optional, see Game Plan note)", "Lettuce leaves"], "directions": [ "Soak the garbanzo beans in plenty of cold water for 24 hours in the fridge. Drain well. The garbanzos will have expanded to measure about 4 cups. ", "Add 2 cups of the soaked garbanzos to a food processor and process until smooth and pasty, about 2 minutes. Use a spatula to scrape the paste into a large bowl. Set aside.", "Add the remaining soaked garbanzos to the food processor along with the onion, garlic, cilantro, parsley, lemon juice, cumin, chili powder, salt, and baking powder. ", " Pulse 10 times, then scrape down the bowl. Pulse 10 more times—the mixture should have a medium-coarse texture. Add it to the bowl with the puréed garbanzos and mix to combine. Refrigerate, covered, for 30 minutes to make it easier to form into patties. ", "Divide the garbanzo mixture into 6 even balls. With your hands, form each ball into a 3/4-inch-thick patty. Set aside. ", "Heat a large cast-iron skillet or heavy frying pan over medium-high heat. Add 1 1/2 tablespoons of the oil and swirl to coat the pan. Carefully add 3 patties and cook, undisturbed, until the bottom surfaces are browned and crisp, about 6 minutes. Flip the patties and cook for 6 minutes more. Remove the patties to a plate and repeat with the remaining vegetable oil and uncooked patties. ", " Toast the buns, if desired.", "Distribute the tomato jam, if using, evenly among the bun bottoms, top with lettuce leaves and the patties, spoon the yogurt on top, and close up. Serve right away. "]},
{"description": "A simple fall salad recipe from Thomas Keller with citrus segments, pomegranate seeds, and an easy vinaigrette.", "title": "Little Gem Lettuce Salad", "url": "http://www.chowhound.com/recipes/little-gem-lettuce-salad-30936", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/12/30936_RecipeImage_620x620_little_gem_lettuce_salad3.jpg", "ingredients": ["1/3 cup champagne vinegar", "3 tablespoons honey", "1/2 cup canola oil", "1/2 cup extra-virgin olive oil", "Kosher salt", "Freshly ground black pepper", "1 pound Little Gem or butter lettuce", "1/2 pomegranate", "2 medium satsuma mandarin oranges", "1 medium Cara Cara or blood orange", "1 medium Ruby Red grapefruit", "Kosher salt", "Freshly ground black pepper", "1/2 cup whole walnuts, toasted", "1/4 cup fresh Italian parsley leaves", "2 tablespoons fresh tarragon leaves"], "directions": [ "Place all of the measured ingredients in a blender, season with salt and pepper, and blend to combine; set aside.", "Line a baking sheet with paper towels and set it aside. Fill a large bowl with cold water. Remove any loose outer leaves from the lettuce and trim the root ends, leaving enough to hold the leaves together. Hold the lettuce heads by the root end and dip them into the cold water several times, shaking gently as you lift to remove any dirt. Cut each head in half through the root end (or, if you’re using butter lettuce, into 4 wedges) and place them cut-side down on the prepared baking sheet; set aside.", "To remove the seeds from the pomegranate, hold it cut-side down in your hand over a medium bowl and hit the back of it with a wooden spoon to release the seeds. Add cold water to the bowl to cover the seeds and let the membranes float to the top. Remove any membranes from the water and drain the seeds; set aside.", "Segment the oranges and grapefruit: Slice 1/4 inch off the top and bottom of 1 of the fruits and set it flat on a work surface. ", " Using a paring knife, follow the curve of the fruit and slice off any remaining peel and white pith. ", " Working over a large bowl, slice between the membranes to release the segments, or supremes. (Chef Michael Symon demonstrates ", ".) ", " Repeat with the remaining fruit; set aside.", "Place the lettuce wedges cut-side up in a large bowl. Drizzle 2 tablespoons of the dressing over the wedges and season with salt and pepper. Using your hands, toss gently to coat. Transfer the wedges to a serving platter.", "Artfully scatter the pomegranate seeds, citrus segments (leave any juices behind in the bowl), and walnuts over the lettuce. Artfully drizzle another tablespoon of the dressing over the salad. Sprinkle the parsley and tarragon leaves evenly over the salad and season with salt and pepper. Serve with the remaining dressing on the side."]},
{"description": "This chole masala recipe is filled with spicy serrano chiles and chickpeas topped with sweet pomegranate molasses.", "title": "Chole (Chana) Masala", "url": "http://www.chowhound.com/recipes/chole-chana-masala-30267", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2014/09/30267_chole_masala_3000.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 teaspoon cumin seeds", "1 medium yellow onion, small dice", "4 teaspoons peeled, finely chopped fresh ginger (from about a 2-inch piece)", "4 medium garlic cloves, finely chopped", "2 serrano chiles, stemmed and finely chopped", "1 (28-ounce) can whole peeled tomatoes and their juices", "2 teaspoons garam masala", "1 teaspoon ground coriander", "1 teaspoon kosher salt, plus more for seasoning", "1/2 teaspoon turmeric", "2 (15-ounce) cans chickpeas, also known as garbanzo beans, drained and rinsed", "1/2 cup water", "Steamed white rice", "Pomegranate molasses ", "Plain yogurt", "Naan or chapatis"], "directions": [ "Heat the oil in a large frying pan over medium heat until shimmering. Add the cumin seeds and cook, stirring occasionally, until fragrant, about 1 minute. Add the onion, ginger, garlic, and chiles and season with kosher salt. Cook, stirring occasionally, until the onions have softened, about 6 minutes.", "Meanwhile, set a fine-mesh strainer over a medium bowl. Strain the tomatoes and reserve the juices. Coarsely chop the tomatoes into 1-inch pieces; set aside.", "When the onions have softened, add the garam masala, coriander, measured salt, and turmeric to the frying pan and stir to coat the onion mixture. Cook, stirring occasionally, until fragrant, about 1 minute.", "Add the chopped tomatoes, their reserved juices, the chickpeas, and the water. Stir to combine, scraping up any browned bits from the bottom of the pan, and bring to a simmer. Reduce the heat to medium low and simmer, stirring occasionally, until the flavors have melded and the sauce has thickened slightly, about 20 minutes.", "Spoon the chole masala over steamed rice, drizzle it with pomegranate molasses, and top it with plain yogurt, if desired. Serve with naan or chapatis."]},
{"description": "A recipe using fresh summer vegetables like corn, bell pepper, and zucchini in an easy and fast sauté with a bit of basil and lemon for a pop of flavor.", "title": "Corn, Bell Pepper, and Zucchini Sauté", "url": "http://www.chowhound.com/recipes/corn-bell-pepper-and-zucchini-saute-30752", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/06/30752_RecipeImage_620x413_corn_bell_pepper_zucchini_saute.jpg", "ingredients": ["2 tablespoons olive oil", "1 medium red bell pepper, cored, seeded, and medium dice", "1/2 medium yellow onion, medium dice", "1 medium garlic clove, finely chopped", "Kosher salt", "Freshly ground black pepper", "2 ears white or yellow corn, shucked", "2 medium zucchini, medium dice", "2 tablespoons thinly sliced fresh basil leaves", "1 teaspoon freshly squeezed lemon juice, plus more as needed"], "directions": [ "Heat the oil in a large frying pan over medium heat until shimmering. Add the bell pepper, onion, and garlic and season with salt and pepper. Cook, stirring occasionally, until the vegetables have softened slightly, about 6 minutes.", "Meanwhile, remove the corn kernels from the cobs: Place a large container on a damp towel. Fold a paper towel into fourths and place it inside the container. Stand 1 ear of corn on the paper towel, using the stem as a handle. Using a paring knife, slice downward, letting the kernels fall into the container. ", " Rotate the cob and continue until all the kernels have been removed; discard the cob. Repeat with the second ear of corn. Set the corn aside and discard the paper towel.", "Increase the heat to medium high, add the zucchini, season with salt and pepper, and stir to combine. Cook, stirring occasionally, until the zucchini is crisp-tender, about 3 to 4 minutes.", "Add the corn, stir to combine, and cook until just warmed through, about 2 minutes. Turn off the heat and stir in the basil and measured lemon juice. Taste and season with salt, pepper, and additional lemon juice as needed."]},
{"description": "This easy, quick pickle recipe uses a basic brine of spices and vinegar to pickle cucumbers, carrots, cauliflower, green beans, zucchini, or okra.", "title": "Easy Quick Pickles ", "url": "http://www.chowhound.com/recipes/easy-quick-pickles-30422", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30422_quick_pickle.jpg", "ingredients": ["1 pound baby carrots (about 2 bunches), green stems trimmed to 1/2 inch, peeled, and halved lengthwise", "1 pound medium Kirby cucumbers (about 4), quartered lengthwise", "1 pound medium zucchini (about 4), quartered lengthwise, then halved crosswise", "12 ounces cauliflower (about 1/2 medium head), cut into 1-inch florets", "12 ounces green beans, stem ends trimmed", "12 ounces okra", "1 tablespoon brown mustard seeds", "1 teaspoon whole black peppercorns", "1 1/4 cups cider vinegar", "3/4 cup water", "1/4 cup granulated sugar", "2 tablespoons kosher salt", "1 bay leaf"], "directions": [ "Pack your vegetable of choice tightly in a 1-quart glass jar, leaving about 1/2 inch of room at the top. Set aside.", "Make the brine: Toast the mustard seeds and peppercorns in a small saucepan over medium heat until fragrant, about 2 minutes. Add the remaining ingredients and stir until the sugar and salt have dissolved. Bring to a boil.", "Immediately pour the brine into the jar, making sure to cover the vegetables completely. Allow the mixture to cool to room temperature, about 1 hour. Seal the jar with a tightfitting lid and shake or rotate it to evenly distribute the brine and spices. Store in the refrigerator for at least 1 day and preferably 1 week before using. The pickles can be kept in the refrigerator for up to 1 month."]},
{"description": "A fermented cabbage dish great for a beginner fermentation project. Serve it on hot dogs, sausage, or alongside any German meal.", "title": "Basic Sauerkraut", "url": "http://www.chowhound.com/recipes/basic-sauerkraut-29634", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2011/05/29634_sauerkraut_620.jpg", "ingredients": ["5 pounds green cabbage (about 2 medium heads), cored and cut into small wedges", "3 tablespoons kosher salt, plus more as needed"], "directions": [ "Using a food processor fitted with a grating disk and working in batches, finely shred the cabbage. Place in a large bowl, sprinkling some of the measured salt on the cabbage between batches. When all of the cabbage is shredded, add any remaining salt and toss to combine thoroughly. ", "Pack the cabbage and any juices it has released into a 1-gallon ceramic crock or plastic food-safe bucket a little at a time, pressing the cabbage down tightly with your fist as you go. Make sure to leave at least 5 inches of clearance between the cabbage and the rim of the crock or bucket to allow for foaming and bubbling during fermentation. ", "Place a clean plate over the cabbage (it should fit snugly within the opening of the crock or bucket). Place a clean, sealed, 5-pound container of water on the plate to weight down the cabbage (a large Mason jar works well, but do not use metal or any unsanitary weight, as it will contaminate the cabbage). Drape a clean towel over the top of the crock or bucket to keep out any dust, and let it sit in a spot with a temperature around 70°F—no cooler than 65°F or hotter than 75°F. ", "Check back frequently during the first day to be sure the cabbage is releasing enough juices (the salt will pull water from the cabbage to create a brine). Press on the plate and weight if necessary, and add more weight if the liquid doesn’t start to cover the top of the cabbage. After about 6 to 8 hours, there should be at least an inch of brine above the plate. (If there isn’t, you can top off your cabbage with a brine composed of 1 1/2 tablespoons kosher salt dissolved in 1 quart of water.) ", "Check the cabbage every few days, removing the weight and plate to skim away any scum from the top. (The fermentation will cause natural bubbles and foam.) Rinse off the plate and weight thoroughly each time before replacing them. Keep an eye on the brine level; you may have to add more if it’s evaporating (see step 4 for proportions). Keep the plate submerged in at least 1 1/2 inches of brine as the fermentation proceeds. ", "Start tasting the cabbage after about a week, and ferment it to the level of tanginess that you like, anywhere from 1 to 4 weeks. Some people prefer the milder cabbage-y taste of young kraut, while others like a more assertive fermented flavor. ", "When the cabbage is fermented to your liking, transfer it and its brine to clean jars, leaving about a half inch of headspace, and refrigerate. The sauerkraut will last up to 3 months refrigerated and submerged in brine. "]},
{"description": "Just like from the street hawkers.", "title": "Pan-Roasted Chestnuts", "url": "http://www.chowhound.com/recipes/pan-roasted-chestnuts-29295", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29295_pan_roasted_chestnuts.jpg", "ingredients": ["1 pound whole chestnuts (about 3 cups)", "1 cup water, plus more as needed"], "directions": [ "Using a sharp knife, cut an “X” about 1 inch long in the shell of each chestnut (the flat side is easiest). Place the chestnuts in a large straight-sided skillet with a tightfitting lid so that they sit in an even layer with wiggle room. Add the water, place the pan over high heat, and bring to a boil. Boil, shaking the pan often, until the water has evaporated, about 5 minutes. (If the shells do not open, add a little more water and continue to steam until they do.)", "Once the shells open, reduce the heat to low and cook the chestnuts, covered, in the dry pan, shaking the pan occasionally so they don’t burn, until the shells are toasted and the meat is tender, about 20 minutes more. Peel when cool enough to handle."]},
{"description": "This curried calamari ceviche recipe uses bright citrus flavors for an easy summer dish.", "title": "Curried Calamari Ceviche with Mango and Avocado", "url": "http://www.chowhound.com/recipes/curried-calamari-ceviche-with-mango-and-avocado-29619", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29619_curried_calamari_ceviche2.jpg", "ingredients": ["2 cups water, plus more for the ice water bath", "12 ounces cleaned calamari, bodies cut into 1/2-inch rings and tentacles left whole", "1/2 cup freshly squeezed grapefruit juice (from about 1 grapefruit)", "1/2 teaspoon finely grated lime zest", "1/2 cup freshly squeezed lime juice (from about 5 limes), plus more as needed", "1/2 small red onion, finely chopped", "2 tablespoons minced shallot (from about 1/2 medium shallot)", "1 medium garlic clove, minced", "1/2 serrano chile, stemmed, seeded, and minced", "1/4 teaspoon curry powder", "1 medium mango, peeled and cut into medium dice", "1/4 cup thinly sliced red radishes (from about 2 medium radishes)", "Kosher salt", "Freshly ground black pepper", "3 medium avocados"], "directions": [ "Prepare an ice water bath by filling a large bowl halfway with ice and water; set aside.", "Bring the measured water to a boil over high heat in a medium saucepan. Add the calamari, stir, and cook until just opaque, about 1 minute. Remove with a slotted spoon to the ice water bath and let cool, about 4 to 5 minutes. Remove the calamari from the ice water bath and spread out on a clean kitchen towel or paper towels to dry.", "Place the grapefruit juice, lime zest, lime juice, onion, shallot, garlic, serrano, and curry powder in a large, nonreactive bowl and stir to combine. Add the dry calamari, mango, and radishes, season with salt and pepper, and stir to combine. Cover and refrigerate for at least 2 hours and up to 6 hours. Taste and season with additional salt, pepper, and lime juice as needed.", "Peel the avocados, cut them in half, and ", ". To serve, mound about a quarter of the ceviche onto each avocado half."]},
{"description": "A healthy wild-rice salad for barbecues, potlucks, and picnics.", "title": "Wild Rice and Edamame Salad", "url": "http://www.chowhound.com/recipes/wild-rice-and-edamame-salad-29466", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29466_rice_edamame_salad2.jpg", "ingredients": ["1/2 cup blanched slivered almonds", "2 tablespoons white sesame seeds", "4 cups cooked wild rice (see Game Plan note)", "3 medium scallions, thinly sliced (white and light green parts only)", "2 cups shelled cooked edamame, thawed if frozen", "2 medium carrots, peeled and small dice", "1/2 cup dried cranberries", "3 tablespoons olive oil", "2 tablespoons toasted sesame oil", "1/4 cup rice vinegar, plus more as needed", "2 teaspoons honey", "Kosher salt", "Freshly ground black pepper"], "directions": [ "Place the almonds in a medium frying pan over medium heat and toast, stirring often, until golden brown (do not let the nuts burn), about 8 to 10 minutes. Transfer to a large heatproof bowl. Add the sesame seeds to the pan and toast, stirring often, until golden brown, about 2 to 3 minutes. Transfer to the bowl with the almonds.", "Add the rice, scallions, edamame, carrots, and cranberries to the bowl with the almonds and sesame seeds and toss to combine.", "Whisk the olive oil, sesame oil, rice vinegar, honey, and a pinch each of salt and pepper in a medium bowl until combined. Drizzle over the rice mixture and toss to combine. Taste and season as needed with more salt, pepper, and vinegar. Cover and chill for at least one hour before serving."]},
{"description": "A tangy, spicy Spanish tomato sauce.", "title": "Brava Sauce", "url": "http://www.chowhound.com/recipes/brava-sauce-29275", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29275_brava_sauce.jpg", "ingredients": ["1 (15-ounce) can whole tomatoes", "2 tablespoons olive oil", "1 cup small-dice yellow onion (from about 1/2 of a medium onion)", "3 medium garlic cloves, finely chopped", "1 teaspoon hot paprika", "1/4 teaspoon red pepper flakes", "1/4 cup water", "1 teaspoon kosher salt, plus more as needed", "1 bay leaf", "1/8 teaspoon granulated sugar", "2 teaspoons sherry vinegar, plus more as needed", "Several dashes Tabasco or other hot sauce"], "directions": [ "Place the tomatoes with their juices in a medium bowl and, using your fingers, break into rough 1-inch pieces; set aside.", "Heat the oil in a medium frying pan until shimmering. Add the onion and cook, stirring occasionally, until softened, about 8 minutes. Add the garlic, paprika, and red pepper flakes, stir to combine, and cook until fragrant, about 1 minute. Add the reserved tomatoes and their liquid, water, salt, bay leaf, and sugar and bring to a simmer. Cook, stirring occasionally, until the sauce has thickened, is darker in color, and has reduced by about half, about 15 to 20 minutes. Remove the bay leaf and transfer the sauce to a blender.", "Purée until smooth, removing the small cap from the blender lid (the pour lid) and covering the space with a kitchen towel (this allows steam to escape and prevents the blender lid from popping off). Add the vinegar and Tabasco and pulse to combine. Taste and season with additional salt, vinegar, or Tabasco as desired."]},
{"description": "This pasta salad recipe is full of artichokes, tomatoes, basil, parsley, and ricotta salata cheese and is ideal for picnics and barbecues.", "title": "Cold Pasta Salad with Baby Artichokes (Pinninos kin Iscarzofa)", "url": "http://www.chowhound.com/recipes/cold-pasta-salad-with-baby-artichokes-pinninos-kin-iscarzofa-11651", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/11651_pasta_salad_artichokes.jpg", "ingredients": ["3 tablespoons freshly squeezed lemon juice (from about 2 lemons)", "Kosher salt", "1 pound baby artichokes or 8 ounces frozen and thawed artichoke hearts", "2 cups yellow and red teardrop tomatoes (or cherry tomatoes), halved", "1 cup thinly sliced basil", "1/4 cup coarsely chopped Italian parsley leaves", "6 medium garlic cloves, thinly sliced", "1/2 cup extra-virgin olive oil", "Freshly ground black pepper", "1 pound penne pasta", "1 cup (4 ounces) crumbled ricotta salata cheese"], "directions": [ "(If you’re using frozen artichoke hearts, bring a large pot of generously salted water to a boil and skip directly to step 7.) Fill a large, nonreactive bowl halfway with water and add 2 tablespoons of the lemon juice; set aside.", "Working with 1 artichoke at a time, trim the leafy top third with a serrated knife. ", " Pull off the dark outer leaves one by one to reveal the tender yellow inner leaves. ", " Trim the stem bottom. ", "Cut around the outside of the artichoke with a paring knife to remove the remaining tough leaf base. ", " Using a vegetable peeler, shave the dark green skin from the stem, smoothing the edges where the leaves were attached. ", "Cut the artichoke in half lengthwise through the leaves and stem. ", " Using a small spoon, gently scoop out the tough purple choke and the fuzz found between the leaves and stem; discard. ", "Cut each artichoke half in half again lengthwise and place in the reserved lemon water. ", " Repeat with the remaining artichokes.", "Meanwhile, bring a large pot of generously salted water to a boil. Prepare an ice water bath by filling a large bowl halfway with ice and water; set aside. Remove the artichoke quarters from the lemon water, drop them into the boiling water, and cook until just tender, about 3 to 4 minutes. Use a slotted spoon to transfer the artichokes to the prepared ice water bath until cool. Drain again and pat dry between paper towels. Reserve the boiling water.", "Place the remaining 1 tablespoon of lemon juice, the cooked or thawed artichokes, tomatoes, basil, parsley, garlic, and olive oil in a large serving bowl, season generously with salt and pepper, and stir to combine. Set aside.", "Meanwhile, add the pasta to the boiling water and cook according to the package directions. Drain and rinse under cold running water to stop the cooking process. Transfer the pasta to the bowl with the tomato mixture, add the ricotta salata, and toss to combine. Taste and season with salt and pepper as desired."]},
{"description": "This double-chocolate brownie recipe from Marisa Churchill uses Greek yogurt and egg whites for a lighter brownie.", "title": "Double-Chocolate Brownies", "url": "http://www.chowhound.com/recipes/double-chocolate-brownies-30250", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2011/12/30250_RecipeImage_620x413_MarisaChurchill_Brownie.jpg", "ingredients": ["Nonstick pan spray", "1/2 cup plus 2 tablespoons all-purpose flour", "1/2 teaspoon salt", "3 tablespoons canola oil", "3/4 cup sugar", "1/3 cup plain nonfat Greek-style yogurt", "1 teaspoon pure vanilla extract", "1/2 cup unsweetened Dutch-processed cocoa powder", "2 egg whites from large eggs", "1/3 cup mini semisweet chocolate chips"], "directions": [ "Preheat the oven to 350°F with a rack in the center position. Coat a 9-inch square baking pan with pan spray.", "In a small bowl, whisk together the flour and salt; set aside.", "Heat the oil in a medium saucepan over medium heat just until warm. Use a whisk to stir in the sugar until it is evenly moistened. Add the yogurt and vanilla, and stir until thoroughly combined. Stir in the cocoa powder, several tablespoons at a time, to make a thick, dark paste.", "In a small clean bowl and using a clean whisk, beat the egg whites just until they are very thick and foamy. Whisk the whites into the chocolate mixture just to combine. Fold in the flour mixture until streaky, then fold in the chocolate chips just until combined.", "Spread the batter evenly in the prepared pan. Bake for 15 minutes, or until the top has formed a crust and a knife inserted into the center still comes out with wet crumbs on it. Transfer the pan to a wire rack and it let cool for at least 1 hour before cutting.", "To serve: Cut the brownies into 4 even strips one way, then 4 the other, to make 16 brownies.", "Store any leftover brownies at room temperature, tightly wrapped in plastic film, for up to 4 days, or overwrap with foil and freeze for up to 2 weeks. Thaw individual frozen brownies at room temperature."]},
{"description": "A quick and easy Thai recipe for stir-fried noodles with ground chicken and bell peppers.", "title": "Pad Kee Mao (Spicy Ground Chicken and Rice Noodles)", "url": "http://www.chowhound.com/recipes/pad-kee-mao-spicy-ground-chicken-and-rice-noodles-11087", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2012/01/11087_RecipeImage_620x413_pad_kee_mao_.jpg", "ingredients": ["1 (14-ounce) package wide rice noodles", "1/4 cup oyster sauce", "1/4 cup fish sauce", "1/4 cup freshly squeezed lime juice (from about 2 limes)", "3 tablespoons vegetable oil", "2 medium shallots, peeled and thinly sliced", "3 medium garlic cloves, peeled and coarsely chopped", "1 pound ground chicken", "2 medium red or green bell peppers, thinly sliced", "3 large eggs, lightly beaten", "2 medium jalapeño peppers, thinly sliced", "1 cup loosely packed Thai basil leaves"], "directions": [ "Place noodles in a large bowl and cover with boiling water. Soak for about 15 minutes, until loose and pliable but not soft; drain and set aside. Meanwhile, combine oyster sauce, fish sauce, and lime juice in a medium nonreactive bowl, mix well, and set aside.", "Heat oil in a large (12-inch) frying pan over medium-high heat. Once heated, add shallots and garlic and cook for 2 minutes or until softened but not brown. Add ground chicken and break into small pieces. Cook until chicken is white and almost cooked through, about 3 minutes.  Add bell peppers and stir-fry just until they begin to soften, about 5 minutes.", "Push chicken mixture to one side of the pan and add eggs to the center. Scramble with a spatula until eggs are set and don’t run, about 1 minute. Push eggs to the side and add reserved sauce mixture. Once the sauce is boiling, add the drained noodles and toss to coat. Remove from heat, add jalapeños and basil, and toss to combine; serve immediately."]},
{"description": "Healthy Pancake Recipe", "title": "Buckwheat Pancakes with Fresh Blueberries and Maple Syrup", "url": "http://www.chowhound.com/recipes/buckwheat-pancakes-with-fresh-blueberries-and-maple-syrup-10027", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2016/01/10027_buckwheat_pancakes_blueberries.jpg", "ingredients": ["1 1/4 cups buckwheat flour", "1/2 cup plain (all-purpose) flour", "1 teaspoon baking powder", "2 teaspoons caster (superfine) sugar", "Pinch of salt", "4 eggs, separated", "2 cups buttermilk", "Butter, for greasing the pan", "2 cups blueberries", "Plain yogurt", "2 mangoes, cheeked and scored (diced)", "Maple syrup"], "directions": [ "Heat the oven to 250°F. Place the buckwheat flour, plain flour, baking powder, sugar and salt in a bowl and stir to combine. Place the egg yolks and buttermilk in another bowl and stir well to combine. Add the buttermilk mixture to the flour and mix lightly until just combined. A few lumps are fine, so do not over mix.", " Place the egg whites in a clean, dry stainless steel bowl and whisk until stiff peaks form.", " Using a large metal spoon, fold the egg whites through the batter in two batches.", "Heat a large non-stick frying pan over a medium heat and brush a small portion of butter over the base. For each pancake, ladle 4 tablespoons of batter into the pan and sprinkle with a heaped tablespoon of blueberries.", " Cook for about 2 minutes, or until bubbles appear on the surface of the pancake. Turn the pancakes over and cook for another minute. Transfer to a plate and keep warm in the oven while you make the remaining pancakes.", "Serve the pancakes in stacks of three with the yogurt, mango and a jug of maple syrup."]},
{"description": "A healthy recipe from Plated for sunchoke and kale hash with currants over red quinoa.", "title": "Sunchoke and Kale Hash with Currants over Red Quinoa", "url": "http://www.chowhound.com/recipes/sunchoke-kale-hash-currants-red-quinoa-31323", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/03/6._Plate_Sunchokes_and_Kale.jpg", "ingredients": ["2/3 cups red quinoa", "Kosher salt", "8 ounces dinosaur kale", "12 ounces sunchokes", "1 red onion", "4 ounces cremini mushrooms", "1 lemon", "2 sprigs fresh thyme", "1 packet Dijon mustard", "1 teaspoon agave syrup", "2 tablespoons olive oil", "Freshly ground black pepper", "1 packet unsalted butter", "2 tablespoons dried currants"], "directions": [ "Bring a small pot of water to a boil over high heat. When water is boiling, add quinoa and a pinch of salt and cook until tender, about 15 minutes. Drain, return to pot, and cover to keep warm. ", "While quinoa cooks, rinse kale and tear leaves into bite-size pieces, discarding stems. Rinse sunchokes and cut into 1-inch pieces. Peel onion, halve, and thinly slice. Wipe mushrooms clean with a damp paper towel and quarter. Halve lemon. Pick thyme leaves, discarding stems. ", "Place sunchokes in a medium pot and cover with cold water. Place over high heat and bring to a boil. Add a generous pinch of salt and cook until sunchokes are almost tender, about 8 minutes. Add kale to pot and cook until bright green, about 30 seconds. Drain and pat vegetables dry with paper towel. Set aside.", "While sunchokes cook, in a small bowl, whisk together juice of 1/2 lemon, Dijon mustard, agave, thyme, and 1 tablespoon olive oil. Taste and add salt and pepper as needed. Discard remaining lemon. ", "Heat 1 tablespoon oil and butter in a medium pan over medium heat. When oil is shimmering, add sunchokes, kale, mushrooms, and onion. Season with salt and pepper and cook until sunchokes are browned, pressing vegetables down into the pan using a spatula, 8 to 10 minutes. Taste and add salt and pepper as needed. ", "Divide quinoa evenly between 2 plates. Top with hash and drizzle over dressing. Garnish with currants and serve."]},
{"description": "An easy Thai chicken larb recipe with Sriracha, lime, and green beans from Jon Shook and Vinny Dotolo for Plated.", "title": "Chicken Larb Cabbage Cups with Sriracha, Lime, and Green Beans", "url": "http://www.chowhound.com/recipes/chicken-larb-cabbage-cups-sriracha-lime-green-beans-31279", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/01/plated_chicken_laarb_1920x1080.jpg", "ingredients": ["4 tablespoons canola oil", "2 shallots, 1 peeled and thinly sliced, the other peeled and minced", "12 ounces lean, ground chicken", "Kosher salt, to taste", "1 lime, halved", "2 cups mixed lettuces", "1/4 bunch mint, leaves picked, stems discarded", "1/6 bunch cilantro, leaves picked, stems discarded", "4 ounces green beans, trimmed and cut into 1/4-inch pieces", "2 scallions, trimmed and thinly sliced", "2 teaspoons toasted rice powder", "1 tablespoon Asian fish sauce", "1/2 tablespoon Sriracha hot sauce", "1 fresh Thai chile, halved lengthwise, seeds discarded, and minced", "6 leaves green cabbage"], "directions": [ "Heat 3 tablespoons of the canola oil in a medium sauté pan over medium heat. When the oil is shimmering, add the sliced shallot and fry until crisp, about 5 minutes. (Don’t crowd the shallot slices—they should form a single layer in the oil. Fry in batches if necessary.) Transfer the fried shallots to a paper-towel-lined plate and set aside to drain.", "Discard the shallot-frying oil and wipe the sauté pan clean. Add the remaining tablespoon of canola oil and set the pan over medium-high heat. When the oil is shimmering, add the chicken and season with salt and the juice from 1 of the lime halves. Cook, breaking up the chicken with a wooden spoon, until the meat loses its color, about 5 to 6 minutes.", "Transfer the chicken to a large bowl. Immediately add the mixed lettuces, mint, cilantro, green beans, diced shallot, scallions, rice powder, fish sauce, Sriracha, Thai chile, and juice from the remaining lime half. Toss to combine well, and then taste, adding more salt if needed.", "Spoon the chicken mixture into the cabbage cups and place 3 on each serving plate. Top with the fried shallots and serve."]},
{"description": "Vegetables tossed in turmeric and wrapped up with red lentil hummus.", "title": "Lentil Hummus Wrap with Pomegranate Molasses", "url": "http://www.chowhound.com/recipes/lentil-hummus-wrap-with-pomegranate-molasses-14132", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/14132_lentil_hummus_wrap.jpg", "ingredients": ["2 medium purple potatoes, medium dice", "1 medium sweet potato, medium dice", "1 medium yellow squash", "2 tablespoons olive oil", "1 teaspoon ground cumin", "1 teaspoon kosher salt", "1 teaspoon turmeric", "1/2 teaspoon coriander seeds, crushed", "1/8 teaspoon ground cinnamon", "2 (12-inch-by-24-inch) pieces whole-wheat lavash", "3/4 cup Red Lentil Hummus", "4 teaspoons pomegranate molasses"], "directions": [ "Heat the oven to 425°F and arrange a rack in the middle.", "Combine potatoes, squash, oil, cumin, salt, turmeric, coriander, cinnamon, and freshly ground black pepper to taste on a baking sheet and toss to evenly coat the vegetables. Spread in a single layer and roast until vegetables are soft and browned, about 20 minutes. Let cool slightly on a rack.", "Heat a large cast iron skillet or frying pan over medium-high heat until hot but not smoking, about 5 minutes.", "Meanwhile take lavash and cut in half horizontally. Divide vegetables evenly among lavash pieces and dollop 3 tablespoons of hummus on top. Drizzle each wrap with 1 teaspoon of the molasses.", "Fold the ends of the lavash into the middle, then roll burrito-style to close completely. Place a wrap in the heated skillet and toast until lavash is crispy on one side, about 2 minutes. Flip and toast the second side. Repeat with remaining wraps and serve."]},
{"description": "A blend of almonds, sunflower seeds, and pumpkin seeds incorporated into sweet honey candy.", "title": "Honey-Nut Brittle", "url": "http://www.chowhound.com/recipes/honey-nut-brittle-14143", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/14143_honey_nut_brittle2.jpg", "ingredients": ["2 cups honey", "1 cup whole raw almonds", "1 cup whole raw pumpkin seeds", "1 cup whole raw sunflower seeds", "1 1/2 teaspoons kosher salt"], "directions": [ "Line a baking sheet with parchment paper and spray both the pan and the paper with cooking spray; set aside.", "Heat honey in a medium saucepan over medium heat until a candy thermometer reads 240°F, about 10 minutes. Add remaining ingredients and cook until the thermometer reaches 305°F, about 20 minutes more.", "Remove from heat, pour onto the lined baking sheet, and let cool to room temperature. Place in the refrigerator until hard, about 10 minutes more. Break into bite-size pieces and keep refrigerated until ready to serve."]},
{"description": "Nuts and spice coat baked salmon for a simple, healthy dish.", "title": "Dukkah-Crusted Salmon", "url": "http://www.chowhound.com/recipes/dukkah-crusted-salmon-14155", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/14155_dukkah_crusted_salmon.jpg", "ingredients": ["4 (6-ounce) salmon fillets (preferably wild), pin bones removed", "1 tablespoon walnut oil", "2 tablespoons dukkah", "1 teaspoon kosher salt", "1/4 teaspoon freshly ground black pepper"], "directions": [ "Heat the oven to 425°F and arrange a rack in the middle.", "Rinse salmon, pat dry with paper towels, and place on a baking sheet. Drizzle fillets with oil and sprinkle with dukkah, salt, and pepper.", "Bake salmon until the center is firm to the touch but not hard, about 10 to 12 minutes. Remove from the oven and serve immediately."]},
{"description": "A substantial whole-grain risotto lightened with spring vegetables.", "title": "Farro Risotto with Asparagus and Fava Beans", "url": "http://www.chowhound.com/recipes/farro-risotto-with-asparagus-and-fava-beans-10895", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2007/04/risotto_37_290x210.jpg", "ingredients": ["1 cup farro", "Salt", "12 ounces asparagus, trimmed and sliced 1/2 inch thick on the bias (about 3 cups)", "1 pound whole fava beans, shelled (about 1 heaping cup)", "2 cups low-sodium vegetable broth or water", "2 tablespoons olive oil", "2 medium shallots, minced", "Freshly ground black pepper", "2/3 cup dry white wine", "Finely grated zest of 1 lemon (about 1 packed teaspoon)", "2 tablespoons finely chopped fresh tarragon leaves", "3 tablespoons finely chopped fresh Italian parsley leaves", "2 tablespoons unsalted butter"], "directions": [ "Soak the farro in cold water for 20 minutes, drain in a colander, and rinse well. Bring a large pot of heavily salted water to a boil over medium-high heat, add the farro, and simmer for 20 minutes. Drain the farro, then cool it by rinsing under cold water; set aside.", "Clean the pot used to boil the farro and refill with water, salt heavily, and bring to a boil over high heat. Add the asparagus and cook until just tender, about 3 minutes. Remove the asparagus and place in a single layer on a large plate or baking sheet to cool. Return the water to a boil and add the shelled fava beans; cook until tender but not soft, about 1 minute. Drain and rinse under cold water until the beans are cool enough to touch. Remove the thin, pale green skin that covers each bean and discard. Place the skinned beans on the plate or baking sheet with the asparagus.", "Heat the vegetable broth or water in a small saucepan over medium-high heat until it comes to a simmer, then reduce the heat to low so the broth is at a bare simmer while you prepare the risotto.", "Heat the olive oil in a medium saucepan over medium-high heat. When it shimmers, add the shallots and season with salt and pepper. Cook, stirring occasionally, until the shallots are softened but not browned, about 2 minutes. Add the cooked farro and stir to coat in the oil; cook until the outer coating of the farro grains is glossy and a toasty aroma rises from the pot, about 3 minutes. Add the wine and stir until it has evaporated.", "Add a ladleful of warm broth and cook, stirring frequently, until the farro has almost completely absorbed it, about 2 minutes. Add another ladleful of broth and stir until almost all of it has been absorbed. (Do not let the pan get dry—there should be a constant veil of stock over the farro at all times.) Continue adding ladlefuls of broth, stirring frequently and tasting regularly, until the farro is tender but firm to the bite (the indentation in the farro grain will open and puff when completely cooked), about 15 to 20 minutes.", "Remove the saucepan from heat and gently fold in the reserved asparagus and fava beans, lemon zest, tarragon, parsley, and butter. Taste and, if necessary, season with more salt and pepper."]},
{"description": "A French-influenced side salad with herbs and red wine vinaigrette.", "title": "Frisée-Parsley Salad", "url": "http://www.chowhound.com/recipes/frisee-parsley-salad-12000", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/12000_frisee_salad.jpg", "ingredients": ["1 medium head frisée, trimmed and washed", "1/2 bunch fresh chives, minced", "1/2 bunch fresh Italian parsley, leaves picked and washed", "2 tablespoons extra-virgin olive oil", "1 tablespoon red wine vinegar"], "directions": [ "Combine frisée, chives, and parsley in a medium bowl and toss well.", "In a separate small nonreactive bowl, whisk together oil and vinegar, and season with salt and freshly ground black pepper.", "Add dressing to greens and, using clean hands, toss to coat evenly. Taste and adjust seasoning as necessary."]},
{"description": "Whole fish stuffed with herbs and lemon, wrapped in bacon, and grilled over an open fire.", "title": "Campfire Trout with Herbs and Bacon", "url": "http://www.chowhound.com/recipes/campfire-trout-with-herbs-and-bacon-10938", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/11-10-14/10938_trout_herbs_bacon.jpg", "ingredients": ["4 small butterflied whole trout (8 to 10 ounces each)", "Chef’s Salt and Pepper Mix", "1 medium lemon, thinly sliced", "Generous handful of mixed herbs, such as thyme, rosemary, chervil, and tarragon", "4 pieces thinly sliced smoked bacon or turkey bacon"], "directions": [ "Build a campfire and place a grilling rack over it.", "Open the grilling basket and place it over a cutting board. Lay trout in the grilling basket opened up like a book. Sprinkle flesh generously with salt and pepper mix. Distribute lemon slices and herbs evenly among trout, laying ingredients on the left half of each fish.", "Close the right half of the trout over the filling. Secure each fish by wrapping a slice of bacon around its middle section. Sprinkle outside of each fish with salt and pepper mix and close the grilling basket.", "Set the grilling basket over the campfire, directly on the grill rack. Cook, flipping the grilling basket occasionally, until trout are nicely browned, bacon is rendered, and each fish’s flesh is opaque and flakes easily with a fork. Remove from heat, open the basket, and transfer fish to a serving platter."]},
{"description": "This roasted sardines recipe, served over smashed potatoes, is a tasty way to eat fresh, sustainable fish.", "title": "Roasted Sardines with Smashed Potatoes", "url": "http://www.chowhound.com/recipes/roasted-sardines-with-smashed-potatoes-29617", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29617_roasted_sardines_potatoes.jpg", "ingredients": ["2 1/2 pounds medium Yukon Gold potatoes", "1/4 cup olive oil", "2 tablespoons finely chopped fresh rosemary leaves", "1/2 teaspoon red pepper flakes", "1/2 teaspoon kosher salt, plus more as needed", "Freshly ground black pepper", "2 pounds fresh sardines, scaled, heads and fins removed, gutted, and boned", "Freshly ground black pepper", "1 cup kalamata olives, pitted and coarsely chopped", "1/2 cup coarsely chopped fresh Italian parsley leaves", "3 medium garlic cloves, minced", "3 anchovy fillets, minced", "3 tablespoons olive oil", "Finely grated zest of 2 medium lemons (about 2 packed teaspoons)", "Juice of 2 medium lemons (about 1/4 cup)", "1/4 teaspoon kosher salt, plus more as needed", "3/4 cup fresh breadcrumbs"], "directions": [ "Heat the oven to 450°F and arrange a rack in the middle.", "Place the potatoes in a large pot, cover with water, generously season the water with salt, and bring to a boil over high heat. Reduce the heat to medium and simmer until the potatoes are knife tender, about 25 to 30 minutes. Drain the potatoes.", "When the potatoes are cool enough to handle, place them on a baking sheet. Using the palm of your hand, press down on each until flattened to about a 1/2- to 3/4-inch thickness (the skins will split apart and the flesh may crumble slightly).", "Whisk together the oil, rosemary, red pepper flakes, measured salt, and pepper to taste in a small bowl until combined. Using a pastry brush, brush half of the oil mixture over the potatoes and season with salt. Using a flat spatula, flip the potatoes over, brush the remaining oil mixture over them, and season with salt.", "Roast until the bottoms of the potatoes are golden brown, about 20 minutes. Using the flat spatula, flip the potatoes over and roast until the edges and bottoms are crunchy and golden brown, about 20 minutes more. Remove from the oven, place the baking sheet on a wire rack, and cover with foil.", "Keep the oven at 450°F and arrange a rack in the top position closest to the broiler.", "Place the sardines on a baking sheet and season the insides and outsides with salt and pepper.", "Combine the olives, parsley, garlic, anchovies, olive oil, lemon zest, lemon juice, measured salt, and pepper to taste in a medium bowl. Fill each sardine with a few teaspoons of the olive mixture. (The amount needed will vary depending on the size of your sardines. Do not overfill—the fish should not be gaping open.) Scatter any remaining olive mixture around the sardines on the baking sheet, leaving any excess liquid in the bowl. Sprinkle the breadcrumbs on top of the sardines. Roast just until the fish are firm and starting to brown at the edges, about 5 to 7 minutes.", "To serve, divide the smashed potatoes among four plates. Lay the sardines over the potatoes and top with any leftover roasted-olive-and-breadcrumb mixture from the baking sheet. Serve immediately."]},
{"description": "This grilled calamari with braised fennel and polenta recipe is a mélange of Italian and Mediterranean flavors.", "title": "Grilled Calamari with Braised Fennel and Polenta ", "url": "http://www.chowhound.com/recipes/grilled-calamari-with-braised-fennel-and-polenta-29618", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29618_grilled_calamari_fennel_polenta.jpg", "ingredients": ["2 tablespoons olive oil", "1 large fennel bulb, stalks removed and discarded, bulb cored and cut into 1-by-3-inch pieces", "1 medium yellow onion, thinly sliced", "Kosher salt", "Freshly ground black pepper", "3 medium garlic cloves, minced", "1/3 cup dry white wine", "1 (14-1/2-ounce) can whole plum tomatoes, drained and coarsely chopped", "3/4 cup water", "1/4 cup capers ", "2 cups polenta", "3/4 cup finely grated Parmesan cheese (optional)", "1 1/2 teaspoons kosher salt", "1/2 teaspoon freshly ground black pepper", "1/4 cup packed fresh Italian parsley leaves, finely chopped ", "4 medium garlic cloves, minced", "3 tablespoons olive oil", "Juice of 2 medium lemons (about 1/4 cup)", "1/2 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "1 1/2 pounds cleaned calamari, bodies and tentacles left whole", "1 medium lemon, cut into 8 wedges, for serving"], "directions": [ "Heat the oil in a large frying pan with a tightfitting lid over medium heat until shimmering. Add the fennel and onion, season with salt and pepper, and cook, stirring occasionally, until softened and beginning to brown, about 5 minutes. Add the garlic and cook until fragrant, about 1 minute. Add the wine and simmer until the alcohol smell cooks off, about 1 minute,", "Add the tomatoes, water, and capers along with any brine and stir to combine. Cover, reduce the heat to medium low, and simmer until the fennel is fork tender and the flavors have melded, about 20 to 25 minutes. Uncover, and if the sauce is thin, increase the heat to medium high and cook until it reaches your desired consistency. Taste and season with additional salt and pepper as needed. Cover and keep warm.", "Cook the polenta according to the package directions.", "Stir in the Parmesan (if using), salt, and pepper. Taste and season with additional salt and pepper as needed. Cover and remove from heat.", "Heat a dry grill pan over high heat until smoking, about 5 minutes.", "Meanwhile, whisk the parsley, garlic, oil, lemon juice, salt, and pepper together in a large bowl. Add the calamari and stir to coat.", "When the grill pan is hot, place the calamari bodies and tentacles 1 to 2 inches apart in the pan, working in batches as needed. Cook, turning once, until the bodies are just opaque and grill marks have appeared, about 1 1/2 minutes per side (do not overcook). Remove to a large plate and repeat with any remaining calamari.", "Spoon the polenta into a large rimmed serving plate or bowl. Top with the braised fennel and calamari and serve with lemon wedges on the side."]},
{"description": "An easy way to season and roast raw pumpkin seeds or leftover seeds from a jack-o’-lantern.", "title": "Barbecue Pumpkin Seeds", "url": "http://www.chowhound.com/recipes/barbecue-pumpkin-seeds-27505", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2009/10/bbq_pumpkin_seeds_290.jpg", "ingredients": ["2 cups pumpkin seeds", "2 teaspoons vegetable oil", "1 tablespoon barbecue seasoning", "2 teaspoons kosher salt"], "directions": []},
{"description": "An easy way to season pumpkin seeds with the pantry staple.", "title": "Pumpkin Seeds with Seasoned Salt", "url": "http://www.chowhound.com/recipes/seasoned-salt-pumpkin-seeds-27508", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2009/10/seasoned_salt_seeds_290.jpg", "ingredients": ["2 cups pumpkin seeds", "2 teaspoons vegetable oil", "1 tablespoon seasoned salt"], "directions": []},
{"description": "Simply pumpkin seeds roasted and tossed with Creole seasoning.", "title": "Creole-Seasoned Pumpkin Seeds", "url": "http://www.chowhound.com/recipes/creole-seasoned-pumpkin-seeds-27509", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2009/10/creole_pumpkin_seeds_290.jpg", "ingredients": ["2 cups pumpkin seeds", "2 teaspoons vegetable oil", "1 tablespoon Creole seasoning"], "directions": []},
{"description": "This healthy, vegan-friendly tomato sauce is great over al dente pasta, chicken Parmesan, meatballs, lasagne, you name it.", "title": "Marinara Sauce ", "url": "http://www.chowhound.com/recipes/marinara-sauce-29440", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29440_marinara_sauce.jpg", "ingredients": ["2 (28-ounce) cans whole peeled tomatoes, preferably San Marzano", "1/4 cup extra-virgin olive oil", "1 medium yellow onion, finely chopped", "2 medium garlic cloves, minced", "1 tablespoon tomato paste", "1 bay leaf", "1/4 teaspoon red pepper flakes, plus more as needed", "Kosher salt", "2 tablespoons capers"], "directions": [ "Using a food processor fitted with a blade attachment, pulse the tomatoes and their juices, in batches as needed, until coarsely chopped (about 10 pulses). Heat the oil in a large saucepan with a tightfitting lid over medium-high heat until shimmering. Add the onion and cook, stirring occasionally, until translucent, about 3 minutes. Add the garlic and cook until fragrant, about 30 seconds more.", "Push the onions and garlic to one side of the pan and add the tomato paste to the empty side of the pan. Cook the paste slightly to remove the raw flavor, stirring occasionally, about 1 to 2 minutes. Stir the onions and garlic into the paste to incorporate. Add the chopped tomatoes, bay leaf, red pepper flakes, and a few pinches of salt. Bring the mixture to a boil, then reduce the heat to low, cover, and simmer for 45 minutes to meld the flavors.", "Add the capers, taste, and season with additional salt and red pepper flakes as needed."]},
{"description": "A simple dip recipe that balances the sweetness of roasted bell peppers with salty cheese.", "title": "Roasted Red Pepper–Feta Dip", "url": "http://www.chowhound.com/recipes/roasted-red-pepperfeta-dip-21690", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/21690_roasted_red_pepper_dip.jpg", "ingredients": ["2 medium red bell peppers, stemmed, halved lengthwise, and seeds and white pith removed", "2 tablespoons olive oil", "8 ounces crumbled feta cheese (about 1 1/2 cups)"], "directions": [ "Heat the broiler to high and arrange a rack in the middle. Place peppers on a baking sheet cut side down, drizzle with 1 tablespoon of the olive oil, and season well with salt and freshly ground black pepper. Broil until blackened and charred, about 15 minutes, rotating the pan as necessary.", "Transfer peppers to a bowl, cover tightly with plastic wrap, and let sit until cool enough to handle, at least 20 minutes. Remove peppers from the bowl, reserving any liquid.", "Peel peppers and place in a blender. Add feta, reserved pepper liquid, and remaining 1 tablespoon olive oil, and season with salt and freshly ground black pepper. Blend on high until smooth, about 1 minute. Serve with toasted pita wedges or assorted crackers."]},
{"description": "Noodles layered with tomato sauce, roasted eggplant slices, and herbed tofu.", "title": "Vegan Lasagna", "url": "http://www.chowhound.com/recipes/vegan-lasagna-29439", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2014/09/29439_vegan_lasagna.jpg", "ingredients": ["1 1/2 pounds eggplant (about 2 small)", "2 teaspoons kosher salt, plus more as needed", "4 tablespoons extra-virgin olive oil", "Freshly ground black pepper", "1 teaspoon finely chopped fresh Italian parsley leaves", "1/2 teaspoon red wine vinegar", "Pinch red pepper flakes", "2 (28-ounce) cans whole peeled tomatoes, preferably San Marzano", "1/4 cup extra-virgin olive oil", "1 medium yellow onion, finely chopped", "2 medium garlic cloves, minced", "1 tablespoon tomato paste", "1 bay leaf", "1/4 teaspoon red pepper flakes, plus more as needed", "Kosher salt", "2 tablespoons capers", "Kosher salt", "12 ounces dried lasagna noodles", "2 pounds soft tofu, drained", "1/3 cup finely chopped Italian parsley leaves", "3 tablespoons nutritional yeast (optional)", "2 teaspoons finely grated lemon zest (from about 2 medium lemons)", "2 tablespoons freshly squeezed lemon juice, plus more as needed (from about 1/2 lemon)", "2 teaspoons kosher salt, plus more as needed", "1/2 teaspoon freshly ground black pepper, plus more as needed", "1 cup loosely packed basil leaves (from about 1 bunch), cut into 1/4-inch-thick ribbons"], "directions": [ "Heat the oven to 350°F and arrange a rack in the middle.", "Cut the eggplant(s) lengthwise into 1/8-inch-thick slices. Place in a single layer on a flat surface or 2 baking sheets, overlapping slightly as needed, and sprinkle evenly with 1 teaspoon of the salt. Flip the eggplant and sprinkle evenly with the remaining 1 teaspoon salt; let sit until water beads form on the surface, at least 30 minutes. Meanwhile, prepare the sauce.", "Using a food processor fitted with a blade attachment, pulse the tomatoes and their juices, in batches as needed, until coarsely chopped (about 10 pulses). Heat the oil in a large saucepan with a tightfitting lid over medium-high heat until shimmering. Add the onion and cook, stirring occasionally, until translucent, about 3 minutes. Add the garlic and cook until fragrant, about 30 seconds more.", "Push the onions and garlic to one side of the pan and add the tomato paste to the empty side of the pan. Cook the paste slightly to remove the raw flavor, stirring occasionally, about 1 to 2 minutes. Stir the onions and garlic into the paste to incorporate. Add the chopped tomatoes, bay leaf, red pepper flakes, and a few pinches of salt. Bring the mixture to a boil, then reduce the heat to low, cover, and simmer for 45 minutes to meld the flavors.", "Add the capers, taste, and season with additional salt and red pepper flakes as needed; set aside.", "Using paper towels, pat the eggplant slices dry on both sides. In a large nonstick frying pan, heat 1 1/2 teaspoons of the oil over medium-high heat. Add just enough eggplant to sit in a single layer in the pan and sear on both sides, about 4 minutes total. Taste and season with salt and pepper as needed. Transfer to a plate and repeat, in batches, with another 1 1/2 tablespoons of the oil and the remaining uncooked eggplant.", "While the eggplant cooks, place the remaining 2 tablespoons olive oil, parsley, vinegar, red pepper flakes, and a pinch of salt in a large bowl and stir to combine. Transfer the seared eggplant to the oil-vinegar mixture and toss. Taste and season with additional salt as needed.", "Bring a large pot of heavily salted water to a boil over medium-high heat. Add the noodles and cook, stirring occasionally, until al dente, about 7 minutes. Drain. When cool enough to handle, lay the pieces flat on a lightly oiled baking sheet.", "Place the tofu, parsley, nutritional yeast (if using), lemon zest, lemon juice, and measured salt and pepper in the bowl of a food processor fitted with a blade attachment and process until smooth, about 30 seconds. Taste and season with more lemon juice, salt, and pepper as needed; set aside.", "Spread a thin layer of tomato sauce in the bottom of a 13-by-9-inch baking dish. Place a single layer of noodles on top of the sauce, about 3 regular-sized noodles. Top the noodles with a quarter of the tofu filling (about 1 cup) and spread evenly. Lay a quarter of the eggplant slices over the filling. Spread about 1 cup of sauce over the eggplant and sprinkle with about 1/4 cup of the basil leaves. Make three more layers of noodles, filling, eggplant, sauce, and basil, omitting the basil from the top layer.", "Cover with foil and bake for 50 minutes. Uncover and bake until bubbling, about 10 minutes more. Let cool at least 10 minutes before cutting. Sprinkle with the remaining 1/4 cup basil. Serve with any remaining tomato sauce."]},
{"description": "A fragrantly spiced vegetarian recipe adapted from Canal House Cooking.", "title": "Curried Cauliflower, Chickpeas, and Tofu", "url": "http://www.chowhound.com/recipes/curried-cauliflower-chickpeas-and-tofu-29423", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29423_curried_cauliflower_chickpeas_tofu.jpg", "ingredients": ["4 tablespoons vegetable oil", "1/2 teaspoon fennel seeds", "1 small yellow onion, finely chopped", "2 tablespoons peeled, grated fresh ginger (from about a 3-inch piece)", "2 medium garlic cloves, minced to a paste", "1 teaspoon garam masala (see Game Plan note)", "1/2 teaspoon turmeric", "1/8 teaspoon cayenne pepper", "Kosher salt", "1/2 cup plus 2 tablespoons water", "1 (15-ounce) can chickpeas, also known as garbanzo beans, drained and rinsed (about 1 1/2 cups)", "1 1/2 pounds cauliflower (about 1 medium head), trimmed and cut into 1-inch florets", "1/2 cup all-purpose flour", "1 (12-to 14-ounce) package extra-firm tofu, large dice", "Freshly ground black pepper", "1 large handful cilantro, leaves and stems coarsely chopped", "2 tablespoons freshly squeezed lime juice (from about 1 medium lime)", "Steamed brown rice or steamed white rice, for serving (optional; see Game Plan note)", "Yogurt, for serving (optional)", "Naan or chapati, for serving (optional)"], "directions": [ "Heat 2 tablespoons of the oil in a large frying pan with a tightfitting lid over medium heat until shimmering. Add the fennel seeds and toast, stirring, until fragrant, about 1 minute. Add the onion, ginger, and garlic and cook, stirring and scraping the bottom of the frying pan with a wooden spoon, until browned, about 10 minutes.", "Add the garam masala, turmeric, cayenne, and a large pinch of salt and cook, dribbling in a little water, 1 to 2 tablespoons, as you stir. Add the chickpeas, cauliflower, and the remaining 1/2 cup water. Cover and cook until the cauliflower is tender, about 15 to 20 minutes.", "Meanwhile, place the flour in a large bowl. Place the tofu cubes on paper towels, pat dry, and season all over with salt and pepper. Toss the tofu in the flour until coated. Heat a second large frying pan with the remaining 2 tablespoons oil over medium-high heat until shimmering. Add the tofu, tapping off any excess flour first, and brown on all sides, being careful of splattering oil, about 9 minutes. Transfer to a paper-towel-lined plate and season with more salt.", "When the cauliflower is ready, gently fold in the tofu, cilantro, and lime juice. Serve immediately with rice, yogurt, naan, or chapati, if desired."]},
{"description": "A recipe for cauliflower, chickpeas, and green beans simmered in a Thai-style green curry and coconut milk sauce.", "title": "Cauliflower Green Curry", "url": "http://www.chowhound.com/recipes/cauliflower-green-curry-29293", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29293_green_curry.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 medium yellow onion, medium dice", "1 1/2 teaspoons kosher salt, plus more as needed", "4 medium garlic cloves, thinly sliced", "3 tablespoons Thai green curry paste", "1 (13- to 14-ounce) can unsweetened regular or light coconut milk", "1/4 cup water", "1 tablespoon soy sauce", "1 large head cauliflower (about 2 pounds), trimmed and cut into 1-inch florets", "1 (15-ounce) can chickpeas, also known as garbanzo beans, drained and rinsed", "8 ounces green beans, trimmed and cut into 1-inch pieces", "1/4 cup packed Thai basil leaves", "1 1/2 teaspoons freshly squeezed lime juice", "Steamed white rice or brown rice, for serving (see Game Plan note)"], "directions": [ "Heat the oil in a large frying pan over medium heat until shimmering. Add the onion and 1 teaspoon of the salt and cook, stirring occasionally, until softened, about 6 minutes. Add the garlic and cook until fragrant, about 1 minute.", "Add the curry paste, stirring to coat the onions, and cook until fragrant, about 1 minute. Add the coconut milk, water, soy sauce, and remaining 1/2 teaspoon of salt, stir to combine, and bring to a lively simmer.", "Add the cauliflower, chickpeas, and green beans and stir to combine. Reduce the heat to medium low, cover with a tightfitting lid, and simmer, stirring occasionally, until the cauliflower is just tender, about 8 to 10 minutes. Remove from the heat and stir in the basil leaves and lime juice. Taste and season with more salt as needed. Serve with steamed rice."]},
{"description": "Tangy, fresh, and herby, this sauce is great served with lamb chops, or as a healthy dip.", "title": "Cucumber-Yogurt Sauce ", "url": "http://www.chowhound.com/recipes/cucumber-yogurt-sauce-29278", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29278_cucumber_sauce.jpg", "ingredients": ["1/2 medium English cucumber, peeled", "7 ounces (scant 1 cup) whole-milk Greek yogurt", "1 tablespoon finely chopped fresh cilantro", "1 tablespoon finely chopped fresh mint leaves", "1 teaspoon freshly squeezed lemon juice", "1 medium garlic clove, minced", "1/4 teaspoon ground cumin", "Salt", "Freshly ground black pepper", "Water as needed, for thinning the sauce"], "directions": [ "Grate the cucumber on the large holes of a box grater. Run a knife over the grated cucumber until it’s fine in texture but not totally minced. Mound the cucumber in the center of a clean tea towel, then twist the towel to squeeze the moisture from the cucumber. Place the cucumber in a medium bowl.", "Add the yogurt, herbs, lemon juice, garlic, and cumin, season with salt and pepper, and mix well. Refrigerate for 1 hour or overnight to meld the flavors before serving. If the sauce is too thick, thin it out with a few teaspoons of water until it reaches the desired consistency."]},
{"description": "A simple and quick cabbage slaw recipe flavored with lime juice, garlic, cumin, chili powder, and cilantro. It's ideal for topping fish tacos.", "title": "Tangy Cabbage Slaw", "url": "http://www.chowhound.com/recipes/tangy-cabbage-slaw-30732", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/06/30732_RecipeImage_620x413_tangy_cabbage_salad.jpg", "ingredients": ["1/2 cup small-dice red onion (about 1/2 medium red onion)", "1/4 cup freshly squeezed lime juice (from about 3 medium limes)", "1/4 cup vegetable oil", "1 1/2 teaspoons kosher salt, plus more as needed", "1/2 teaspoon freshly ground black pepper, plus more as needed", "1/2 teaspoon granulated sugar", "1/4 teaspoon chili powder", "1/4 teaspoon ground cumin", "1/8 teaspoon cayenne pepper", "1 medium garlic clove, finely chopped", "1 medium head of green or red cabbage (about 2 pounds)", "1/3 cup coarsely chopped fresh cilantro"], "directions": [ "Whisk together the onion, 3 tablespoons of the lime juice, the oil, measured salt and pepper, sugar, chili powder, cumin, cayenne, and garlic in a large bowl until combined; set aside for 10 minutes. Meanwhile, prepare the cabbage.", "Slice the cabbage in half through the core. Cut a V-shaped notch around the white core on each half; discard the core. Slice each half lengthwise into quarters and thinly slice each quarter crosswise into 1/8-inch-wide strips.", "Add the cabbage and cilantro to the bowl with the dressing and toss to combine. Refrigerate, tossing once or twice, until the flavors have mellowed and melded, about 1 1/2 hours. Add the remaining tablespoon of lime juice, toss again, taste, and season with more salt and pepper as needed before serving."]},
{"description": "A cucumber tea sandwich recipe made with hummus and thinly sliced lemon.", "title": "Cucumber, Hummus, and Lemon Tea Sandwiches", "url": "http://www.chowhound.com/recipes/cucumber-hummus-and-lemon-tea-sandwiches-10915", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/06/10915_RecipeImage_620x413_cucumber_hummus_lemon_tea_sandwiches.jpg", "ingredients": ["1/2 medium English cucumber (about 8 ounces)", "1 teaspoon kosher salt, plus more as needed", "1 1/2 medium lemons", "8 slices nutty oat bread", "1 cup hummus", "Freshly ground black pepper"], "directions": [ "Using a mandoline or a very sharp knife, slice the cucumber into paper-thin rounds, about 1/16 inch thick. Place the slices in a colander or sieve set over a bowl, sprinkle them with the measured salt, and toss to combine. Set aside to drain for 15 to 20 minutes.", "Meanwhile, using the mandoline or very sharp knife, slice the lemons into paper-thin rounds about 1/16 inch thick, removing any seeds as you go; set them aside.", "Using a rolling pin, flatten each slice of bread to half its original thickness. Spread 2 tablespoons of the hummus evenly on 1 side of each slice of bread and season with salt and pepper; set aside.", "When the cucumbers are ready, lightly blot them with paper towels to remove any excess moisture. Shingle the cucumber slices over the hummus on 4 slices of bread (about 12 slices per sandwich). Top the cucumbers with a layer of lemon slices (about 4 slices per sandwich).", "Close the sandwiches with the remaining slices of bread. Trim the crusts, and make 2 diagonal cuts on each sandwich to form 4 triangles."]},
{"description": "This grilled chicken recipe has a sweet and smoky barbecue sauce made from nectarines and chipotles in adobo sauce.", "title": "Grilled Chicken with Nectarine BBQ Sauce", "url": "http://www.chowhound.com/recipes/grilled-chicken-with-nectarine-barbecue-sauce-30453", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30453_grilled_chicken_nectarine2.jpg", "ingredients": ["1 tablespoon kosher salt", "1/2 teaspoon freshly ground black pepper", "3 pounds boneless, skinless chicken breasts or bone-in, skin-on chicken pieces", "1 tablespoon vegetable oil", "1/2 medium yellow onion, medium dice", "1 tablespoon minced chipotles in adobo sauce (from about 1 medium chipotle)", "1 medium garlic clove, finely chopped", "1 teaspoon kosher salt, plus more as needed", "Freshly ground black pepper", "1/2 cup ketchup", "6 ripe but firm yellow nectarines (about 1 1/2 pounds), pitted and cut into 1-inch pieces", "1/3 cup packed dark brown sugar", "2 tablespoons cider vinegar", "Vegetable oil, for rubbing the grill grates", "4 ripe but firm yellow nectarines (about 1 pound), pitted and halved"], "directions": [ "Mix the salt and pepper together in a small bowl; set aside.", "If using chicken breasts (either boneless or bone-in), cut them in half crosswise. Pat the chicken pieces dry with paper towels and place on a baking sheet. Season all over, using all of the salt and pepper mixture. Refrigerate uncovered for at least 6 hours or preferably overnight.", "Heat the oil in a medium saucepan over medium heat until shimmering. Add the onion, chipotle, garlic, and measured salt. Season with pepper and cook, stirring occasionally, until the onion has softened, about 5 minutes.", "Add the ketchup and cook, stirring occasionally, until fragrant and slightly darkened in color, about 2 minutes. Add the remaining ingredients, stir to combine, and cook until the mixture is bubbling around the edges, about 5 minutes.", "Reduce the heat to medium low and simmer, stirring occasionally, until the nectarines are completely softened and starting to fall apart, about 15 to 20 minutes.", "Transfer the mixture to a blender. Remove the small cap from the blender lid (the pour lid) and cover the space with a kitchen towel (this allows steam to escape and prevents the lid from popping off). Blend until smooth. Taste and season with salt and pepper as needed. Equally divide the sauce between 2 small bowls and set aside to cool to room temperature. Set aside 1 bowl of sauce for serving and the other bowl for brushing onto the chicken and nectarines while they cook on the grill.", "Remove the chicken from the refrigerator and let it sit at room temperature for about 15 minutes. Meanwhile, heat an outdoor grill or grill pan to medium (about 350°F to 450°F).", "When the grill is ready, rub the grill grates with a towel dipped in vegetable oil. Place the chicken on the grill (skin-side down if using skin-on), cover the grill, and cook until grill marks appear on the bottom, about 5 minutes. Flip the chicken pieces, cover the grill, and cook until grill marks appear on the second side, about 5 minutes more.", "Flip the chicken again and, using the bowl of sauce set aside for the chicken and nectarines, generously brush the chicken. Cover the grill and cook for 5 minutes. Flip and brush the chicken, and continue to flip and brush every 5 minutes (reserving about 1/3 cup of the sauce for the nectarines), until an instant-read thermometer inserted into the thickest chicken piece reads 160°F to 165°F and the meat near the bone is no longer pink, about 10 to 15 minutes more (about 25 to 30 minutes total cooking time). Remove the chicken to a clean serving platter and cover loosely with foil; set aside.", "Scrape down the grill with a grill brush and oil the grates again. Brush the nectarines all over with the remaining 1/3 cup of the sauce. Place cut-side down on the grill, cover the grill, and cook until grill marks appear on the bottom, about 4 to 5 minutes. Using a flat spatula, flip the nectarines and cook until grill marks appear on the second side and the nectarines are slightly softened, about 4 to 5 minutes more. Remove to the serving platter with the chicken and serve immediately, passing the reserved bowl of barbecue sauce."]},
{"description": "In this recipe, a chile and cocoa powder rub forms a sweet and flavorful crust on healthy grilled pork tenderloins.", "title": "Cocoa-Chile-Rubbed Grilled Pork Tenderloin", "url": "http://www.chowhound.com/recipes/cocoa-chile-rubbed-grilled-pork-tenderloin-30745", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/06/30745_RecipeImage_620x413_cocoa_chili_grilled_pork_tenderloin_2.jpg", "ingredients": ["1 tablespoon chili powder", "1 tablespoon plus 1 teaspoon Dutch-process or natural unsweetened cocoa powder", "1 tablespoon plus 1 teaspoon packed dark brown sugar", "1 tablespoon plus 1 teaspoon kosher salt", "1 teaspoon ground cumin", "1/2 teaspoon freshly ground black pepper", "1/2 teaspoon ground cinnamon", "2 (1- to 1-1/2-pound) pork tenderloins", "2 tablespoons olive oil"], "directions": [ "Place all of the ingredients in a small bowl and mix to combine; set aside.", "Trim the pork of any silver skin and pat it dry with paper towels. Using your hands, rub the tenderloins all over with the oil, sprinkle them with all of the spice mixture, and rub until evenly coated. Set aside at room temperature for 30 minutes or cover and refrigerate for up to 24 hours.", "Heat a gas or charcoal grill to medium (about 350°F to 450°F). If the tenderloins have been refrigerated, let them sit at room temperature for at least 30 minutes before grilling.", "Place the tenderloins on the grill. Cover the grill and cook, turning every 5 minutes, until the tenderloins are browned all over and an instant-read thermometer inserted into the thickest part registers 145°F to 150°F, about 20 to 30 minutes.", "Transfer the tenderloins to a cutting board and let them rest for 5 to 10 minutes. Cut crosswise into 1/2-inch-thick slices and serve."]},
{"description": "This grilled nectarine crumble recipe fills honey-glazed nectarine halves with a pecan crumble and tops them with lemon mascarpone.", "title": "Grilled Nectarine Crumble", "url": "http://www.chowhound.com/recipes/grilled-nectarine-crumble-30441", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30441_grilled_nectarine_crumble.jpg", "ingredients": ["1/2 cup mascarpone cheese", "2 teaspoons granulated sugar", "1/2 teaspoon finely grated lemon zest", "3/4 cup roasted, salted pecans, finely chopped", "1/4 cup packed dark brown sugar", "2 tablespoons unsalted butter (1/4 stick), at room temperature", "1 teaspoon ground cinnamon", "1/4 cup honey", "2 tablespoons brandy", "1/2 teaspoon vanilla extract", "6 medium, ripe, but firm nectarines (about 2 1/2 pounds), halved and pitted"], "directions": [ "Heat a grill pan or outdoor grill to medium high (about 375°F to 425°F).", "Stir together the mascarpone cheese, sugar, and lemon zest in a small bowl until evenly combined, then set aside.", "Meanwhile, place the pecans, brown sugar, butter, and cinnamon in a medium bowl and pinch the mixture together with your fingers until moist and crumbly; set aside. Whisk the honey, brandy, and vanilla together in a small bowl; set aside.", "When the grill is ready, place the nectarines on a baking sheet and brush both sides with the honey mixture, using all of it. Place the nectarines cut-side down on the grill (reserve the baking sheet). Cover the grill and cook until grill marks appear on the bottom, about 2 to 3 minutes.", "Using a flat metal spatula, flip the nectarines. Divide the pecan mixture among the nectarine halves, using all of it (about 1 heaping tablespoon per half). Cover the grill and cook until grill marks appear on the second side and the nectarines begin to soften, about 3 to 4 minutes more. Remove the nectarines to the reserved baking sheet. Serve immediately or at room temperature, topping with the lemon-mascarpone mixture just before serving."]},
{"description": "This grilled shishito peppers recipe is sprinkled with togarashi for an extra kick of spice.", "title": "Grilled Shishito Peppers", "url": "http://www.chowhound.com/recipes/grilled-shishito-peppers-30210", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30210_grilled_shishito_peppers.jpg", "ingredients": ["1/2 pound shishito peppers, washed and thoroughly dried", "1 tablespoon olive oil", "1/4 teaspoon togarashi", "Coarse sea salt, such as fleur de sel or Maldon"], "directions": [ "Heat an indoor grill pan or outdoor grill to medium high (about 375°F to 425°F). Meanwhile, place the peppers in a medium bowl, add the olive oil, and toss to coat; set aside.", "When the grill is ready, place the peppers on the grill in a single layer, making sure they’re not touching; reserve the bowl they were in. Grill the peppers uncovered, turning them occasionally, until they start to char and blister, about 6 to 8 minutes total.", "Return the peppers to the bowl, toss immediately with the togarashi and salt, and serve."]},
{"description": "A simple recipe for grilled apricots and herbed strawberries to serve over angel food cake for a light summer dessert.", "title": "Apricots and Herbed Strawberries with Angel Food Cake", "url": "http://www.chowhound.com/recipes/apricots-and-herbed-strawberries-with-angel-food-cake-30443", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30443_apricots_herbed_strawberry2.jpg", "ingredients": ["1 pound strawberries, washed, hulled, and medium dice", "1/4 cup granulated sugar", "1/2 teaspoon finely grated orange zest (from about 1/2 medium orange)", "3 tablespoons freshly squeezed orange juice", "3 tablespoons finely chopped fresh mint leaves", "1 teaspoon finely chopped fresh rosemary leaves (optional)", "2 tablespoons honey", "1 1/2 teaspoons water", "8 medium apricots (about 1 pound), halved and pitted", "1 angel food cake, sliced into 16 pieces"], "directions": [ "Heat a grill pan or outdoor grill to medium high (about 375°F to 425°F).", "Meanwhile, combine the strawberries, sugar, orange zest, orange juice, mint, and rosemary in a medium bowl; set aside. Whisk the honey and water together in a small bowl until combined, set aside.", "When the grill is ready, place the apricots on a baking sheet and brush both sides with the honey mixture, using all of it. Place the apricots on the grill cut-side down (reserve the baking sheet). Cover the grill and cook until grill marks appear on the bottom, about 2 to 3 minutes.", "Using a flat metal spatula, flip the apricots, cover the grill, and cook until grill marks appear on the second side and the apricots begin to soften, about 2 to 3 minutes more. Remove the apricots to the reserved baking sheet.", "To serve, place the slices of angel food cake on a serving platter. Top with the apricots cut-side up, then top with the strawberry mixture. Serve immediately."]},
{"description": "This recipe for ranch-dressing-flavored cashews tosses roasted nuts with a buttermilk, garlic, onion, and chive spice mix for an addictive snack.", "title": "Tangy Ranch Cashews", "url": "http://www.chowhound.com/recipes/tangy-ranch-cashews-30290", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30290_ranch_cashews.jpg", "ingredients": ["2 teaspoons dried chives", "2 teaspoons kosher salt", "3 tablespoons buttermilk powder", "1/2 teaspoon garlic powder", "1/2 teaspoon onion powder", "1/2 teaspoon paprika", "1/4 teaspoon citric acid powder ", "4 cups raw cashews (about 1 pound 6 ounces)", "3 tablespoons vegetable oil"], "directions": [ "Heat the oven to 400°F and arrange a rack in the middle.", "Place the chives and salt in a coffee or spice grinder and grind until a fine powder forms. Transfer the powder to a small bowl. Add the buttermilk powder, garlic powder, onion powder, paprika, and citric acid to the bowl and stir to combine; set aside.", "Place the nuts and oil in a large bowl and stir until the nuts are evenly coated. Transfer to a rimmed baking sheet and spread the nuts into an even layer. (Reserve the bowl—you don’t need to wash it.) Roast, stirring halfway through, until the nuts are browned and toasted, about 10 to 15 minutes total.", "Immediately transfer the nuts to the reserved bowl. (Reserve the baking sheet—no need to wash.) Add the ranch powder and stir to evenly coat the nuts.", "Return the coated nuts to the reserved baking sheet and spread into an even layer. Let cool completely, about 30 minutes. Serve immediately or store in an airtight container at room temperature for up to 5 days."]},
{"description": "This recipe takes roasted pumpkin seeds (a.k.a. pepitas) and coats them with homemade spiced nacho cheese powder.", "title": "Nacho Cheese Pumpkin Seeds", "url": "http://www.chowhound.com/recipes/nacho-cheese-pumpkin-seeds-30289", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30289_naco_cheese_pumpkin_seeds.jpg", "ingredients": ["4 ounces shredded sharp cheddar cheese (about 1 1/2 cups)", "2 teaspoons buttermilk powder", "1 1/4 teaspoons kosher salt", "1/2 teaspoon chili powder", "1/2 teaspoon onion powder", "1/4 teaspoon garlic powder", "1/8 teaspoon cayenne pepper", "1 pound raw hulled pumpkin seeds, also known as pepitas (about 3 cups)", "2 tablespoons vegetable oil"], "directions": [ "Heat the oven to 200°F and arrange a rack in the middle. Sprinkle the cheese on a rimmed baking sheet in an even layer. Bake until the cheese melts and the oil separates out of it, about 1 hour.", "Remove the baking sheet from the oven and blot off any oil from the surface of the cheese with paper towels. Return the baking sheet to the oven and bake until the cheese is completely dry and brittle, about 2 hours more. Meanwhile, fold 4 paper towels in half lengthwise and place them on a work surface.", "When the cheese is ready, immediately transfer it to the paper towels using a flat metal spatula. Blot any remaining oil from the surface with additional paper towels. Break the cheese into small pieces.", "Working in batches, grind the cheese pieces in a coffee or spice grinder until a fine powder forms. Transfer the powder to a medium bowl, add the remaining ingredients, and whisk to combine; set aside.", "Increase the oven temperature to 375°F and keep the rack in the middle. Place the seeds and oil in a large bowl and stir until the seeds are evenly coated. Transfer to a rimmed baking sheet and spread the seeds in an even layer. (Reserve the bowl—you don’t need to wash it.) Roast, stirring halfway through, until the seeds are fragrant and starting to brown, about 10 minutes total.", "Immediately transfer the seeds to the reserved bowl. (Reserve the baking sheet—no need to wash.) Add the nacho cheese powder and stir to evenly coat the seeds.", "Return the coated seeds to the reserved baking sheet and spread them in an even layer. Let them cool completely, about 30 minutes. Serve immediately or store in an airtight container at room temperature for up to 5 days."]},
{"description": "Instead of using khoya, i have cooked the carrots in milk, to bring about the same creamy taste and texture, yet save on the time taken to make the khoya. Voila...", "title": "Carrot pudding", "url": "http://www.chowhound.com/recipes/carrot-pudding-30840", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["2 cups thickly grated carrot", "1 tbsp ghee", "2 tbsp milk", "4 tbsp sugar", "4 tbsp mava (khoya)", "1 tbsp raisins (kismis)", "1 tbsp chopped almonds (badam)", "1/2 tsp cardamom (elaichi) powder"], "directions": [ "Heat the ghee in a pressure cooker; add the carrots and sauté on a medium flame for 4 to 5 minutes, while stirring continuously.", "Add the milk, mix well and pressure cook for 1 whistle.", "Allow the steam to escape before opening the lid.", "Transfer into a broad non-stick pan, add the sugar, mix well and cook on a high flame for 5 to 7 minutes, while stirring continuously.", "Add the mava, mix well and cook for more 1 to 2 minutes, while stirring continuously.", "Add the raisins, almonds and cardamom powder and cook for another 1 minute.", "Serve hot or warm."]},
{"description": "A simple fish recipe for broiled tilapia topped with a spicy Spanish-inspired sauce made with tomatoes, red pepper flakes, sherry vinegar, and paprika.", "title": "Broiled Tilapia with Brava Sauce", "url": "http://www.chowhound.com/recipes/broiled-tilapia-with-brava-sauce-30937", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/12/30937_RecipeImage_620x413_broiled_talapia_brava_sauce.jpg", "ingredients": ["1 (15-ounce) can whole tomatoes", "3 tablespoons olive oil", "1 cup small-dice yellow onion (from about 1/2 medium onion)", "3 medium garlic cloves, finely chopped", "1 teaspoon hot paprika", "1/4 teaspoon red pepper flakes", "1/4 cup water", "1 teaspoon kosher salt, plus more as needed", "1 bay leaf", "1/8 teaspoon granulated sugar", "2 teaspoons sherry vinegar, plus more as needed", "Several dashes Tabasco or other hot sauce, plus more as needed", "4 tilapia fillets (about 1 1/2 pounds)", "Freshly ground black pepper"], "directions": [ "Place the tomatoes with their juices in a medium bowl and, using your fingers, break them into rough 1-inch pieces; set aside.", "Heat 2 tablespoons of the oil in a medium frying pan over medium heat until shimmering. Add the onion and cook, stirring occasionally, until softened, about 8 minutes. Add the garlic, paprika, and red pepper flakes and cook, stirring occasionally, until fragrant, about 1 minute. Add the reserved tomatoes and their juices, water, measured salt, bay leaf, and sugar and bring to a simmer.", "Reduce the heat to low and cook, stirring occasionally, until the sauce has thickened, become darker in color, and reduced by about half, about 15 to 20 minutes. Meanwhile, set the oven to broil and arrange a rack in the upper third. Line a rimmed baking sheet with aluminum foil and set it aside.", "When the sauce is ready, remove and discard the bay leaf. Transfer the sauce to a blender. Add the measured vinegar and hot sauce and blend until smooth, removing the small cap (the pour lid) from the blender lid and covering the space with a kitchen towel (this allows steam to escape and prevents the blender lid from popping off). Taste and season with additional salt, vinegar, or hot sauce as desired. Transfer to a serving bowl.", "Pat the tilapia dry with paper towels and coat with the remaining tablespoon of oil. Season both sides with salt and pepper and place on the prepared baking sheet. Broil until opaque and cooked through, about 5 to 6 minutes. Serve with the sauce."]},
{"description": "Ketchup grows up with the addition of sweet piquillo peppers.", "title": "Piquillo Pepper Ketchup", "url": "http://www.chowhound.com/recipes/piquillo-pepper-ketchup-21783", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["2 tablespoons olive oil", "1/2 cup finely chopped yellow onion", "1 pound (about 7 medium) plum tomatoes, peeled, seeded, and chopped", "One 12-ounce jar piquillo peppers, roughly chopped (about 1 cup)", "1/4 cup white wine vinegar, plus more to taste", "2 teaspoons honey or sugar, plus more to taste", "2 garlic cloves, very finely chopped", "1 teaspoon finely chopped fresh thyme", "Sea salt and freshly ground black pepper"], "directions": [ "In a saucepan, heat 1 tablespoon of the olive oil over medium heat. Add the onion and cook until soft and translucent, about 5 minutes. Add the tomatoes, peppers, 1/4 cup of vinegar, 2 teaspoons of honey, garlic, thyme, and salt and pepper to taste. Bring to a simmer and cook, uncovered, until the mixture is very thick, about 15 minutes, stirring frequently so the ketchup does not scorch.", "Transfer the mixture to a blender or food processor and purée until smooth. Taste for seasoning and adjust with salt, pepper, honey, and vinegar as needed. The ketchup should have a good balance of sweet and tart. Pour the ketchup into a container and stir in the remaining 1 tablespoon olive oil. Cover and set aside at room temperature until needed. The ketchup keeps, refrigerated, for up to a week. It may also be frozen for up to 4 months"]},
{"description": "A low-fuss recipe from Anthony Bourdain with an impressive presentation.", "title": "Whole Roasted Fish Basquaise", "url": "http://www.chowhound.com/recipes/whole-roasted-fish-basquaise-10188", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2006/09/rcp_fishbasquaise_290x210.jpg", "ingredients": ["2 Yukon Gold potatoes, cut into small pieces", "4 tablespoons olive oil", "1 onion, thinly sliced", "1 red bell pepper, cored, seeded, and cut into thin strips", "1 green bell pepper, cored, seeded, and cut into thin strips", "4 garlic cloves, crushed", "2 sprigs of thyme, leaves only", "1/2 cup white wine", "1 cup chicken broth or light chicken stock", "1 red snapper, about 2 pounds, scales removed, gills removed, fins clipped, guts removed, but otherwise intact", "Juice of 1 lemon", "4 sprigs of flat parsley"], "directions": [ "Preheat the oven to 400°F. Place the potatoes in a small pot and cover them with water. Add salt to taste and bring to a boil. Cook for 10 minutes. The potatoes should still be firm. Remove them from the water and reserve.", "On the stovetop, heat the olive oil in a roasting pan until it almost sizzles. Add the onions and peppers, and cook over medium heat until the vegetables are soft and browned. Add the garlic and thyme, and cook for another 2 to 3 minutes. Stir in the white wine, scraping the bottom of the pan with a wooden spoon to dislodge all that good stuff. Stir in the chicken broth and bring the mixture to a boil.", "Season the fish with salt and freshly ground black pepper inside and out. After the broth and vegetables have been boiling for 5 minutes, place the fish in the pan, add the potatoes, and toss the whole thing into the oven. Cook for about 30 minutes, basting the fish with the pan juices 2 or 3 times during cooking.", "Change the oven’s setting to broil, remove the pan from the oven, and remove the fish from the roasting pan. Place the fish on a baking tray and put it under the broiler for 3 to 5 minutes, or until the skin turns brown and crispy. Keep an eye on it: You do not want to scorch the thing. Transfer the fish to a serving platter. Add the lemon juice to the bell pepper and potato mixture, and season with salt and pepper. After a quick shot of heat and a stir or two, spoon the mixture over and around the fish. Garnish with the parsley and serve immediately."]},
{"description": "This aloo gobi recipe has cauliflower and potatoes cooked in a sauce flavored with ginger, garlic, mustard seeds, and Indian spices.", "title": "Aloo Gobi (Potatoes and Cauliflower)", "url": "http://www.chowhound.com/recipes/aloo-gobi-potatoes-and-cauliflower-30942", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/12/30942_RecipeImage_620x413_aloo_gobi.jpg", "ingredients": ["1/4 cup vegetable oil", "1 pound Yukon Gold potatoes (about 4 medium potatoes), large dice", "1 teaspoon yellow mustard seeds", "4 teaspoons peeled and finely chopped fresh ginger (from about 1 [2-inch] piece)", "3 medium garlic cloves, finely chopped", "1 teaspoon ground cumin", "3/4 teaspoon kosher salt, plus more as needed", "1/2 teaspoon ground coriander", "1/2 teaspoon turmeric", "1/4 teaspoon cayenne pepper", "1 medium head cauliflower (about 2 pounds), trimmed and cut into 1-inch florets", "1/2 cup water", "1 tablespoon unsalted butter"], "directions": [ "Heat 3 tablespoons of the oil in a large frying pan (not nonstick) over medium-high heat until shimmering. Add the potatoes and season with salt. Cook, occasionally tossing and scraping up any browned bits from the bottom of the pan with a flat metal spatula, until the potatoes are beginning to brown in spots, about 6 minutes. Scrape the potatoes into a medium bowl and set aside.", "Reduce the heat to medium, add the remaining tablespoon of oil to the pan, and heat until shimmering. Add the mustard seeds and toast until fragrant and popping, about 1 minute. Add the ginger, garlic, cumin, measured salt, coriander, turmeric, and cayenne and cook, stirring occasionally with a wooden spoon, until fragrant, about 1 minute.", "Add the cauliflower and stir to coat in the spices. Return the potatoes to the pan, add the water, and stir to combine. Cover with a tightfitting lid and cook until the cauliflower is tender, about 10 minutes. Add the butter and stir until it’s melted and coating the vegetables. Taste and season with salt as needed."]},
{"description": "Flavored with orange and grapefruit zest.", "title": "Cranberry and Citrus Sauce", "url": "http://www.chowhound.com/recipes/cranberry-and-citrus-sauce-11135", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/11135_cranberry_sauce.jpg", "ingredients": ["1 (12-ounce bag) frozen or fresh cranberries (about 3 cups)", "3/4 cup granulated sugar", "1/3 cup freshly squeezed orange juice", "2 teaspoons finely grated orange zest", "1 1/2 teaspoons finely grated ruby red grapefruit zest", "1/2 cup ruby red grapefruit segments, medium dice"], "directions": [ "Combine cranberries, sugar, orange juice, and both zests in a medium saucepan over medium heat, stirring until sugar is dissolved, about 5 minutes.", "Bring to a boil, stirring occasionally, then reduce heat to medium low and simmer until thickened and cranberries are beginning to fall apart, about 20 to 25 minutes. Spoon into a heatproof serving bowl.", "Drain grapefruit segments, discarding any accumulated juices, and stir into cranberry sauce. Cool to room temperature, cover, and refrigerate until ready to serve. Serve cold or at room temperature."]},
{"description": "Orange juice and mint update this classic Latin dish.", "title": "Snapper Ceviche with Chiles and Herbs", "url": "http://www.chowhound.com/recipes/snapper-ceviche-with-chiles-and-herbs-10979", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/10979_snapper_civiche_chile_herbs.jpg", "ingredients": ["8 ounces snapper fillet (or substitute rock cod), large dice", "8 tablespoons freshly squeezed lime juice (from 3 medium limes)", "1/4 cup freshly squeezed orange juice", "2 medium tomatoes, cored, seeds removed, and small dice", "1/4 medium red onion, small dice", "2 to 3 medium serrano chiles, seeds removed, small dice", "1/4 cup finely chopped cilantro", "1/4 cup loosely packed mint leaves"], "directions": [ "Place fish in a nonreactive mixing bowl, and toss with 2 tablespoons of the lime juice until it is well coated. Cover and refrigerate for 2 1/2 to 3 hours (the fish should be opaque in color and firm to the touch).", "About 30 minutes before the fish is ready, combine remaining 6 tablespoons lime juice with orange juice, tomatoes, onion, chiles, and cilantro in a nonreactive mixing bowl; set aside to marinate.", "When the fish is ready, add tomato-onion mixture and toss to combine. To serve, season with salt and freshly ground black pepper and transfer ceviche to chilled serving dishes. Tear mint leaves and sprinkle over each serving."]},
{"description": "Not authentic, but still fresh and flavorful, with cabbage, cucumber, shredded chicken, and a punchy dressing.", "title": "Chinese-y Chicken Salad", "url": "http://www.chowhound.com/recipes/chinese-y-chicken-salad-10620", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/10620_chinese_chicken_salad.jpg", "ingredients": ["3 tablespoons red wine vinegar", "1 tablespoon soy sauce", "2 teaspoons toasted sesame oil", "1 tablespoon hoisin sauce", "4 scallions, root ends trimmed and white and light green parts finely chopped", "1 (1-inch) piece fresh ginger, peeled and finely grated", "2 teaspoons honey", "2 teaspoons Chile-garlic paste", "5 cups cold rotisserie chicken, shredded", "1/4 cup slivered almonds", "1/2 medium red bell pepper, sliced into thin strips", "1 cup thinly sliced English cucumber strips", "2 cups thinly sliced red cabbage", "2 cups thinly sliced green cabbage", "3 cups thinly sliced iceberg lettuce"], "directions": [ "In a small mixing bowl, whisk all ingredients together, or combine in a jar with a screw-on cap and shake vigorously. Season with salt and freshly ground black pepper.", "Place chicken in a large mixing bowl, add several tablespoons of dressing, and toss to coat. The chicken should be evenly coated but not drenched.", "Meanwhile, heat the oven to 350°F. Spread almonds on a baking sheet and toast in the oven until light brown, about 10 minutes.", "Mix red bell pepper, cucumber, cabbages, and lettuce. Add greens mixture to chicken a handful at a time, tossing to combine.", "Add more dressing a tablespoon at a time, tossing until everything is evenly coated. It’s OK to go heavy with the dressing—this salad will need it. Season with a pinch or two of salt.", "Arrange salad on a serving platter, sprinkle with toasted almonds, and serve."]},
{"description": "Tarragon and chives balance the Dijon and vermouth for an easy but flavorful salad.", "title": "Herbed Beets with Fennel", "url": "http://www.chowhound.com/recipes/herbed-beets-with-fennel-10627", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2006/09/rcp_herbed_beets_fennel_290x210.jpg", "ingredients": ["6 medium beets", "2 large fennel bulbs", "2 tablespoons extra-virgin olive oil", "2 tablespoons unsalted butter (1/4 stick)", "Salt", "Freshly ground black pepper", "1/3 cup dry vermouth", "2 tablespoons whole-grain Dijon mustard", "Juice of 1 medium lemon", "1/2 bunch chives, finely chopped", "1/2 bunch tarragon, leaves picked, finely chopped"], "directions": [ "Place the beets in a large pot, cover with cold water, and bring to a boil over high heat. Once boiling, reduce the heat to medium and simmer until the beets are fork tender, about 30 minutes. Drain, then peel under cold running water. Set the beets aside to cool.", "Trim any green tops off the fennel and slice the bulbs in half lengthwise. Remove the core from each half and slice the bulbs lengthwise in 1/4-inch-thick strips.", "Return the large pot to the stove, add the olive oil and butter, and heat over medium heat. When the butter foams, add the fennel, season well with salt and pepper, and cook, stirring occasionally, until just tender, about 5 minutes.", "Add the vermouth, mustard, and lemon juice and bring to a simmer. Meanwhile, slice the peeled beets into 1/4-inch-thick rounds. Add the beets to the pot and cook until warmed through, about 5 minutes more. Stir in the herbs, taste, and adjust the seasoning as desired."]},
{"description": "Bagel chips, pretzels, and sesame sticks in a honey-mustard glaze.", "title": "Honey-Mustard Snack Mix", "url": "http://www.chowhound.com/recipes/honey-mustard-snack-mix-14158", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/14158_honey_mustartd_snack_mix.jpg", "ingredients": ["7 cups plain bagel chips, broken in half", "6 cups pretzel sticks", "3 cups sesame sticks", "12 tablespoons unsalted butter (1 1/2 sticks), melted", "1 1/4 cups honey", "3/4 cup mustard powder ", "4 teaspoons kosher salt"], "directions": [ "Heat the oven to 375°F and arrange the racks in the upper and lower thirds of the oven. Line two baking sheets with parchment paper; set aside.", "Mix together bagel chips, pretzel sticks, and sesame sticks in a large bowl until evenly combined; set aside.", "Mix together butter, honey, mustard powder, and salt in a medium bowl until smooth and well combined. Pour over pretzel mixture, stirring until evenly coated.", "Scatter snack mix in a single layer on the prepared baking sheets. Bake, stirring occasionally, until toasted and browned, about 20 minutes. Let cool to room temperature, then break into bite-size pieces."]},
{"description": "A quick, versatile Korean chile sauce.", "title": "Sweet Chile Dipping Sauce", "url": "http://www.chowhound.com/recipes/sweet-chile-dipping-sauce-25682", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/25682_sweet_chile_dipping_sauce.jpg", "ingredients": ["1/2 cup Korean chile paste", "1/4 cup honey", "1/4 cup rice vinegar"], "directions": [ "Combine all ingredients in a medium nonreactive bowl and stir until smooth. Serve immediately or cover and refrigerate for up to 1 month."]},
{"description": "Sweet honey combines with salty fish sauce and floral coriander seed for a complex-flavored but simple-to-make beef jerky.", "title": "Thai Beef Jerky", "url": "http://www.chowhound.com/recipes/thai-beef-jerky-13448", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/13448_thai_beef_jerky2.jpg", "ingredients": ["3 pounds sirloin tip", "1/2 cup honey", "5 tablespoons soy sauce", "2 tablespoons fish sauce", "2 tablespoons ground coriander"], "directions": [ "Arrange meat flat on a plate or baking sheet, cover with plastic wrap, and freeze until firm, about 1 1/2 hours.", "When meat is ready, place on a cutting board, trim any visible fat, and slice along the grain into 1/4-inch-thick strips. (You want the strips to be as uniform as possible to ensure even drying.)", "Place all remaining ingredients in a large baking dish or resealable plastic bag, and mix until evenly combined. Place beef strips in the marinade and toss thoroughly to coat. Cover and place in the refrigerator for 12 hours, turning once.", "Remove meat from the refrigerator, place in a colander to drain off excess marinade, and let come to room temperature, about 30 minutes. Meanwhile, remove the racks from the oven, completely line the bottom of the oven with foil, and heat to 160°F.", "Spray the oven racks with nonstick cooking spray, blot any excess marinade from the meat with paper towels, and arrange beef strips horizontally across the racks, leaving at least 1/2 inch of space between strips.", "Place the racks back in the oven and dehydrate jerky until dry, shriveled, and, when bent, it gives way before breaking but doesn’t snap, about 3 hours.", "Blot any oil or moisture from the jerky with paper towels and cool completely on the racks before storing."]},
{"description": "Browned chicken braised atop peppers and onions and flavored with Basque dried pepper.", "title": "Chicken Basquaise", "url": "http://www.chowhound.com/recipes/chicken-basquaise-10986", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/11-10-14/10986_chicken_basquaise.jpg", "ingredients": ["1 (3- to 3-1/2-pound) broiler chicken, cut into 8 pieces (ask your butcher to do this)", "1 tablespoon olive oil", "Pipérade (see Game Plan note)"], "directions": [ "Rinse chicken pieces and pat dry with paper towels. Season well with salt and freshly ground pepper. Heat oil over medium-high heat in a 3-1/2- or 5-quart casserole or large Dutch oven.", "When oil shimmers, add chicken pieces in a single layer (do this in batches) and let cook until very brown, turn, and repeat until pieces are well-browned all over, about 10 minutes per batch. Remove browned pieces to a plate and set aside. Discard excess oil and wipe out the pot with paper towels.", "Place pipérade in the bottom of the pot, top with browned chicken pieces, cover, and bring to a simmer over low heat. Cook, stirring occasionally (make sure to scrape the bottom of the pot so the sauce doesn’t burn), until the chicken is cooked through, about 45 minutes. Serve on top of steamed rice or potatoes."]},
{"description": "This virgin gin and tonic cocktail recipe is made with infused nonalcoholic wine, tonic water, and a lemon or lime wedge.", "title": "Virgin Gin and Tonic", "url": "http://www.chowhound.com/recipes/virgin-gin-and-tonic-30599", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30599_virgin_gin_tonic.jpg", "ingredients": ["2 tablespoons juniper berries", "1 teaspoon coriander seeds", "3/4 teaspoon anise seeds", "1 medium lemon", "2 cups dealcoholized or nonalcoholic white wine", "Ice", "1 lemon or lime wedge", "4 ounces tonic water, chilled"], "directions": [ "Place the juniper, coriander, and anise in a small frying pan over medium heat and toast, shaking the pan occasionally, until fragrant, about 3 minutes. Remove to a medium bowl.", "Using a vegetable peeler, remove the zest from the lemon and add it to the bowl. Add the wine and stir to combine. Cover the bowl with plastic wrap and let it sit at room temperature for 3 hours or refrigerate for up to 1 day.", "When the mixture’s done infusing, set a fine-mesh strainer over a pint jar and strain the infused wine into the jar. Discard the contents of the strainer. Use the infusion immediately or seal the jar and refrigerate it for up to 1 month.", "Place an Old Fashioned glass in the freezer to chill for 5 minutes.", "Fill the chilled glass halfway with ice and add 2 ounces of the nonalcoholic white wine infusion. Gently rub the lemon or lime wedge along the rim of the glass, then squeeze and drop it into the glass. Top with the tonic water, gently stir to incorporate, and serve immediately. Refrigerate the remaining wine infusion for up to 1 month."]},
{"description": "Make Chowhound's swiss chard recipe for an easy and healthy side dish. Recipe outlines six simple steps to stir swiss chard and lentils together with a little...", "title": "Swiss Chard with Lentils and Feta Cheese", "url": "http://www.chowhound.com/recipes/swiss-chard-with-lentils-and-feta-cheese-30566", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30566_swiss_chard_lentils_feta_cheese.jpg", "ingredients": ["2 tablespoons olive oil", "1/2 cup small-dice yellow onion (from about 1/2 medium onion)", "2 medium garlic cloves, finely chopped", "1 cup brown or green lentils", "2 cups water", "12 ounces Swiss chard (about 1 bunch)", "1/2 teaspoon kosher salt, plus more for seasoning", "1/4 teaspoon freshly ground black pepper, plus more for seasoning", "4 teaspoons red wine vinegar", "1/2 cup crumbled feta cheese (about 2 1/2 ounces)"], "directions": [ "Heat 1 tablespoon of the oil in a medium saucepan over medium heat until shimmering. Add the onion and garlic, season with salt and pepper, and cook, stirring occasionally, until softened, about 5 minutes.", "Add the lentils, stir to combine, and add the water. Increase the heat to high and bring to a simmer. Reduce the heat to low and simmer, stirring occasionally, until the lentils are just tender and the water has evaporated, about 30 minutes. Remove from the heat and set aside.", "Meanwhile, trim the ends from the chard stems and discard. Cut off the stems at the base of the leaves and slice the stems crosswise into 1/4-inch pieces. Place in a small bowl and set aside. Stack the leaves, cut them in half lengthwise, then coarsely chop into bite-sized pieces; set aside.", "Heat the remaining tablespoon of oil in a large frying or straight-sided pan over medium-high heat until shimmering. Add the reserved chard stems, season with salt and pepper, and cook, stirring occasionally, until softened, about 5 minutes.", "Add the chopped chard leaves, measured salt, and measured pepper and cook, stirring occasionally, until wilted, about 2 minutes. Stir in the red wine vinegar and reserved lentil mixture until evenly combined. Remove from the heat and allow to cool slightly, about 3 minutes.", "Sprinkle in the feta and stir to combine. Taste and season with salt and pepper as needed. Serve warm or at room temperature."]},
{"description": "A healthier pizza crust option, this recipe for whole wheat pizza dough bakes up with a crisp, blistered exterior and a chewy interior.", "title": "Whole Wheat Pizza Dough", "url": "http://www.chowhound.com/recipes/whole-wheat-pizza-dough-30657", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/01/sardine_pizza_620x413.jpg", "ingredients": ["1 cup warm water (110°F to 115°F)", "1 teaspoon honey", "1 (1/4-ounce) packet active dry yeast (2 1/4 teaspoons)", "2 cups all-purpose flour", "1 cup whole wheat flour", "3/4 teaspoon fine salt", "1 tablespoon olive oil, plus more as needed"], "directions": [ "Whisk the water and honey together in the bowl of a stand mixer fitted with a dough hook and sprinkle the yeast on top. Set aside until the mixture bubbles, about 10 minutes.", "Meanwhile, place the flours and salt in a large bowl and whisk to combine. When the yeast is ready, add the flour mixture and measured olive oil and mix on low speed until the dough just starts to come together and looks shaggy, about 2 minutes.", "Increase the speed to medium and continue to mix until the dough is elastic and smooth, about 5 minutes. Meanwhile, wipe out the large mixing bowl, coat it with oil, and set aside.", "When the dough is ready, gather it into a ball, place it in the oiled mixing bowl, and turn to coat it in the oil. Cover with a clean, damp dishtowel or plastic wrap and let it rest in a warm place until it doubles in size, about 1 hour.", "Once the dough has risen, punch it down and turn it out onto a lightly oiled work surface. Divide the dough into 2 pieces and form each into a ball.", "Place the dough balls on a lightly oiled work surface, cover with a clean, damp dishtowel or plastic wrap, and let rest for 15 to 20 minutes. Shape and bake as desired."]},
{"description": "An easy soup recipe made with ground-turkey-and-rice meatballs, zucchini, carrots, tomatoes, and the Mexican flavors of cilantro, cumin, and chili powder.", "title": "Mexican Turkey Meatball Soup", "url": "http://www.chowhound.com/recipes/mexican-turkey-meatball-soup-30658", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/30658_mexican_turkey_meatball_soup.jpg", "ingredients": ["1 pound ground turkey", "1/2 medium white or yellow onion, finely chopped", "1/3 cup uncooked long-grain white rice", "1/4 cup coarsely chopped fresh cilantro", "1 large egg, lightly beaten", "2 medium garlic cloves, finely chopped", "2 teaspoons kosher salt", "1/2 teaspoon chili powder", "1/2 teaspoon ground cumin", "1 tablespoon vegetable oil", "1/2 medium white or yellow onion, medium dice", "1 medium garlic clove, finely chopped", "1 tablespoon kosher salt, plus more as needed", "3/4 teaspoon chili powder", "3/4 teaspoon ground cumin", "8 cups (2 quarts) low-sodium chicken broth or stock", "2 medium carrots, large dice", "2 medium Roma tomatoes, cored and large dice", "2 medium zucchini, large dice", "1 teaspoon Mexican-style hot sauce, such as Cholula or Tapatío, plus more as needed", "Coarsely chopped fresh cilantro ", "Tortilla chips or warmed tortillas"], "directions": [ "Using your hands, combine all of the ingredients in a large bowl and place in the refrigerator.", "Heat the oil in a large pot or Dutch oven over medium heat until shimmering. Add the onion, garlic, measured salt, chili powder, and cumin and cook, stirring occasionally, until the onion has softened, about 5 minutes.", "Increase the heat to high, add the broth or stock, stir to combine, and bring to a simmer. Meanwhile, form the meatballs: Fill a small bowl with water. Roll the meat mixture into 1-1/4-inch balls (about 1 heaping tablespoon each), wetting your hands as necessary to keep the mixture from sticking. Place the meatballs on a baking sheet.", "Add the carrots and tomatoes to the broth, stir to combine, and return to a simmer. Add the meatballs, evenly placing them around the pot (no need to stir), and return to a simmer. Reduce the heat to medium low and cover the pot with a tightfitting lid. Cook until the rice and the meatballs are cooked through, about 20 minutes.", "Add the zucchini, stir to combine, and simmer uncovered until the zucchini is crisp-tender, about 5 minutes. Remove from the heat, add the measured hot sauce, and stir to combine. Taste and season with additional salt and hot sauce as needed. Serve with the cilantro, tortilla chips or tortillas, and extra hot sauce on the side."]},
{"description": "A touch of spice and heat gives this glazed pork tenderloin extra flavor.", "title": "Pork Tenderloin with Spicy Apricot Glaze", "url": "http://www.chowhound.com/recipes/pork-tenderloin-with-spicy-apricot-glaze-10503", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/10503_pork_tenderloin_apricot.jpg", "ingredients": ["1 (1-pound) pork tenderloin, trimmed", "1 garlic clove, sliced into 6 thin pieces", "1/2 cup apricot preserves (preferably with whole fruit)", "Juice of 1/2 medium lemon", "1/8 teaspoon red pepper flakes", "1/8 teaspoon cumin", "1 tablespoon olive oil"], "directions": [ "Heat the oven or toaster oven to 400°F. Place the pork tenderloin in a shallow ovenproof dish. Cut 6 (1-inch) slits evenly spaced across the top, insert the garlic pieces, and season well with salt and freshly ground black pepper. Let sit at room temperature for 20 minutes while the oven is heating.", "In a small bowl, mix together the apricot preserves, lemon juice, red pepper flakes, and cumin. Season with salt and freshly ground black pepper. (If the preserves are still thick, add more lemon juice; don’t add too much, though, because the mixture should remain dense, not be runny.) Set aside.", "Coat the tenderloin with olive oil and roast for 20 minutes. Remove from the oven and spread evenly with the apricot mixture. Return the pork to the oven and roast for another 5 to 10 minutes, or until the internal temperature reaches 160°F.", "Remove from the oven and let rest 5 to 10 minutes before slicing and serving."]},
{"description": "This recipe for kettle corn, a favorite sweet-and-salty popcorn treat sold at state fairs and flea markets, is a cinch to make at home.", "title": "Easy Kettle Corn", "url": "http://www.chowhound.com/recipes/easy-kettle-corn-14234", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/14234_easy_kettle-corn.jpg", "ingredients": ["1/3 cup vegetable oil", "3/4 cup popcorn kernels", "1/4 cup granulated sugar", "1/2 teaspoon fine salt"], "directions": [ "Heat the oil over medium heat in a large pot until shimmering. Add the kernels, cover with a tightfitting lid, and shake to evenly distribute. Once the kernels start popping, gently shake the pot until the popping subsides, about 2 to 3 minutes.", "Remove from the heat, immediately sprinkle with the sugar and salt, and toss to combine."]},
{"description": "Grilling brings out corn’s sweet side.", "title": "Basic Grilled Sweet Corn", "url": "http://www.chowhound.com/recipes/basic-grilled-sweet-corn-22585", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/22585_grilled_corn.jpg", "ingredients": ["4 ears fresh sweet corn", "1 tablespoon vegetable oil"], "directions": [ "Heat a gas or charcoal grill to medium (about 350°F). Meanwhile, remove all husks and silk from corn. Drizzle cobs with oil and season on all sides with salt and freshly ground black pepper.", "Grill corn uncovered, turning occasionally, until lightly charred and kernels are tender, about 20 to 30 minutes. Remove from the grill and serve."]},
{"description": "Grilling takes the bitter edge off the radicchio, and the mushrooms add an earthy, meaty quality to this simple side dish.", "title": "Grilled Portobello and Radicchio Salad", "url": "http://www.chowhound.com/recipes/grilled-portobello-and-radicchio-salad-22356", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/22356_mushroom_radiccio.jpg", "ingredients": ["1/4 cup balsamic vinegar", "2 medium garlic cloves, thinly sliced", "1 pound portobello mushrooms, cleaned and sliced into 2-inch-wide strips", "1/4 cup olive oil", "1 medium head radicchio, outer leaves discarded and remaining head sliced lengthwise into six wedges ", "1 tablespoon coarsely chopped Italian parsley"], "directions": [ "Combine vinegar and garlic in a small, nonreactive saucepan and bring to a boil over medium-high heat. Continue to boil until thick, syrupy, and reduced by half, about 2 to 3 minutes; set aside.", "Heat a grill pan or outdoor grill to medium high (about 375°F). Meanwhile, combine mushrooms and 2 tablespoons of the olive oil in a large bowl, season with salt and freshly ground black pepper, and toss to coat. Grill mushrooms until browned and beginning to release some juice (you may need to do this in batches), about 6 minutes, then transfer to a serving dish.", "Combine radicchio and remaining 2 tablespoons olive oil in a large bowl, season with salt and pepper, and toss to coat. Grill radicchio until browned and charred on the edges and beginning to soften, about 4 minutes. Transfer to the serving dish with the mushrooms.", "Drizzle salad with reserved balsamic syrup, sprinkle with parsley, and serve."]},
{"description": "Give Thanksgiving turkey leftovers a second chance with this Thai-inspired noodle recipe made with broccoli, soy sauce, and eggs.", "title": "Turkey Pad See Ew", "url": "http://www.chowhound.com/recipes/turkey-pad-see-ew-11134", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/11134_turkey_pad_see_ew.jpg", "ingredients": ["1 (14-ounce) package dried wide rice noodles", "1 pound Chinese broccoli or broccoli rabe", "5 tablespoons vegetable oil", "6 medium garlic cloves, sliced paper thin", "2 cups thinly sliced cooked turkey", "1/4 cup dark soy sauce", "2 tablespoons light soy sauce", "4 teaspoons granulated sugar", "2 large eggs"], "directions": [ "Place the noodles in a large heatproof bowl and cover with boiling water. Soak until loose and pliable but not soft, about 8 minutes; drain and set aside.", "Bring a large pot of salted water to a boil. Prepare an ice water bath by filling a bowl halfway with ice and water; set aside. Slice the broccoli on the bias into 1-inch-thick pieces and blanch by cooking in the boiling water until the leaves are wilted and the stems just give when pierced with a sharp knife, about 3 minutes. Place in the ice water bath until cold, then drain and set aside.", "Heat 4 tablespoons of the oil in a large frying pan over medium-high heat. When it shimmers, add the garlic and cook until it just begins to color, about 1 minute.", "Add the reserved noodles and broccoli, turkey, soy sauces, and sugar and cook until warmed through, about 3 minutes.", "Push the noodle mixture to one side of the pan and add the remaining 1 tablespoon of oil. Crack the eggs into the oil and scramble briefly until they begin to set, then let cook undisturbed until solid, about 3 minutes. Mix the eggs into the noodles and serve."]},
{"description": "With pickled shallots and a tangerine vinaigrette.", "title": "Chicory, Tangerine, and Pomegranate Salad", "url": "http://www.chowhound.com/recipes/chicory-tangerine-and-pomegranate-salad-11116", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/11116_chicory_tangerine_pomegranate_salad.jpg", "ingredients": ["2 medium shallots, sliced 1/8 inch thick (about 1 cup)", "1/3 cup red wine vinegar", "1 tablespoon granulated sugar", "1 1/2 teaspoons kosher salt, plus more as needed", "2 tablespoons freshly squeezed tangerine juice", "2 teaspoons whole-grain mustard", "1/4 teaspoon freshly ground black pepper, plus more as needed", "2 tablespoons olive oil", "1 pound mixed chicory (such as escarole, radicchio, curly endive, or frisée), washed, dried, and torn into bite-size pieces", "1 cup tangerine segments (from about 4 medium tangerines)", "1/2 cup pomegranate seeds (from 1 small pomegranate)"], "directions": [ "Prepare an ice water bath by filling a bowl halfway with ice and water; set aside. Bring a small saucepan of well-salted water to a boil over high heat. Add the shallots and blanch until tender, about 30 seconds. Drain and place the shallots in the ice water bath until cool. Drain and set aside.", "Combine the vinegar, sugar, and 1 teaspoon of the salt in a small saucepan and bring to a boil over medium heat, stirring until the sugar has dissolved. Pour the boiling liquid over the reserved shallots and pickle until the shallots are slightly wilted and have lost any sharp taste, about 5 minutes.", "Drain the shallots into a strainer set over a large, heatproof salad bowl, collecting any pickling liquid in the bowl; set the shallots aside.", "Whisk the tangerine juice, mustard, remaining 1/2 teaspoon salt, and measured pepper into the pickling liquid. Slowly drizzle in the olive oil while whisking until the vinaigrette is emulsified. Taste and adjust the seasoning as needed.", "Add the chicory and tangerine segments and toss well to combine. Top with the pomegranate seeds and pickled shallots and serve."]},
{"description": "Easy, light, and elegant.", "title": "Port Poached Pears", "url": "http://www.chowhound.com/recipes/port-poached-pears-10780", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["4 cups port wine", "1 cup water", "1/2 cup granulated sugar", "1 vanilla bean, split lengthwise and scraped, seeds and pod reserved", "1 (2-inch) stick cinnamon", "1 teaspoon whole allspice", "1/8 teaspoon kosher salt", "4 firm Bosc or Anjou pears (about 1 pound)"], "directions": [ "Combine all ingredients except pears in a medium saucepan and bring to a boil over high heat, stirring until sugar is completely dissolved. Meanwhile, peel pears, leaving the stems intact. Slice off the bottom 1/8 inch of each pear to create a flat, stable base.", "Reduce heat to keep poaching liquid at a bare simmer and add pears, laying them on their sides so that they are almost completely submerged. Cook, turning pears occasionally so that they become saturated on all sides, until they are just tender when pierced with a fork, about 7 minutes.", "Allow pears to cool completely in the poaching liquid. Serve or transfer pears and liquid to an airtight container and store in the refrigerator for up to 2 days."]},
{"description": "A recipe for fresh, tart applesauce sweetened with apple cider.", "title": "Applesauce", "url": "http://www.chowhound.com/recipes/applesauce-10811", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/10811_applesauce.jpg", "ingredients": ["3 pounds crisp apples (about 6 large), such as Fuji, Winesap, Gala, or Granny Smith", "2 cups apple cider, apple juice, or water", "1 cinnamon stick (optional)", "1/4 cup granulated sugar", "Fine salt", "1 tablespoon freshly squeezed lemon juice"], "directions": [ "For smooth applesauce, core and coarsely chop the apples into 1/2-inch pieces, leaving on the peel. For chunky applesauce, peel, core, and coarsely chop the apples into 1/2-inch pieces. Put the apple chunks in a large, heavy-bottomed saucepan.", "Add the apple cider, juice, or water and the cinnamon stick (if using). Bring to a gentle boil over medium heat.", "Lower the heat to medium low and gently boil for 20 to 30 minutes, stirring occasionally with a wooden spoon and checking to make sure the apples are not scorching.", "When the apples are extremely tender and can be broken down to a chunky sauce with vigorous stirring, remove from the heat. Remove the cinnamon stick (if used). Let cool for a few minutes, then add the sugar, a large pinch of salt, and the lemon juice.", "For smooth applesauce, let the apples cool to room temperature. Using a food mill fitted with a medium disk, pass the apple mixture through the mill to form a smooth purée. For chunky sauce, beat the apples with a wooden spoon until the desired consistency is reached. Let cool."]},
{"description": "Straightforward yet versatile, this dressing brightens up a simple green salad or works well atop a piece of steamed fish.", "title": "Lemon and Parsley Dressing", "url": "http://www.chowhound.com/recipes/lemon-and-parsley-dressing-10088", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["Juice of 2 lemons", "5 tablespoons olive oil", "3 tablespoons finely chopped Italian parsley", "Sea salt and black pepper"], "directions": [ "Whisk the oil and lemon juice together. Add the parsley and season."]},
{"description": "An Indian recipe for Spinach Dhal", "title": "Spinach Dhal", "url": "http://www.chowhound.com/recipes/spinach-dhal-10100", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["8 ounces red lentils, rinsed and drained", "4 cups water", "1/4 teaspoon ground turmeric", "1 teaspoon finely grated fresh ginger root", "3 1/2 ounces baby spinach leaves, chopped", "Large handful of fresh cilantro leaves, chopped", "2 teaspoons light olive oil", "5 garlic cloves, finely sliced", "2 teaspoons cumin seeds", "2 teaspoons mustard seeds", "1 tablespoon ground cumin", "1 teaspoon ground coriander", "1 red chile, finely chopped", "Sea salt"], "directions": [ "Place the lentils in a large saucepan with the water, turmeric, and ginger. Bring to a boil. Skim off any foam that forms on the surface.", "Lower the heat and cook gently for 20 minutes, stirring occasionally. Add the spinach and chopped cilantro, stir, and cook for 8-10 minutes.", "Heat the oil in a small, nonstick frying pan and when it is hot add the garlic, cumin and mustard seeds, ground cumin, ground coriander, and red chile. Stir-fry over high heat for 2-3 minutes, then pour this mixture into the lentils. Stir to mix well, season, and serve immediately with rice or naan bread."]},
{"description": "With a sweet-hot sauce made from wasabi and honey.", "title": "Tuna Tartare with Avocado and Crispy Shallots", "url": "http://www.chowhound.com/recipes/tuna-tartare-with-avocado-and-crispy-shallots-10980", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/10980_tuna_tartare_avocado.jpg", "ingredients": ["Vegetable oil, for frying", "2 tablespoons all-purpose flour", "3 tablespoons coarsely chopped shallots", "1 tablespoon wasabi powder", "2 tablespoons cold water", "2 tablespoons white mirin", "3 tablespoons reduced-sodium (light) soy sauce", "1 teaspoon dry mustard powder", "2 tablespoons rice wine vinegar", "1 teaspoon honey", "2 medium Hass avocados, small dice", "3 tablespoons olive oil", "1 pound very fresh, high-quality tuna, cut into small dice and kept in the refrigerator"], "directions": [ "Pour oil into a small saucepan to a depth of about 1 inch and bring to 350°F over medium-high heat. Place flour in a small bowl and add shallots; toss to combine. Remove shallots from flour, shaking off excess, and add to hot oil.", "Fry until golden brown, about 3 to 5 minutes. Remove shallots with a slotted spoon and set on a paper towel – lined plate to drain. Season immediately with salt, and set aside while you make the tartare.", "In a medium bowl, whisk wasabi powder and water together until a paste has formed. Whisk in mirin, soy sauce, mustard powder, vinegar, and honey, and season well with freshly ground black pepper; set aside.", "Toss avocado with salt and freshly ground black pepper; set aside. Sprinkle olive oil, salt, and pepper over tuna and gently mix.", "To serve, divide avocado evenly among 6 chilled plates and top with tuna. Drizzle wasabi sauce over each serving and top with crispy shallots. Serve immediately."]},
{"description": "A classic chicken preparation with a touch of tang.", "title": "Piccata di Pollo (Chicken Cutlets with Lemon and Caper Sauce)", "url": "http://www.chowhound.com/recipes/piccata-di-pollo-chicken-cutlets-with-lemon-and-caper-sauce-10495", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["4 tablespoons unsalted butter", "2 tablespoons olive oil", "4 (3-ounce) chicken cutlets", "Flour for dredging chicken", "1/4 cup dry white vermouth", "1/4 cup chicken stock or low-sodium chicken broth", "1 lemon, thinly sliced and seeded", "2 tablespoons drained capers", "Chopped Italian parsley, for garnish"], "directions": [ "Heat 2 tablespoons each butter and olive oil in a large skillet until shimmering hot. Meanwhile, season four 3-ounce chicken cutlets with salt and pepper, then dust with flour, shaking off any excess.", "Brown the chicken on both sides, 1 to 2 minutes per side. Transfer to a plate. Pour off any fat, add 1/4 cup dry white vermouth to the pan, and deglaze, scraping up any browned bits. Add 1/4 cup chicken stock and cook until syrupy.", "Add 1 thinly sliced, seeded lemon and 2 tablespoons drained capers and cook for a few minutes, until the sauce has thickened slightly.", "Season to taste with pepper and a bit of salt (capers are salty), then swirl in 2 tablespoons unsalted butter and sprinkle with chopped Italian parsley. Return the chicken to the pan for 1 to 2 minutes to reheat, then serve immediately."]},
{"description": "Currants dress up this versatile side dish.", "title": "Campfire Couscous with Zucchini and Pine Nuts", "url": "http://www.chowhound.com/recipes/campfire-couscous-with-zucchini-and-pine-nuts-10943", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/11-10-14/10943_couscous_pine_nuts.jpg", "ingredients": ["4 tablespoons vegetable oil", "1 medium garlic clove, thinly sliced", "Chef’s Salt and Pepper Mix", "3 cups dry Israeli couscous", "4 1/2 cups water", "1 fresh thyme sprig", "2 medium zucchini, seeded and cut into small dice (about 1/2 cup)", "1/4 cup toasted pine nuts", "3 tablespoons Zante currants"], "directions": [ "Heat 2 tablespoons of the vegetable oil in a medium saucepan placed on a camping stove set to medium heat. When the oil shimmers, add garlic and season well with several pinches of salt and pepper mix. Cook, stirring occasionally, until garlic is softened but not browned.", "Add couscous and stir to coat with oil. Cook, stirring frequently, until couscous is golden brown and toasted, about 5 minutes.", "Add water and thyme sprig and bring to a simmer. Cover the pan and reduce heat to medium low; simmer until couscous is tender and water is absorbed, about 8 minutes. Remove from heat and stir in zucchini; return the lid to the pan. Allow to sit 5 minutes or until zucchini is tender.", "Stir in pine nuts, currants, and remaining 2 tablespoons oil. Taste couscous and, if necessary, season with more salt and pepper mix."]},
{"description": "A refreshing mix of crunchy cucumber and watermelon, tomato, and a little mint and ricotta salata cheese.", "title": "Watermelon, Tomato, and Kalamata Olive Salad", "url": "http://www.chowhound.com/recipes/watermelon-tomato-and-kalamata-olive-salad-10989", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/10989_watermelon_tomato_olive_salad.jpg", "ingredients": ["3 cups large-dice seedless watermelon (about 1 pound)", "1 medium English cucumber, peeled, seeded, and cut into medium dice", "1 medium beefsteak tomato, seeded and cut into medium dice", "2 teaspoons kosher salt", "1/4 cup kalamata olives, pitted and halved", "1 packed tablespoon thinly sliced fresh mint leaves", "2 teaspoons extra-virgin olive oil", "1 teaspoon balsamic vinegar", "Freshly ground black pepper", "1 ounce ricotta salata, thinly sliced"], "directions": [ "Combine the watermelon, cucumber, and tomato in a large bowl. Sprinkle with the salt and gently toss to combine. Transfer to a colander and let drain for at least 10 minutes.", "Transfer drained mixture to a large bowl and combine with the olives, mint, oil, and vinegar. Season with a generous amount of pepper. Sprinkle the cheese over the top and serve."]},
{"description": "The sweet, bitter combination of the apple and endive makes this a versatile side salad.", "title": "Endive-Apple Salad", "url": "http://www.chowhound.com/recipes/endive-apple-salad-21784", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["2 tablespoons pine nuts", "2 tablespoons extra-virgin olive oil", "2 teaspoons sherry vinegar", "Sea salt and freshly ground black pepper", "2 small heads endive", "1 small, tart green apple", "1 tablespoon finely chopped fresh chives"], "directions": [ "In a small, dry pan, toast the pine nuts over medium heat until lightly browned, about 3 minutes. Be careful not to overcook; pine nuts burn easily. Immediately pour the nuts onto a saucer to cool.", "In a medium bowl, whisk together the olive oil, vinegar, and salt and pepper to taste. Cut the endive crosswise into thin slices and toss them with the dressing. Quarter and core the apple. Slice the quarters thinly crosswise, and then cut the slices into matchsticks. Toss these with the endive. Add the pine nuts and chives, toss well, and taste for seasoning. Toss again just before serving."]},
{"description": "This grilled sweet potatoes recipe is an easy way to make tasty sweet potato wedges on the grill.", "title": "Grilled Sweet Potatoes", "url": "http://www.chowhound.com/recipes/grilled-sweet-potatoes-with-sour-cream-and-lime-29875", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29875_grilled_sweet_potatoes.jpg", "ingredients": ["2 pounds medium sweet potatoes, scrubbed", "2 tablespoons vegetable oil, plus more for oiling the grill", "1/2 teaspoon ground cumin", "2 pinches cayenne pepper", "2/3 cup sour cream", "Finely grated zest of 2 medium limes (about 2 teaspoons)", "1 teaspoon freshly squeezed lime juice", "Kosher salt", "Freshly ground black pepper", "2 tablespoons coarsely chopped fresh cilantro"], "directions": [ "Place the sweet potatoes in a large pot of heavily salted water and bring to a boil over high heat. Reduce the heat to medium and simmer until a paring knife can easily be inserted, about 20 to 30 minutes.", "Drain the sweet potatoes in a colander in the sink and let cool slightly, about 10 minutes. Transfer to a baking sheet or large plate and arrange in a single layer. Refrigerate until cool, at least 1 hour.", "Meanwhile, heat the oil in a small frying pan over medium heat until shimmering. Remove the pan from heat, add the cumin and cayenne, and stir to combine. Set aside to cool.", "Combine the sour cream, lime zest, and lime juice in a small bowl. Taste and season with salt and pepper as needed; refrigerate until ready to use.", "When the sweet potatoes are ready, heat a grill pan or outdoor grill to medium high (about 375°F to 425°F). Meanwhile, halve the sweet potatoes lengthwise. Cut the halves lengthwise into 1/2- to 3/4-inch-thick wedges and place in a single layer on a baking sheet.", "Stir the oil mixture to reincorporate the spices. Brush the cut sides of the potato wedges with the oil mixture and season generously with salt and pepper.", "When the grill is hot, rub the grates with a towel dipped in vegetable oil. Place the sweet potato wedges on the grill in a single layer and cut-side down, cover the grill, and cook until grill marks appear, about 2 to 3 minutes. Flip the wedges to the other cut side, cover the grill, and cook until grill marks appear, about 2 to 3 minutes more. Transfer to a serving platter, dollop with the sour cream mixture, and sprinkle with the cilantro. Serve immediately."]},
{"description": "Asparagus pairs well with the fresh, clean flavor of cilantro.", "title": "Asparagus and Cilantro Soup", "url": "http://www.chowhound.com/recipes/asparagus-and-cilantro-soup-10177", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["1 tablespoon olive oil", "1 large onion, coarsely chopped", "3 stalks celery, coarsely chopped", "3 cloves garlic, chopped", "1 small russet potato, peeled and coarsely chopped", "1 tablespoon chopped fresh basil", "2 teaspoons chopped fresh oregano", "1 teaspoon ground cumin", "6 cups vegetable stock or water", "2 pounds asparagus, trimmed, tips reserved and stalks cut crosswise into 1-inch pieces", "1 tablespoon tamari", "2 teaspoons sea salt", "1/8 teaspoon freshly ground white pepper", "1/2 cup finely chopped fresh cilantro"], "directions": [ "Heat the olive oil in a heavy stockpot over medium heat. Add the onion, celery, and garlic, and sauté for 8 minutes, or until the onion is translucent. Stir in the potato, basil, oregano, and cumin. Add the stock and bring to a simmer over high heat. Decrease the heat to medium low, cover, and simmer, stirring occasionally, for 10 minutes, or until the potato is almost tender. Add the asparagus stalks and simmer for 5 minutes, or until the asparagus is tender and the potato is very tender.", "Using a hand-held immersion blender, purée the soup in the pot until smooth. Alternatively, working in batches, purée in a regular blender until smooth. Stir in the tamari, salt, and white pepper. Return the soup to a simmer, then stir in the cilantro.", "Meanwhile, cook the reserved asparagus tips in a saucepan of boiling water for 1 minute, or until crisp-tender. Drain, then cut the asparagus tips in half lengthwise.", "Ladle the soup into individual bowls. Garnish with the asparagus tips and serve."]},
{"description": "More than just fish sauce.", "title": "Vietnamese Dipping Sauce", "url": "http://www.chowhound.com/recipes/vietnamese-dipping-sauce-26078", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/s/recipe_placeholder_main_img-710dbe7756144f55f01c42cc4892e6de.jpg", "ingredients": ["2 tablespoons Prawn Brand Fish Sauce ", "2 tablespoons lime juice", "1 tablespoon distilled white vinegar", "2 tablespoons granulated sugar", "1 teaspoon sambal oelek"], "directions": []},
{"description": "A healthy sautéed broccoli rabe recipe.", "title": "Sautéed Broccoli Rabe", "url": "http://www.chowhound.com/recipes/sauteed-broccoli-rabe-10849", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/12/10849_sauteed_broccoli_rabe.jpg", "ingredients": ["1 pound broccoli rabe, ends trimmed and sliced into 2-inch pieces", "1 tablespoon olive oil", "2 medium shallots, thinly sliced", "1/4 teaspoon red pepper flakes", "Salt", "Freshly ground black pepper"], "directions": [ "Prepare an ice water bath by filling a bowl halfway with ice and water; set aside. Fill a large pot with heavily salted water and bring to a boil over high heat. Cook the broccoli rabe until the stalks are just tender when pierced with a knife, about 2 minutes.", "Drain the broccoli rabe and place in the ice water bath until cool.", " Remove, shake off excess water, pat dry with paper towels, and set aside. (If not cooking immediately, store in the refrigerator in a resealable plastic bag lined with paper towels for up to 1 day.)", "Place a large frying pan over medium-high heat and add the oil. When it shimmers, add the shallots and cook until golden, about 3 minutes. ", "Add the red pepper flakes and season with salt and pepper. Add the reserved broccoli rabe and cook, stirring occasionally, until heated through, about 5 minutes. Taste, adjust the seasoning as needed, and serve. "]},
{"description": "An easy pickled eggplant recipe.", "title": "Pickled Eggplant", "url": "http://www.chowhound.com/recipes/pickled-eggplant-27948", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2015/12/27948_pickled_eggplant.jpg", "ingredients": ["5 cups peeled, medium-dice eggplant (about 1 pound)", "1 tablespoon kosher salt", "1 cup white wine vinegar", "1 teaspoon red pepper flakes", "1 1/4 cups extra-virgin olive oil", "3/4 cup small-dice red bell pepper (about 1 medium pepper)", "6 medium garlic cloves, minced", "1 tablespoon dried oregano"], "directions": [ "Combine the eggplant and salt in a large bowl.", " Nest another bowl on top of the eggplant and weigh it down with a few canned goods (beans or tomatoes work well); set aside for 1 hour.", "Transfer eggplant to a fine mesh strainer and rinse off the salt under cold running water while tossing the eggplant with your hands. ", "Press out any excess water, spread the eggplant in a single layer on a baking sheet, and pat dry with paper towels.", "Combine vinegar and red pepper flakes in a medium saucepan and bring to a boil over medium-high heat. Add eggplant and simmer for 2 minutes.", " Remove from heat and let eggplant stand in vinegar for 10 minutes.", "Add remaining ingredients and stir to combine.", " Transfer to a 1-quart container with a tightfitting lid.", " Let cool to room temperature, cover, and refrigerate at least 3 days before serving."]},
{"description": "An elegant pear and feta bites appetizer recipe.", "title": "Pear and Feta Bites ", "url": "http://www.chowhound.com/recipes/pear-and-feta-bites-27547", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/27547_pear_feta_bites.jpg", "ingredients": ["3 medium heads endive", "3/4 cup small-dice feta cheese", "2 cups small-dice pear", "1 1/2 teaspoons lemon juice", "1 tablespoon olive oil", "3/4 teaspoon ground coriander", "Salt", "Freshly ground black pepper"], "directions": [ "Trim the ends off the heads of endive and remove the leaves (you will need 30 to 40 leaves); set aside.", "Gently toss the feta, pear, lemon juice, olive oil, and coriander in a medium bowl until evenly coated. Season with salt and pepper and toss to coat well.", "Place 1 tablespoon of the cheese-pear mixture in each endive leaf and serve immediately."]},
{"description": "An easy-to-follow canning recipe for blueberry jam.", "title": "Fragrant Blueberry Jam", "url": "http://www.chowhound.com/recipes/fragrant-blueberry-jam-11050", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2013/08/11050_RecipeImage_620x413_blueberry_jam.jpg", "ingredients": ["3 cups blueberries (about 1 pound)", "2 cups granulated sugar", "1 tablespoon finely grated apple peel ", "4 teaspoons bottled lemon juice"], "directions": [ "Wash the jars, lids, and bands in hot, soapy water. Rinse well. Dry the lids and bands and set them aside.", "Place the jars in a boiling water canner or a 15- to 20-quart pot fitted with a canning rack and a lid. Fill the pot with water and bring it to a boil over medium-high heat. Boil for 10 minutes, then turn off the heat.", "Keep the jars in the hot water until you’re ready to use them.", "Place a plate in the freezer to chill for testing the jam. Place the blueberries in a large, heavy-bottomed saucepan and crush them with the back of a wooden spoon until some of the berries are broken up and they start to release their juice.", "Add the sugar and apple peel and stir to combine. Bring to a boil over medium-high heat. Boil vigorously, stirring frequently, until the jam reaches its setting point, about 15 minutes. (Bubbles will rise to the surface of the pan; if they get too high, just stir the jam until they decrease.)", "Once the jam reaches 228°F, start checking if it’s properly set. Conduct the plate test: Put a spoonful of jam on the chilled plate and place it in the freezer until the jam reaches room temperature, about 1 minute. Draw your finger through the jam. If it immediately runs back together, it’s not ready. Once the jam is ready, remove it from the heat and stir in the lemon juice.", "Remove the jars from the hot water with a jar lifter, letting any excess water drip off. Bring the water in the canner back to a simmer (about 180°F) for processing the packed jars. Fill the sterilized jars with jam, leaving a 1/4-inch headspace. (If you have a half-full jar, place it in the refrigerator and eat the jam within 5 days.)", "To remove any air bubbles, slide a clean rubber spatula down the side of each jar and press inward on the jam while rotating the jar; repeat 2 to 3 times for each jar.", "Wipe the rim and threads of each jar with a clean, damp towel. Place the lids on the jars, checking that the sealing compound is centered. Fit the jars with bands and tighten just until resistance is met.", "Check that the water in the pot or boiling water canner is at a simmer (about 180°F), then set the jars in the canning rack. (The jars must be covered by 1 to 2 inches of water. Add additional boiling water as necessary.)", "Cover the pot with a tightfitting lid and bring it to a rolling boil over medium-high heat. Process the jars for 10 minutes at a gentle but steady rolling boil. (Begin calculating the processing time once the water is at a rolling boil. Check occasionally that the water remains at a steady boil.)", "Once processed, remove the jars with the jar lifter and set them upright, 1 to 2 inches apart, on a dry towel. Do not retighten the bands; let the jars cool at least 12 hours.", "After the jars have cooled, check for a seal by pressing the center of each lid. If the center is concave and does not flex, remove the band and try to lift off the lid with your fingertips (don’t pull too hard). If you can’t lift the lid, there is a good vacuum seal. If the lid pops off, your jar did not properly seal. Eat the jam within 2 months.", "To store properly processed jars, wipe each lid and jar with a clean, damp cloth (the bands don’t need to stay on for storage), label the jars, and store them in a cool, dry, dark place. Unopened jars can be kept up to a year when stored properly. Once opened, keep in the refrigerator and use within 2 months."]},
{"description": "Make this fast and easy spicy turkey chili recipe as a lighter alternative to beef chili. Using chili powder, cayenne pepper, and ground cinnamon, this recipe...", "title": "Easy Spicy Turkey Chili", "url": "http://www.chowhound.com/recipes/easy-spicy-turkey-chili-30668", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2014/09/30668_easy_spicy_turkey_chili_3000.jpg", "ingredients": ["2 tablespoons vegetable oil", "1 medium red bell pepper, medium dice", "1 medium yellow onion, medium dice", "2 medium garlic cloves, coarsely chopped", "1 pound ground turkey", "3 tablespoons chili powder", "2 teaspoons kosher salt, plus more as needed", "1/2 teaspoon dried oregano", "1/2 teaspoon ground cumin", "1/8 teaspoon cayenne pepper", "1/8 teaspoon ground cinnamon", "1 (28-ounce) can diced tomatoes", "1 cup low-sodium chicken broth or stock", "2 (14-ounce) cans cannellini beans, drained and rinsed", "1 bay leaf", "Shredded cheddar cheese", "Sour cream", "Tortilla chips"], "directions": [ "Heat the oil in a large pot or Dutch oven over medium heat until shimmering. Add the bell pepper, onion, and garlic, season with salt, and cook, stirring occasionally, until the vegetables have softened, about 5 to 8 minutes.", "Increase the heat to medium high, add the turkey, and cook, breaking it up into smaller pieces with a wooden spoon, until it’s no longer pink and is just cooked through, about 4 to 6 minutes.", "Add the chili powder, measured salt, oregano, cumin, cayenne, and cinnamon, stir to coat the turkey and vegetables, and cook until fragrant, about 1 minute.", "Add the tomatoes and their juices as well as the broth or stock, stir to combine, and bring to a simmer. Add the beans and return to a simmer. Reduce the heat to medium low, add the bay leaf, and simmer, stirring occasionally, until the flavors meld, about 30 minutes.", "Remove the bay leaf. Taste and season with additional salt as needed. Serve with the cheese, sour cream, and chips, for topping."]},
{"description": "A weeknight chicken dinner takes an unexpected turn with pomegranate seeds and maple syrup.", "title": "Poached Chicken and Pomegranate Orzo ", "url": "http://www.chowhound.com/recipes/poached-chicken-and-pomegranate-orzo-27640", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/27640_pomegranate_chicken_orzo.jpg", "ingredients": ["1 tablespoon olive oil", "1/2 cup small-dice red onion", "3 garlic cloves, finely chopped", "2 teaspoons ground coriander", "Kosher salt", "Freshly ground black pepper", "2 cups water", "2 boneless, skinless chicken breasts", "1 cup orzo", "2 teaspoons maple syrup", "4 teaspoons white wine vinegar", "1/4 cup finely chopped fresh cilantro", "1 cup fresh pomegranate seeds"], "directions": [ "Heat the olive oil a medium frying pan over medium heat. When it shimmers, add the onion, garlic, and coriander, then season with salt and pepper to taste. Cook until the vegetables are softened, about 3 minutes.", "Add the water and chicken, reduce the heat to medium low, cover, and simmer, turning the chicken once, until the chicken is cooked through, about 25 minutes. Remove the chicken to a cutting board and set aside until cool enough to handle, then shred into bite-sized pieces.", "Meanwhile, add the orzo to the poaching liquid and simmer, stirring occasionally, until the pasta is al dente and all the liquid has been absorbed, about 10 to 15 minutes. Remove the orzo to a large, nonreactive bowl and stir in the maple syrup, vinegar, cilantro, pomegranate seeds, and shredded chicken. Season with salt and pepper to taste."]},
{"description": "Hail seitan!", "title": "Seitan Piccata", "url": "http://www.chowhound.com/recipes/seitan-piccata-10596", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2006/09/rcp_seitanpiccata_290x210.jpg", "ingredients": ["6 seitan cutlets", "Whole-wheat flour for dredging", "4 tablespoons olive oil", "1/4 cup chopped shallots", "1/4 cup chopped yellow onion", "1/2 teaspoon minced garlic", "2 tablespoons drained capers", "1/2 cup dry white wine", "2 tablespoons fresh lemon juice", "1/2 cup low-sodium vegetable broth", "2 tablespoons soy buttery spread (soy margarine)", "1/2 cup coarsely chopped fresh parsley", "1/2 teaspoon sea salt", "1/4 teaspoon freshly ground pepper"], "directions": [ "Dredge seitan cutlets in whole-wheat flour, shaking off any excess.", "In a sauté pan, heat 2 tablespoons of the olive oil over high heat. When oil is hot, sauté cutlets until crisp and golden brown, about 30 seconds per side. Place each cutlet on an individual plate or arrange them all on a platter.", "Add remaining 2 tablespoons olive oil to the sauté pan and return to high heat. Add shallots, onion, garlic, and capers, and sauté, stirring frequently, until softened, 1 to 2 minutes. Whisk in wine and lemon juice and cook 3 to 5 minutes more.", "Add broth and bring to a boil. Reduce the heat to medium and simmer for about 1 minute to combine flavors. Whisk in soy spread, parsley, salt, and pepper. Pour over seitan cutlets and serve at once."]},
{"description": "Like raspberry sorbet with a boozy kick.", "title": "Frozen Lambic Ice ", "url": "http://www.chowhound.com/recipes/frozen-lambic-ice-14099", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2010/09/14099_lambic_ice.jpg", "ingredients": ["6 tablespoons granulated sugar", "6 tablespoons water", "1 1/2 cups cold raspberry lambic, such as Lindemans"], "directions": [ "Combine sugar and water in a small saucepan over medium heat, stir to mix, and bring to a boil. Reduce heat and simmer until sugar is completely dissolved, about 3 minutes. Remove from heat and let cool in the refrigerator until cold.", "Place lambic and chilled simple syrup in an ice cream maker and freeze according to the manufacturer’s instructions. Transfer to an airtight container and chill in the freezer for at least 8 hours to set."]},
{"description": "A spicy dish that doesn’t mask the fresh flavor of the shrimp.", "title": "Chile-Roasted Shrimp", "url": "http://www.chowhound.com/recipes/chile-roasted-shrimp-28092", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/28092_chile_shrimp.jpg", "ingredients": ["1 pound large head-on shrimp", "1/2 cup plus 2 tablespoons olive oil", "3 red jalapeños, stemmed (not seeded) and thinly sliced", "2 garlic cloves, thinly sliced", "1 tablespoon dried oregano", "1 tablespoon kosher salt", "1 teaspoon freshly ground black pepper", "Juice of 1 lemon", "1 cup shrimp stock or water", "1 tablespoon butter"], "directions": [ "In a large bowl, combine the shrimp with 1/2 cup of the olive oil, jalapeños, garlic, oregano, salt, pepper, and lemon juice and toss well to mix. Cover with plastic wrap and marinate the shrimp at room temperature for 20 minutes, or refrigerate for up to 6 hours.", "Preheat your oven as high as it will go and arrange a rack in the middle. Place a rimmed baking sheet in the oven for at least 10 minutes so that it gets extremely hot. (My favorite pan to use for this is a thin blue steel pan; they are very cheap and conduct heat really well.) Meanwhile, remove the shrimp from the marinade and discard the marinade. Very carefully remove the hot pan from the oven and gently spread the shrimp across it in one layer—a little crowding is OK. Roast the shrimp until they turn bright pink, 5 to 8 minutes, stirring only once. (Opening the oven too many times will allow too much heat to escape.)", "Remove the shrimp from the oven and immediately pour the stock or water over them while still on the baking sheet. Finish with the remaining 2 tablespoons olive oil and butter; toss to coat evenly. (The heat of the baking sheet should cause the liquids to bubble and reduce slightly. If the pan doesn’t seem quite hot enough, you can transfer the liquid to a saucepan and place it over medium-high heat, allowing the sauce to reduce for a minute or two, then toss with the shrimp.)", "Serve the shrimp and sauce with good bread, cold beer, and plenty of napkins."]},
{"description": "A fast one-dish meal flavored with soy sauce, garlic, and ginger.", "title": "Five-Spice Pork Stir-Fry with Sweet Potatoes and Snap Peas", "url": "http://www.chowhound.com/recipes/five-spice-pork-stir-fry-with-sweet-potatoes-and-snap-peas-28061", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/28061_stirfry_snowpea_beef.jpg", "ingredients": ["1/4 cup dry sherry or rice wine", "1/4 cup soy sauce", "1 teaspoon packed dark brown sugar", "2 tablespoons cornstarch", "1 pound boneless pork chops or pork tenderloin, trimmed of fat", "1/2 teaspoon five-spice powder", "3 tablespoons peanut or canola oil", "1 medium sweet potato (about 1 pound), peeled, halved lengthwise, and sliced crosswise into 1/8-inch-thick pieces", "1/2 cup water", "4 ounces baby spinach (about 4 cups), thoroughly washed", "2 cups snap peas, stem ends trimmed", "1 tablespoon minced garlic", "1 tablespoon grated ginger", "4 medium scallions, trimmed and thinly sliced", "Steamed white rice, for serving (optional)"], "directions": [ "Place the sherry or rice wine, 3 tablespoons of the soy sauce, the brown sugar, and 1 tablespoon of the cornstarch in a small bowl and whisk to combine; set aside.", "Slice the pork against the grain into even, paper-thin pieces and place in a large bowl. (It doesn’t matter how wide the slices are as long as they are even in thickness.) Add the remaining 1 tablespoon soy sauce, the remaining 1 tablespoon cornstarch, the five-spice powder, and 1 tablespoon of the oil and toss to evenly coat the pork. Set aside to marinate for 5 to 10 minutes.", "In a large nonstick frying pan with a tightfitting lid, heat the remaining 2 tablespoons oil over medium-high heat. When the oil just begins to smoke, add the pork and cook, stirring rarely, until browned and almost completely cooked through, about 2 minutes. Remove to a plate and set aside.", "Reduce the heat to medium and add the sweet potato and water to the pan. Cover and cook until the sweet potato is knife tender, about 3 to 5 minutes. Add the spinach, cover, and cook until it just begins to wilt, about 30 seconds.", "Remove the cover, increase the heat to high, add the snap peas, garlic, and ginger, and cook, stirring occasionally, until the snap peas are bright green, about 2 minutes. Whisk the reserved soy sauce mixture again until evenly combined and add it to the pan along with the reserved pork and any accumulated juices. Cook, stirring continuously, until the sauce has thickened and the pork is cooked through, about 30 seconds. Sprinkle with the scallions, stir, and serve immediately, with rice if desired."]},
{"description": "A not-too-sweet Chinese classic made with mango, gelatin, and cream.", "title": "Mango Pudding", "url": "http://www.chowhound.com/recipes/mango-pudding-28066", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/28066_mango_pudding.jpg", "ingredients": ["2 1/2 cups cold water", "1 1/4 cups granulated sugar", "1 pound frozen mango chunks", "2 (1/4-ounce) packets unflavored gelatin", "1/2 teaspoon kosher salt", "1 cup heavy cream, chilled", "1 teaspoon freshly squeezed lime juice"], "directions": [ "Place 8 (6-ounce) ramekins on a baking sheet; set aside.", "Place 3/4 cup of the water and 1/2 cup of the sugar in a small saucepan over high heat. Stir until sugar is dissolved and mixture is boiling, about 3 minutes. Remove from heat.", "Place mango in a blender, pour in sugar mixture, and blend on medium-high until very smooth, about 1 minute. Pour through a fine mesh strainer set over a medium bowl and, using a rubber spatula, work the mixture through the strainer, discarding any pulp or stringy fibers. Measure 2 cups of the purée (reserve any extra purée for another use); set aside.", "Place 1 1/4 cups of the remaining water in a small saucepan over high heat and bring to a boil.", "Meanwhile, place the remaining 3/4 cup sugar, gelatin, and salt in a large mixing bowl, add remaining 1/2 cup water, and whisk to incorporate, about 30 seconds. Add boiling water and whisk until gelatin and sugar are dissolved, about 1 minute.", "Add the 2 cups of mango purée, cream, and lime juice and whisk until evenly combined. Divide the mixture evenly among the ramekins and refrigerate until set, at least 2 hours."]},
{"description": "A homemade energy bar with dates, figs, almonds, and brown rice cereal.", "title": "Figgy Fuel Bar", "url": "http://www.chowhound.com/recipes/figgy-fuel-bar-28752", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/28752_figgy_fuel_bar.jpg", "ingredients": ["2 cups slivered almonds", "1 cup dried black Mission figs (about 6 ounces), stemmed and halved", "2 1/2 cups dried Medjool dates (about 1 pound), pitted", "3 tablespoons natural smooth unsalted almond butter", "1 teaspoon finely grated orange zest (from about 1 medium orange)", "1 teaspoon vanilla extract", "1/2 teaspoon ground cinnamon", "1/2 teaspoon fine salt", "1/4 teaspoon finely ground black pepper", "1 cup crispy brown rice cereal"], "directions": [ "Heat the oven to 350°F and arrange a rack in the middle. Place an 8-by-18-inch piece of waxed or parchment paper in an 8-by-8-inch baking pan; set aside.", "Place almonds on a rimmed baking sheet in a single layer and bake, stirring halfway through, until fragrant and light golden brown, about 10 minutes. Transfer to a wire rack to cool completely.", "Place figs in the bowl of a food processor fitted with a blade attachment and process until finely chopped, about 1 minute. Transfer to a small bowl.", "Place cooled almonds in the food processor and pulse until finely chopped and the texture of fine meal, about 25 (1-second) pulses. Add dates and process, stopping to scrape down the sides as needed, until dates and almonds are combined and dates are finely chopped, about 45 seconds. Add almond butter, orange zest, vanilla, cinnamon, salt, pepper, and reserved chopped figs and process until evenly combined, stopping to scrape down the sides as needed, about 45 seconds. Transfer mixture to a large bowl. Add rice cereal.", "Using your hands, knead the cereal into the fig-date-almond mixture until evenly incorporated, about 3 minutes. (The cereal will break up as you mix it.)", "Transfer mixture to the prepared baking pan and, using your hands, pat it into an even layer to the edges of the pan. Fold the waxed or parchment paper over and press down on it with the bottom of a measuring cup or a flat-bottomed cup until the mixture is firmly packed and the top is smooth. Freeze for 30 minutes or refrigerate overnight.", "Lift the paper and the energy bar slab out of the pan and place on a cutting board. Remove and discard the paper. Cut the slab into 4 squares, then cut each square into 4 (4-by-1-inch) bars to form 16 bars total. Wrap each bar in plastic wrap. Store at room temperature for up to 5 days or freeze for up to 3 weeks; let frozen bars come to room temperature before eating."]},
{"description": "A simple bok choy recipe for a healthy vegetable side dish.You will need garlic, ginger, red pepper flakes, and toasted sesame oil.", "title": "Sautéed Bok Choy", "url": "http://www.chowhound.com/recipes/sauteed-bok-choy-28071", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2014/09/28071_sauteed_bok_choy.jpg", "ingredients": ["2 tablespoons vegetable oil", "2 medium garlic cloves, minced", "1 teaspoon freshly grated ginger (from 1/2-inch piece)", "1/4 teaspoon red pepper flakes", "1 1/2 pounds bok choy (about 2 medium bunches), cleaned, ends trimmed, and cut on the bias into 1-inch pieces", "1 tablespoon soy sauce", "1 tablespoon water", "1/4 teaspoon toasted sesame oil", "Salt (optional)"], "directions": [ "In a large frying pan with a tightfitting lid, heat the vegetable oil over medium-high heat until shimmering. Add the garlic, ginger, and red pepper flakes and cook, stirring constantly, until fragrant but not brown, about 30 seconds.", "Add the bok choy and, using tongs, fold it into the garlic-ginger mixture until coated, about 1 minute. Add the soy sauce and water, cover, and cook until steam accumulates, about 1 minute. Uncover and cook, stirring occasionally, until the greens are just wilted, the stalks are just fork tender but still crisp, and most of the water has evaporated, about 2 minutes.", "Turn off the heat, stir in the sesame oil, and season with salt if desired."]},
{"description": "Add some zing to your morning with granola and sour cherries in bar form.", "title": "Cherry Power Bar", "url": "http://www.chowhound.com/recipes/cherry-power-bar-28749", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/28749_cherry_power_bar.jpg", "ingredients": ["1 tablespoon unsalted butter, plus more for coating the pan", "2 cups rolled oats (not instant)", "1/2 cup raw sliced almonds", "1/2 cup raw walnut halves, finely chopped", "1/4 cup raw wheat germ", "2 tablespoons unsweetened, untoasted, dried coconut flakes", "2 tablespoons flax seed meal", "1/4 cup honey", "3 tablespoons packed dark brown sugar", "1 teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1/4 plus 1/8 teaspoon fine salt", "3/4 cup dried, pitted cherries (about 4 ounces), finely chopped"], "directions": [ "Heat the oven to 350°F and arrange a rack in the middle. Coat an 8-by-8-inch baking pan with butter; set aside.", "Place oats, almonds, walnuts, wheat germ, coconut, and flax seed meal on a rimmed baking sheet, toss with your hands to combine, and spread in an even layer. Bake, stirring halfway through, until walnuts are light golden brown, about 12 minutes. Transfer to a wire rack. Reduce the oven temperature to 300°F.", "Place honey, brown sugar, measured butter, cinnamon, vanilla, and salt in a medium saucepan over medium-low heat and stir until mixture is smooth and combined and brown sugar has dissolved. Remove from heat and immediately add oat-nut mixture and cherries to the saucepan, stirring until combined. Transfer to the prepared baking pan, spreading the mixture evenly with a spoon.", "When the mixture is cool enough to handle but is still warm, dip your hands in water to prevent sticking and press the mixture evenly and firmly into the pan. Bake until aromatic, about 10 minutes. Place the pan on a wire rack to cool completely.", "Remove the granola slab from the pan. Cut it in half to form two rectangles, then cut each rectangle widthwise into 5 bars to form 10 bars total. Wrap each bar in plastic wrap. Store at room temperature for up to 3 days or freeze for up to 3 weeks; let frozen bars come to room temperature before eating."]},
{"description": "This snack bar loaded with brown rice, rolled oats, wheat germ, and almonds is like a healthy candy bar.", "title": "Chocolate Victory Bar", "url": "http://www.chowhound.com/recipes/chocolate-victory-bar-28750", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/28750_chocolate_victory_bar.jpg", "ingredients": ["Oil, for coating the pan", "1 1/2 cups crispy brown rice cereal", "1 cup rolled oats (not instant)", "1/2 cup raw sliced almonds", "1/4 cup raw wheat germ", "2 tablespoons unsweetened, untoasted, dried coconut flakes", "2 tablespoons flax seed meal", "1/2 cup brown rice syrup", "3 tablespoons natural smooth unsalted peanut butter", "1 tablespoon packed dark brown sugar", "1 teaspoon vanilla extract", "1/2 teaspoon ground cinnamon", "1/4 plus 1/8 teaspoon fine salt", "1/3 cup bittersweet or semisweet chocolate chips"], "directions": [ "Heat the oven to 350°F and arrange a rack in the middle. Coat an 8-by-8-inch baking pan with butter; set aside.", "Place rice cereal, oats, almonds, wheat germ, coconut, and flax seed meal on a rimmed baking sheet, toss with your hands to combine, and spread in an even layer. Bake, stirring halfway through, until almonds are light golden brown, about 12 minutes. Transfer to a wire rack.", "Place rice syrup, peanut butter, brown sugar, vanilla, cinnamon, and salt in a medium saucepan over medium-low heat. Stir until mixture is combined and brown sugar has dissolved. Remove from heat, immediately add cereal mixture, and stir until combined. Transfer mixture to the prepared baking pan and, using a spoon, spread it evenly, pushing it into the corners.", "When the mixture is cool enough to handle but is still warm, evenly and firmly press it into the pan with your hands. Sprinkle with chocolate chips and place in the oven. Bake until the chips start to melt, about 2 to 3 minutes. Remove from the oven and, using a table knife or offset spatula, spread the chocolate into an even layer. Cool the pan on a wire rack for 10 minutes, then place it in the refrigerator until the chocolate is set, about 30 minutes.", "Remove the nutty oat slab from the pan (you may need to run a knife around the perimeter to loosen it). Cut it in half to form two rectangles, then cut each rectangle widthwise into 5 bars to form 10 bars total. Wrap each bar in plastic wrap. Store at room temperature for up to 3 days or freeze for up to 3 weeks; let frozen bars come to room temperature before eating."]},
{"description": "This sweet-tart honey and apricot fruit leather recipe is an easy-to-make snack.", "title": "Honey and Apricot Fruit Leather", "url": "http://www.chowhound.com/recipes/honey-and-apricot-fruit-leather-29918", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2011/08/29918_honey_apricot_fruit_620.jpg", "ingredients": ["1 1/2 pounds ripe apricots, pitted and quartered", "1/3 cup honey", "Pinch fine salt"], "directions": [ "Heat the oven to 170°F and arrange a rack in the middle. Line a rimmed baking sheet with a silicone baking mat and place on a flat work surface; set aside.", "Place all of the ingredients in a blender and blend until you’ve got a very smooth purée, about 1 minute. Transfer the mixture to a medium saucepan.", "Place the saucepan over medium heat and cook, stirring occasionally with a rubber spatula, until the mixture starts to bubble around the edges. Reduce the heat to medium low and simmer, stirring occasionally, until the mixture thickens slightly and reduces to about 1 3/4 to 2 cups, about 10 to 15 minutes. Transfer to a heatproof container with a spout or return to the cleaned, dried blender pitcher.", "Slowly pour the mixture onto the baking mat, tracing the inside of the colored border to create a rectangle. (If your baking mat has no border, leave a 1-inch border from the edge.) ", "Pour the remaining mixture within the borders of the rectangle in a zigzag pattern (do not pour it all into the middle of the baking mat). ", " Using the rubber spatula, push the mixture to cover any empty parts within the rectangle (the surface will not be even). ", "Keeping the baking sheet on the work surface, grasp the edges of the sheet—pressing against the exposed border of the baking mat with your thumbs—and gently shake back and forth to even out the surface of the mixture, rotating the baking sheet and shaking as necessary. ", "Place in the oven and bake until the surface of the fruit leather is slightly sticky to the touch but, when pressed in several different places, a finger does not leave an indentation, about 6 to 7 hours. Remove the baking sheet from the oven, place on a wire rack, and let cool completely.", "Set aside a 16-inch-long sheet of waxed or parchment paper. Starting at one short edge of the cooled fruit leather, pull it up from the baking mat and transfer it to the paper. Using clean kitchen scissors, cut through the fruit leather and paper to form desired-sized strips, shapes, or pieces and roll up, paper and all (to prevent sticking). Store in an airtight container for up to 3 weeks."]},
{"description": "Cocoa plus seeds equals Superman food.", "title": "Superseed Bar", "url": "http://www.chowhound.com/recipes/superseed-bar-28751", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/28751_superseed.jpg", "ingredients": ["Oil, for coating the pan", "1 1/2 cups crispy brown rice cereal", "1/2 cup raw sliced almonds", "1/2 cup raw sunflower seeds", "1/4 cup raw wheat germ", "2 tablespoons whole chia seeds", "2 tablespoons flax seed meal", "1 cup dried Medjool dates (about 6 ounces), pitted", "1/4 cup natural smooth unsalted almond butter", "1/4 cup brown rice syrup", "1/2 teaspoon fine salt", "1/2 teaspoon vanilla extract", "1/3 cup natural unsweetened cocoa powder"], "directions": [ "Heat the oven to 350°F and arrange a rack in the middle. Coat an 8-by-8-inch baking pan with butter; set aside.", "Place rice cereal, almonds, sunflower seeds, wheat germ, chia seeds, and flax seed meal on a rimmed baking sheet, toss with your hands to combine, and spread in an even layer. Bake, stirring halfway through, until almonds are fragrant and lightly toasted, about 12 minutes. Transfer to a wire rack to cool slightly, about 5 minutes.", "Place cereal mixture in a food processor fitted with a blade attachment and pulse until the mixture is broken up and the largest pieces are about the size of uncooked grains of rice, about 5 (1-second) pulses. Transfer to a medium bowl; set aside.", "Place dates in the food processor and process until finely chopped and a ball forms, about 15 seconds; set aside.", "Place almond butter, rice syrup, salt, and vanilla in a medium saucepan over medium-low heat. Stir until mixture is combined and runs like slow-moving lava, about 1 minute. Remove from heat, immediately add reserved dates and cocoa powder, and, using a wooden spoon, stir, smashing down on the dates, until well combined and no streaks of cocoa remain. Add reserved cereal mixture and stir, pressing as you do, until evenly combined. (This takes some muscle and time, about 5 minutes.) Transfer to the prepared baking pan and, using your hands, spread and firmly press the mixture into the pan. Let cool completely.", "Remove the date-seed slab from the pan. Cut it in half to form two rectangles, then cut each rectangle widthwise into 5 bars to form 10 bars total. Wrap each bar in plastic wrap. Store at room temperature for up to 3 days or freeze for up to 3 weeks; let frozen bars come to room temperature before eating."]},
{"description": "This frozen yogurt recipe is rich, tangy, and swirled with sweet summer blackberries.", "title": "The Easiest Frozen Yogurt with a Blackberry Swirl", "url": "http://www.chowhound.com/recipes/the-easiest-frozen-yogurt-with-a-blackberry-swirl-29761", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2011/07/29761_frozen_yogurt_blackberry_620.jpg", "ingredients": ["2 cups fresh blackberries (about 12 ounces), rinsed, plus more for serving", "1 vanilla bean, split lengthwise and scraped, seeds and pod reserved", "1 1/4 cups granulated sugar", "2 cups plain whole-milk yogurt", "1 cup plain whole-milk Greek yogurt"], "directions": [ "Place the blackberries, vanilla pod, and 1/2 cup of the sugar in a medium saucepan over medium-low heat. Cook, stirring occasionally, until the sugar dissolves and the berries start to exude their juices, about 7 minutes. Remove the pan from the heat, then crush the berries gently with a potato masher, keeping some of them intact. Transfer the mixture to a medium heatproof bowl, cover, and place in the refrigerator until completely chilled, about 2 hours.", "Meanwhile, whisk the reserved vanilla seeds, remaining 3/4 cup sugar, and both yogurts together in a medium bowl. Cover and refrigerate until the berry mixture is ready.", "Remove and discard the vanilla pod from the berry mixture. Strain the mixture through a fine-mesh strainer set over a medium bowl. Reserve the juices for another use (or for drizzling on the frozen yogurt when serving). Set the strained berries aside.", "Freeze the yogurt mixture in an ice cream maker according to the manufacturer’s instructions.", "While the yogurt is still in the frozen base of the ice cream maker, fold in the strained berries with a rubber spatula, being careful not to overmix. Serve immediately for a soft yogurt, or transfer to an airtight container and freeze until solid. (Allow the frozen yogurt to sit at room temperature for 15 minutes before serving if frozen solid.)", "Spoon into a small dish and top with fresh blackberries and the reserved blackberry juices, if desired."]},
{"description": "This easy chicken and ginger clay pot recipe uses a flavorful marinade, then braises the chicken to yield supertender meat.", "title": "Chicken and Ginger Clay Pot", "url": "http://www.chowhound.com/recipes/chicken-and-ginger-clay-pot-29762", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/recipe_photos/29762_chicken_clay_pot3.jpg", "ingredients": ["3 tablespoons packed dark brown sugar", "3 tablespoons water", "2 ounces fresh ginger (about 1 [5-inch] piece), peeled and thinly sliced", "4 medium garlic cloves, thinly sliced", "3 tablespoons soy sauce", "2 tablespoons fish sauce", "2 tablespoons freshly squeezed lime juice (from about 1 medium lime)", "3 star anise pods", "2 Thai red chiles, halved lengthwise", "12 bone-in chicken thighs (about 4 pounds), skin removed", "1 cup low-sodium chicken broth ", "1 medium red onion, thinly sliced", "Kosher salt", "Freshly ground black pepper", "Thai basil leaves or fresh cilantro leaves, for garnish", "Steamed brown rice or steamed white rice, for serving"], "directions": [ "Place the brown sugar and water in a large clay pot or Dutch oven with a tightfitting lid over medium-high heat, stirring until the sugar dissolves. Bring to a boil; add the ginger, garlic, soy sauce, fish sauce, lime juice, star anise, and chiles; and stir to combine. Remove the pot from the heat and let cool to room temperature, about 30 minutes.", "Add the chicken pieces and turn to coat in the marinade. Let sit at room temperature uncovered for 1 hour, or cover and marinate in the refrigerator for up to 24 hours.", "If covered, uncover the pot and place it over high heat. Add the chicken broth and onion and bring to a boil. Reduce the heat to low, cover, and simmer until the chicken is tender, about 1 hour.", "Remove the chicken to a serving plate. Increase the heat to medium and simmer vigorously until the sauce has slightly darkened in color and has reduced by about a third, about 5 minutes. Taste and season with salt and pepper as needed. Garnish the chicken with cilantro and serve with the sauce and steamed rice."]},
{"description": "This cinnamon and pear fruit leather recipe combines sweet pears and warm cinnamon for an easy treat.", "title": "Cinnamon and Pear Fruit Leather", "url": "http://www.chowhound.com/recipes/cinnamon-and-pear-fruit-leather-29919", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2011/08/29919_cinnamon_pear_620.jpg", "ingredients": ["1 1/2 pounds ripe Bartlett or Comice pears", "1/4 cup water", "2 tablespoons granulated sugar", "1/4 teaspoon ground cinnamon", "Pinch fine salt", "2 teaspoons freshly squeezed lemon juice"], "directions": [ "Heat the oven to 170°F and arrange a rack in the middle. Line a rimmed baking sheet with a silicone baking mat and place on a flat work surface; set aside.", "Peel the pears, cut them in half, and remove the cores and stems. Cut into large dice and place in a medium saucepan. Add the water, sugar, cinnamon, and salt. Place the saucepan over medium heat and bring to a boil, stirring occasionally with a rubber spatula. Reduce the heat to medium low and simmer, stirring occasionally, until the pears are knife tender, about 15 to 20 minutes.", "Transfer the mixture to a blender and add the lemon juice. Remove the small cap from the blender lid (the pour lid) and cover the space with a kitchen towel (this allows steam to escape and prevents the lid from popping off); blend the pear mixture on high speed until you’ve got a very smooth purée, about 1 minute.", "Slowly pour the purée onto the baking mat, tracing the inside of the colored border to create a rectangle. (If your baking mat has no border, leave a 1-inch border from the edge.) ", "Pour the remaining purée within the borders of the rectangle in a zigzag pattern (do not pour it all into the middle of the baking mat). ", " Using the rubber spatula, push the purée to cover any empty parts within the rectangle (the surface will not be even). ", "Keeping the baking sheet on the work surface, grasp the edges of the sheet—pressing against the exposed border of the baking mat with your thumbs—and gently shake back and forth to even out the surface of the purée, rotating the baking sheet and shaking as necessary. ", "Place in the oven and bake until the surface of the fruit leather is slightly sticky to the touch but, when pressed in several different places, a finger does not leave an indentation, about 6 to 7 hours. Remove the baking sheet from the oven, place on a wire rack, and let cool completely.", "Set aside a 16-inch-long sheet of waxed or parchment paper. Starting at one short edge of the cooled fruit leather, pull it up from the baking mat and transfer it to the paper. Using clean kitchen scissors, cut through the fruit leather and paper to form desired-sized strips, shapes, or pieces and roll up, paper and all (to prevent sticking). Store in an airtight container for up to 3 weeks."]},
{"description": "Whole fish stuffed with a purée of cilantro, mint, lemongrass, ginger, and lime.", "title": "Roasted Fish with Thai Pesto", "url": "http://www.chowhound.com/recipes/roasted-fish-with-thai-pesto-11075", "image": "http://search.chow.com/thumbnail/1280/800/www.chowstatic.com/assets/2009/08/roast_fish_thai_pesto_600.jpg", "ingredients": ["3/4 cup tightly packed fresh cilantro leaves and tender stems", "1/4 cup tightly packed fresh mint leaves", "3 medium garlic cloves", "1 medium jalapeño, seeded and coarsely chopped", "2 tablespoons lemongrass, coarsely chopped ", "2 teaspoons ginger, peeled and coarsely chopped", "2 teaspoons fish sauce", "Zest of 1 medium lime", "1/4 cup plus 1 tablespoon peanut oil", "1-1/2-pound whole sea bass, red snapper, or barramundi, gutted and cleaned"], "directions": [ "Heat the oven to 400°F and arrange a rack in the middle. Combine cilantro, mint, garlic, jalapeño, lemongrass, ginger, fish sauce, and lime zest in a food processor and pulse until evenly puréed. With the food processor running, slowly drizzle in 1/4 cup of the peanut oil and process until mixture resembles a thick pesto, about 2 minutes.", "Rinse fish inside and out and pat dry with paper towels. Season all over with salt and freshly ground black pepper. Spread herb mixture inside fish and close securely with butcher’s twine or toothpicks.", "Cut a piece of parchment paper or aluminum foil long enough to enclose the fish and place on a baking sheet. Drizzle the foil with remaining 1 tablespoon peanut oil. Place fish on the foil and fold the foil over (don’t close too tightly though; leave some room around the fish). Roast fish in the oven until flesh is white and firm to the touch, about 40 minutes. Serve immediately."]}]
