[{"description": "Light and nourishing, lettuce wraps with stir fried chicken, shiitake mushrooms, and diced mango.", "title": "Chicken Mango Lettuce Wraps", "url": "http://www.simplyrecipes.com/recipes/chicken_mango_lettuce_wraps/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2013/02/chicken-mango-lettuce-wraps-a.jpg", "ingredients": ["1 pound ground chicken (I use ground chicken thighs for more flavor)", "2 teaspoons soy sauce (use gluten-free soy sauce if cooking gluten-free)", "1 teaspoon corn starch (or potato or rice starch)", "1 teaspoon cooking oil (a high smoke point oil would be best such as rice bran oil, grapeseed oil, or canola oil)", "2 green onions, chopped", "4 ounces fresh shiitake mushrooms, sliced", "2 teaspoons seasoned rice vinegar", "1/2 teaspoon toasted sesame oil", "1 large mango, diced (see ", ")", "1 head of butter lettuce, rinsed, leaves separated"], "directions": [" Place the ground chicken, soy sauce, and corn starch in a large bowl. Mix to combine.", " Heat a wok or a large sauté pan on medium heat.  Once the pan is hot, add the oil. Add the green onions and sliced shiitakes. Let cook for about a minute.", " Increase the heat to high, and add the ground chicken, soy sauce, corn starch mixture.  Use a wooden spoon to break up the ground chicken and spread around the pan.  Stir fry in this way for 5 to 7 minutes until the chicken is cooked through. Add the seasoned rice vinegar, sesame oil, and diced mango.  Remove from heat. Adjust seasonings (rice vinegar, sesame oil, soy sauce) to taste.", "Scoop spoonfuls into the cups formed by the lettuce leaves to serve."]},
{"description": "Healthy and easy! Avocado Tuna Salad with avocado, canned tuna, red onion, celery, and NO mayo.", "title": "Avocado Tuna Salad", "url": "http://www.simplyrecipes.com/recipes/avocado_tuna_salad/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/04/tuna-avocado-sandwich-horiz-800.jpg", "ingredients": ["1 5-ounce can tuna, preferably packed in olive oil, drained", "1/2 ripe avocado, roughly chopped", "1/2 cup minced celery", "1/4 cup minced red onion", "1 Tbsp olive oil", "2 teaspoons lemon juice", "1 teaspoon lemon zest", "2 Tbsp chopped fresh cilantro or parsley", "1/2 teaspoon kosher salt", "Freshly ground black pepper"], "directions": ["Place all of the ingredients in a medium bowl. Mix with a fork, mashing the avocado and breaking up the chunks of tuna as you go, until the ingredients are well combined.", "Add more oil or salt and pepper if necessary, serve on your favorite sandwich bread or toast."]},
{"description": "Terrific smoky eggplant caviar dip! Perfect to spread over crackers for an easy, healthy, delicious appetizer.", "title": "Eggplant Caviar", "url": "http://www.simplyrecipes.com/recipes/eggplant_caviar/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/09/eggplant-caviar-horiz-a-1500.jpg", "ingredients": ["2 medium globe eggplants (about 2 pounds or 900 g total)", "2 Tbsp olive oil", "1 teaspoon kosher salt", "1 medium red bell pepper", "3 cloves garlic", "3 Tbsp high quality olive oil", "1 teaspoon balsamic vinegar", "1/2 teaspoon kosher salt", "2 Tbsp minced fresh basil", "1/8 teaspoon freshly ground black pepper"], "directions": [" Preheat oven to 400°F (205°C). (Alternatively you can grill the eggplant, in which case, prepare the grill for medium high direct heat.)", "Slice the eggplants in half lengthwise. Score the cut side of the eggplants in a crosshatch pattern with a sharp knife, in lines about an inch apart. Poke the skin sides of the eggplants with the tines of a fork all over.", "Line a sheet pan with foil. Spread olive oil over the bottom of the sheet pan, and sprinkle evenly with salt. Place the eggplants cut side down on the foil lined pan. Place in oven and cook for 35 minutes, or until completely cooked through and very soft.", ", cut the eggplants in half lengthwise, and poke the skin sides with the tines of a fork. Brush the cut side with olive oil and sprinkle with salt. Grill cut side down until lightly browned and cooked all the way through. If the eggplants brown too quickly, turn them over and finish the cooking on the skin side.", "Once the eggplants have cooled to the touch, peel off the tough outer skin and discard.", " While the eggplant is roasting in step 1, roast the red bell pepper. There are three ways in which you can do this. Coat the bell pepper lightly with olive oil first.", "You can put the bell pepper under a broiler in a broiler pan and broil on all sides until the skin is completely blackened. OR you can place the bell pepper directly on the grates of a gas stove and roast over the open flame, until blackened on all sides. OR you can grill on high direct heat, turning, until blackened on all sides.", "Once blackened, place the bell pepper in a bowl and cover with a plate to steam for several minutes. Once the bell pepper has cooled to the touch, peel off the charred outer skin. Remove the stem and seeds.", " Place garlic, peeled eggplant, peeled roasted bell pepper in a food processor and pulse until smooth.", " Transfer the eggplant mixture from the food processor into a large bowl. Whisk in the olive oil, balsamic vinegar, salt, minced basil, and pepper.", "Serve with crackers, pita chips, crostini toasts, or for gluten-free option celery or cucumber sticks."]},
{"description": "Simple and healthy, Beet and Avocado salad, sprinkled with pistachios and drizzled with a citrusy vinaigrette!", "title": "Avocado Beet Salad with Citrus Vinaigrette", "url": "http://www.simplyrecipes.com/recipes/avocado_beet_salad_with_citrus_vinaigrette/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/04/avocado-beet-salad-citrus-horiz-a-1600.jpg", "ingredients": ["4 medium-sized beets (any color), green tops removed, beets scrubbed clean", "1 just ripe avocado", "4 ounces mixed green lettuces", "2 Tbsp pistachios, chopped", "1 Tbsp minced shallot", "2 Tbsp rice vinegar (unseasoned)", "1 Tbsp fresh lemon juice", "1 Tbsp fresh orange juice", "2 teaspoons lemon zest", "1 teaspoon orange zest", "A Pinch of salt", "1/3 cup good quality light olive oil"], "directions": ["Place beets in a medium saucepan and cover with an inch of water. Bring to a boil and reduce heat to maintain a low simmer for 30 to 40 minutes, depending on the size of the beets, until easily pierced with the tines of a fork.", "When done, drain, peel off the outer thick skin, and let the beets cool to room temp.", "Whisk together the citrus vinaigrette ingredients in a small bowl.", " When the beets are cool and you are ready to serve, cut the beets in half and the halves into wedges. Tip: use a plastic cutting board when cutting red beets. They will stain wooden cutting boards.", "Cut and peel the avocado, cut the avocado into chunks (see ", ").", " Slice the avocado into wedges. Toss the salad greens with half of the citrus vinaigrette. Arrange the dressed greens on serving plates.", "Arrange the beet wedges and avocado wedges on top of the salad greens. Sprinkle with chopped pistachios. Drizzle remaining vinaigrette over the salads."]},
{"description": "Easy Chinese egg drop soup with eggs, ginger, green onions, and mushrooms. Cooks in less than 15 minutes!", "title": "Quick and Easy Egg Drop Soup", "url": "http://www.simplyrecipes.com/recipes/egg_drop_soup/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/05/egg-drop-soup-horiz-a-1400.jpg", "ingredients": ["3 eggs, lightly beaten", "4 cups of ", "*", "1 tablespoon of corn starch", "Scant 1/2 teaspoon grated ginger**", "1 tablespoon of soy sauce*", "3 green onions, chopped", "1/4 teaspoon of white pepper", "3/4 cup of enoki mushrooms or sliced shitaki mushrooms"], "directions": [" Reserve 1/2 cup of the stock and mix with the cornstarch until dissolved.", " Place the chicken stock, ginger, soy sauce, green onions, mushrooms and white pepper in a pot and bring to a boil. Add the cornstarch and stock mixture and stir. Reduce heat to a simmer.", " Slowly pour in the beaten eggs while stirring the soup. The egg will spread out into ribbons. Turn off the heat and garnish with a few more chopped green onions. Serve immediately."]},
{"description": "Cheesy tortellini casserole, cheese tortellini in tomato sauce with mushrooms and chard, topped with Mozzarella and baked until bubbly. ", "title": "Cheesy Tortellini Casserole", "url": "http://www.simplyrecipes.com/recipes/cheesy_tortellini_casserole/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/01/cheesy-tortellini-casserole-horiz-a-1600.jpg", "ingredients": ["1 1/2 pounds (24 ounces) prepared frozen cheese tortellini", "Salt", "12 ounces cremini or white button mushrooms, roughly chopped or sliced into 1/4-inch slices", "1 Tbsp butter", "3 cloves garlic, minced (about 1 Tbsp)", "1 28-ounce can crushed tomatoes", "1 large bunch swiss chard, ribs removed, leaves chopped (about 2 cups) OR 2 cups fresh chopped spinach OR 1/2 cup frozen spinach", "1 1/2 teaspoons dried basil or 1 Tbsp finely chopped fresh basil", "1/4 teaspoon fennel seeds, crushed", "Pinch of red pepper flakes", "1/2 cup grated Parmesan cheese", "4 to 6 ounces Mozzarella cheese slices, enough to cover the surface of the casserole"], "directions": [" Heat a large pot with 3 quarts of water and 1 1/2 tablespoons of salt on high heat. When the water starts to boil, add the tortellini. Once the water returns to a boil, cook for an additional 2 minutes.", "You want the pasta cooked al dente because it will continue to cook when baked in the casserole. Remove from heat and drain. Set aside.", " While you are preparing the pasta, start on the sauce. Heat a large thick bottomed stick-free (hard anodized aluminum or cast iron are best) pan on medium heat.", "Add the mushrooms. \"Dry\" sauté them for 5 to 10 minutes with no added fat. As the mushrooms heat they will release water and cook in their own juices.", "Once the mushrooms are well coated with the water that they are releasing, stir in a tablespoon of butter.", " Add the garlic, crushed fennel seeds, and red pepper flakes to the mushrooms and cook a minute more.", "Add the crushed tomatoes and the dried or fresh basil. Increase the heat to bring to a simmer, then lower the heat to maintain a low simmer for 5 minutes.", "Add the chopped chard and cook for 5 more minutes until the chard begins to wilt.", "Stir in the grated Parmesan cheese. Add 1/2 teaspoon of salt (more or less to taste).", " Pre-heat oven to 400°F. Stir the cooked tortellini into the sauce and remove from heat. Spread the tortellini mixture into a 9x13 casserole dish in an even layer. Arrange a layer of sliced Mozzarella cheese over the top of the tortellinis.", " Cover with foil. (Either cover the casserole in a way that the foil is not touching the cheese or spread a little olive oil over the inside of the foil so that the casserole cheese does not stick to the foil while it cooks. You can also use stick-free foil.)", "Bake at 400°F for 20 minutes. Remove foil and broil for 4 to 5 minutes more until top is lightly browned and bubbly."]},
{"description": "Healthy delicious Greek salad with quinoa, cherry tomatoes, cucumbers, red onion, kalamata olives, and feta cheese. So easy!", "title": "Quinoa Greek Salad", "url": "http://www.simplyrecipes.com/recipes/quinoa_greek_salad/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/07/quinoa-greek-salad-horiz-a-1600.jpg", "ingredients": ["1 cup dry quinoa", "1 teaspoon salt", "2 cups diced cucumbers, seeded if the cucumbers are very seedy, and peeled if the cucumbers have thick peels", "1/3 cup finely diced red onion", "2 cups cherry or sungold tomatoes, halved", "2 Tbsp finely diced red bell pepper", "1/2 cup chopped, pitted kalamata olives", "1 Tbsp thinly sliced fresh mint", "1 1/2 teaspoon chopped fresh oregano", "2 Tbsp chopped fresh parsley", "1/4 cup high quality olive oil", "2 Tbsp red wine vinegar", "1 1/2 teaspoons salt", "1/2 cup crumbled feta cheese (omit for vegan option)"], "directions": [" Cook quinoa in salted water (1 teaspoon salt for 2 cups water) according to quinoa box instructions. (Usually that means heating 1 cup of quinoa and 2 cups of water until simmering, then lowering the heat to low, covering and cooking for 15 minutes.)", "Remove from heat and fluff with a fork. To cool quickly, spread out cooked quinoa on a baking sheet.", " While the quinoa is cooking, prep the vegetables and herbs for the salad.", "Place cooled quinoa, cucumbers, onions, tomato, bell pepper, olives, and herbs (mint, oregano, parsley) in a large bowl.", "Toss with olive oil to gently combine.", "Sprinkle with vinegar, salt, and crumbled feta cheese, and gently toss to combine.", "Serve immediately.", " "]},
{"description": "Turn sweet potatoes and black beans into a simple, healthy dinner with these tacos! 30 minute meal.", "title": "Sweet Potato and Black Bean Tacos", "url": "http://www.simplyrecipes.com/recipes/sweet_potato_and_black_bean_tacos/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/10/sweet-potato-black-bean-tacos-horiz-a-1600.jpg", "ingredients": ["1 to 2 medium sweet potatoes, cut into 1/2-inch cubes (about 2 cups cubed)", "2 tablespoons neutral cooking oil (such as grapeseed or canola)", "1/2 teaspoon kosher salt", "1 teaspoon chili powder", "1/2 teaspoon ground cumin", "2 tablespoons neutral cooking oil (such as grapeseed or canola)", "1/2 medium yellow onion, diced (about 1/2 cup diced)", "1 teaspoon kosher salt", "1 clove garlic, minced", "1 jalapeño, stemmed, seeded, and minced", "1 15-ounce can black beans, drained and rinsed", "Apple cider vinegar or water, as needed", "10 to 12 corn tortillas", "1/2 cup tomatillo salsa verde, ", " or store-bought", "1 ripe avocado, sliced thin", "Fresh cilantro, roughly chopped", "Lime wedges", "1/4 cup crumbled cotija cheese"], "directions": ["In a medium-sized bowl, toss the sweet potatoes, 2 tablespoons oil, salt, cumin, and chili powder. Spread on a baking sheet in an even layer. Bake 15 minutes, then use a spatula to flip and stir the sweet potatoes. Roast another 15 minutes or until sweet potatoes have puffed up and have crisp, roasted edges.", "While the sweet potatoes roast, heat 2 tablespoons oil in a medium saucepan over medium heat. Add the onions and salt, and sauté until soft and translucent, 5 to 7 minutes. Add the garlic and jalapeño, and sauté 2 minutes more. Fold in beans. Cook, stirring occasionally, until the beans are soft and seasoned, about 10 to 15 minutes. If beans seem dry or bottom of pan starts to sizzle, add a splash of apple cider vinegar or water as needed. Taste and add salt as needed.", "Briefly heat the tortillas one or two at a time in a dry skillet until warm. Transfer to a plate and cover with a towel to keep warm. Alternatively, warm a stack of 5 or fewer tortillas a time in the microwave, covered with a damp paper towel, in 30 second bursts until warmed through.", "Layer tacos with sweet potatoes and black beans. Serve with avocado slices, salsa, minced cilantro, and cotija cheese, letting everyone top their own tacos."]},
{"description": "Healthy green smoothie with banana, pineapple, spinach, and Greek yogurt.", "title": "Green Smoothie", "url": "http://www.simplyrecipes.com/recipes/green_smoothie/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2014/01/green-smoothie-horizontal-2.jpg", "ingredients": ["1 medium ripe banana", "1 cup of fresh, canned, or frozen pineapple", "3 large handfuls of fresh spinach (washed)", "1 cup of plain Greek yogurt", "6 oz. water", "1 teaspoon coconut oil (optional)"], "directions": ["Put all ingredients in a blender, and blend until smooth."]},
{"description": "Easy, healthy Mediterranean style chicken salad! With olive oil, vinegar, olives, capers, onions and fresh herbs.", "title": "Mediterranean Chicken Salad", "url": "http://www.simplyrecipes.com/recipes/mediterranean_chicken_salad/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2013/05/mediterranean-chicken-salad-horiz-a-1600.jpg", "ingredients": ["1/2 cup minced red onion", "2 Tbsp red wine vinegar", "1 pound boneless, skinless chicken breasts", "Salt", "2  Tbsp olive oil", "1 Tbsp capers", "3/4 cup mixed pitted deli olives, sliced", "1 pinch of red chile flakes", "1 Tbsp chopped fresh oregano or basil (or both!)", "2 Tbsp chopped fresh parsley", "Black pepper to taste", "Endive lettuce for appetizer boats, or chopped to add to the salad", "Butter lettuce for lettuce cups", "Fusilli pasta, about 1/4 pound dry for one batch of the salad (use gluten-free pasta for gluten-free option)"], "directions": [" Mix the minced onion with the vinegar in a bowl and set aside. This quick pickling will take the edge off of the onions.", " Bring 1 1/2 quarts of water to a boil and add about 2 tablespoons of salt. Cut the chicken breasts in half crosswise and place them in the water. Reduce the heat to low and let the chicken cook very gently, at barely a simmer, for 10-15 minutes, until just cooked through.", " While the chicken is cooking, mix the olive oil, capers, olives, chile flakes, and oregano in a large bowl.", " When the chicken is done, place it on a cutting board to cool. Add the onions to the bowl with the olives. Once the chicken has cooled enough to handle, cut it into dice or shred it.", " Gently mix the chicken and parsley in with the olives. Add salt and black pepper to taste. Serve warm, at room temperature, or chilled."]},
{"description": "Slow cooked collard greens with a ham hock, onions, vinegar and hot sauce.", "title": "Southern Style Collard Greens", "url": "http://www.simplyrecipes.com/recipes/southern_style_collard_greens/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2013/04/southern-collard-greens-horiz-a-1200.jpg", "ingredients": ["2 Tbsp bacon fat, lard or vegetable oil", "1 medium onion, sliced from root to tip", "1 ham hock", "2 garlic cloves, smashed", "1 quart chicken broth", "1-2 cups water", "8-10 cups chopped collard greens, about 2 pounds", "Vinegar and hot sauce to taste"], "directions": [" Heat the bacon fat in a large pot set over medium-high heat. Sauté the onion in the bacon fat, stirring often, until the edges begin to brown, about 5 minutes. Add the ham hock, smashed garlic, chicken stock and water and bring to a simmer. Cover and cook for 1 hour.", " Add the collard greens to the pot and cook until tender, another 45 minutes to an hour.", " To serve, fish out the ham hock, pull the meat off the bones and chop. Mix the meat back with the greens and serve with vinegar and hot sauce at the table."]},
{"description": "BEST roasted cauliflower is Roasted Curried Cauliflower! With onions, garlic, curry spices. Quick, EASY, healthy!", "title": "Roasted Curried Cauliflower", "url": "http://www.simplyrecipes.com/recipes/roasted_curried_cauliflower/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/01/curry-roasted-cauliflower-horiz-a-1600.jpg", "ingredients": ["1 large (or 2 small) head(s) cauliflower, cored, broken into large-ish florets, florets sliced into 1/2-inch slices", "1/2 onion, peeled, thickly sliced, root to tip", "4 cloves garlic, sliced", "2 Tbsp lemon juice", "1/3 cup (80 ml) olive oil", "1 1/2 teaspoons yellow curry powder", "1/4 teaspoon ground cinnamon", "1/2 teaspoon salt", "1/4 teaspoon ground black pepper"], "directions": [" Pre-heat oven to 425°F (220°C) with a rack on the top third of the oven. Line a large rimmed baking with foil.", " Put the garlic, lemon juice, olive oil, curry powder, cinnamon, salt, and pepper in a large bowl. Whisk vigorously until well combined.", "  Add the cauliflower and onion slices to the bowl with the curry and toss to coat. Spread the cauliflower and onion slices on the baking sheet in a single layer.", " Roast in oven at 425°F (220°C) for 25 to 30 minutes until well browned. Check halfway through the cooking, and rotate the pan for more even cooking.", "Serve immediately or at room temperature."]},
{"description": "Easy and Healthy! Avocado chicken salad with avocado, chopped cooked chicken, apple, celery, and onion. No Mayo!", "title": "Avocado Chicken Salad", "url": "http://www.simplyrecipes.com/recipes/avocado_chicken_salad/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/09/avocado-chicken-salad-horiz-a-1500.jpg", "ingredients": ["1 cup finely chopped cooked chicken", "1 ripe avocado, seeded and peeled (see ", ")", "1 apple, peeled, cored, and finely chopped", "1/4 cup finely chopped celery", "1/4 cup finely chopped red onion", "2 Tbsp finely chopped cilantro or parsley", "2 teaspoons lime juice or a tablespoon of lemon juice", "1/2 teaspoon kosher salt", "Pinch of freshly ground black pepper", "Sandwich bread or salad greens"], "directions": [" Place the ", ", ", ", ", ", ", ", and ", " ", " in a medium bowl. Gently mash the avocado with a fork and stir it around so that everything gets well mixed.", " Add the ", " or parsley, ", " ", " or lemon juice, ", ", and ", ". Add more lime juice or salt to taste. If the mixture seems a little dry, you can stir in a teaspoon or two of olive oil.", "To store, place in a bowl and cover completely with plastic wrap so that no part of the chicken salad is exposed to air. Will keep a couple of days in the fridge.", "Serve on sandwich bread, toasted bread, or salad greens (I recommend arugula or watercress for extra zing)."]},
{"description": "Easy-to-make roasted broccolini! Healthy, paleo, and gluten-free.", "title": "Oven Roasted Broccolini", "url": "http://www.simplyrecipes.com/recipes/oven_roasted_broccolini/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/01/roasted-broccolini-horiz-c.jpg", "ingredients": ["2 bunches broccolini (about 1 1/4 pound total), trimmed", "3 cloves garlic, minced (about 3 teaspoons)", "4 Tbsp olive oil", "Salt", "Pepper"], "directions": [" Preheat oven broiler.", " Line a roasting pan with aluminum foil. Spread the broccolini out in an even layer. Sprinkle the garlic over the broccolini. Drizzle the olive oil over the broccolini. Sprinkle with salt and pepper.", " Place under the broiler and cook for 6 to 8 minutes (keep an eye on it!), until lightly browned and the stalks are fork tender.", "Serve immediately."]},
{"description": "Don't throw away the pumpkin seeds from your pumpkin! Roast them for a delicious healthy Halloween snack", "title": "Roasted Pumpkin Seeds", "url": "http://www.simplyrecipes.com/recipes/toasted_pumpkin_seeds/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2014/10/roasted-pumpkin-seeds-horiz-a-1500.jpg", "ingredients": ["One medium sized pumpkin", "Salt", "Olive oil"], "directions": [" Cut open the pumpkin by cutting a circle around the stem end with a sharp knife (knife blade angled in), and pulling off the top.", "Use a strong metal spoon to scrape the insides of the pumpkin and scoop out the seeds and strings.", "Place the mass of pumpkin seeds in a colander and run under water to rinse and separate the seeds from everything else.", " Measure the pumpkin seeds in a cup measure. Place the seeds in a medium saucepan. Add 2 cups of water and 1 tablespoon of salt to the pan for every half cup of pumpkin seeds. Add more salt if you would like your seeds to be saltier.", "Bring the salted water and pumpkin seeds to a boil. Let simmer for 10 minutes. Remove from heat and drain.", " Preheat the oven to 400°F. Coat the bottom of a roasting pan or thick baking sheet with olive oil, about a teaspoon or so.", "Spread the seeds out over the roasting pan in a single layer, and toss them a bit to coat them with the oil on the pan.", "Bake on the top rack until the seeds begin to brown, 5-20 minutes, depending on the size of the seeds.", "Small pumpkin seeds may toast in around 5 minutes or so, large pumpkin seeds may take up to 20 minutes. Keep an eye on the pumpkin seeds so they don't get over toasted. When lightly browned, remove the pan from the oven and let cool on a rack. Let the pumpkin seeds cool all the way down before eating.", "Either crack to remove the inner seed (a lot of work and in my opinion, unnecessary) or eat whole."]},
{"description": "Holiday Spice Granola! Oats, almonds, cashews, cranberries, and dried apricots spiced with cinnamon, ginger, and cloves. Great homemade gift or special holiday treat!", "title": "Holiday Spice Granola", "url": "http://www.simplyrecipes.com/recipes/holiday_spice_granola/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/11/16161720/2016-11-30-SpicedGranola-6.jpg", "ingredients": ["1/2 cup maple syrup", "1/3 cup coconut oil", "1 tablespoon vanilla extract", "1 teaspoon ground cinnamon", "1 teaspoon ground ginger", "1/2 teaspoon salt", "1/4 teaspoon ground cloves", "5 cups old-fashioned rolled oats (not instant; use gluten-free oats, if needed)", "2/3 cup flax seeds", "2/3 cup pumpkin seeds", "1/2 cup whole almonds", "1/2 cup cashews", "1/3 cup chia seeds", "1 /2 cup dried cranberries", "1/2 cup diced dried apricots"], "directions": [". Line a rimmed baking sheet with a piece of parchment paper that is about 1 inch larger all around than the baking sheet.", " In a saucepan over medium heat, stir together the maple syrup, coconut oil, vanilla, cinnamon, ginger, salt, and cloves. Stirring occasionally, cook for 2 minutes, or until the syrup is warm and fluid, and the salt dissolves.", "In a large bowl, combine the oats, flax seeds, pumpkin seeds, almonds, cashews, and chia seeds. Pour the warm syrup over the nuts and grains. Stir to coat them thoroughly. Spread evenly on the baking sheet.", " Bake for 15 minutes, then remove the pan from the oven. Grasp the corners of the parchment paper and pull them toward the center to mound the granola in a pile. Stir with a large spoon and spread the granola out again in one layer.", "Return to the oven for 5 minutes. Remove and mound the granola in the center again. If it still looks pale in places, give it another stir, spread it back out, and return the pan to the oven to toast for 3 or 4 minutes more. (Total baking time is 20 to 25 minutes.) Leave on the baking sheet to cool completely.", "Scatter the cranberries and apricots over the cooled granola and stir to combine. Transfer the granola to an airtight jar or tin, and store at room temperature for several weeks."]},
{"description": "Mini frittatas made in mini muffin tins, with eggs, feta cheese, mushrooms, onions, and chard.", "title": "Mini Muffin Frittatas", "url": "http://www.simplyrecipes.com/recipes/mini_muffin_frittatas/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2013/12/mini-muffin-frittatas-horiz-b-640.jpg", "ingredients": ["2 large chard leaves, center ribs removed", "1 teaspoon salt for the blanching water", "1 Tbsp butter", "4-6 shiitake mushrooms (1.5 ounces total), minced", "1/4 cup minced shallots", "1 Tbsp chopped fresh oregano or 1 teaspoon of dried crumbled oregano", "2-3 Tbsp crumbled feta cheese", "8 large eggs, beaten", "1/4 teaspoon salt (more or less to taste)", "1/8 teaspoon ground pepper", "Two 12-well mini-muffin tins, greased with a little butter or olive oil"], "directions": [" Heat a couple quarts of water to boiling in a pot. Add a teaspoon of salt to the water. Add the chard leaves to the boiling water. Boil until just tender, 2-4 minutes. Remove from pot and rinse in cold water to stop the cooking. Squeeze out excess water. Then chop finely and set aside.", " Melt butter in a small sauté pan on medium heat. Add the minced shallots and mushrooms. Cook for 5 to 6 minutes until the shallots are translucent and the mushrooms are soft. Stir in the oregano.", " Preheat oven to 325°F (160°C). Stir salt and pepper into the beaten eggs. Pour eggs into a measuring cup with a pouring edge or spout to make it easier to fill the wells. Fill the wells a quarter of the way.", " Distribute the mushroom shallot mixture, chard, and feta in even amounts throughout the muffin tin wells. Then top with the remaining egg mixture.", " Bake at 325°F (160°C) for 20 minutes. If you want, finish by browning under the boiler for a minute or two, until lightly browned.", " Let cool slightly in pan. Then loosen the mini frittatas from the pan using a wooden skewer.  Serve warm or at room temperature."]},
{"description": "Rich and creamy pumpkin soup recipe with a smokey, spicy flavor from smoked paprika.  Make with pumpkin purée, onions, apple, garlic, spices, stock, milk and cream.", "title": "Pumpkin Soup with Smoked Paprika", "url": "http://www.simplyrecipes.com/recipes/pumpkin_soup_with_smoked_paprika/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2007/09/pumpkin-soup-smoked-paprika-horiz-a-1800.jpg", "ingredients": ["1 4-5 pound cooking pumpkin* to yield 6 cups roasted pumpkin OR 3 (15 ounce) cans of pumpkin purée", "4 Tbsp butter", "2 medium yellow onions, chopped, about 2 cups", "3 garlic cloves, minced", "1 Tbsp ", "1/2 teaspoon ground cumin", "1 pinch cayenne pepper", "1 large tart green apple (Granny Smith) peeled, cored, chopped (about 2 cups)", "4 cups chicken broth (or vegetable broth for vegetarian option, and gluten-free broth for gluten-free version)", "1 cup water", "1 teaspoon fresh thyme or 1/2 teaspoon dried thyme", "1/4 teaspoon ground sage", "1 cup milk", "1/2 cup cream", "Salt and freshly ground pepper to taste"], "directions": [" To make pumpkin purée, cut a sugar pumpkin or Kabocha squash in half, scoop out the seeds* and stringy stuff (an ice cream scoop works well for this purpose), lie face down on a foil or silicone lined baking sheet. Bake at 350°F until soft, about 45 min to an hour. Cool, scoop out the flesh. Freeze whatever you don't use for future use.", " Melt butter in a 4-quart saucepan over medium-high heat. Add the onions and cook, stirring often, until softened, about 4 minutes. Add the garlic and cook a minute more. Add smoked paprika, ground cumin, and cayenne and stir for a minute more.", " Add the chopped apple and pumpkin Add broth and water. Add the thyme and ground sage. Mix well with a wooden spoon. Season with a little salt and pepper.", "Bring to a boil, reduce heat, partially cover, and simmer for 20 minutes or until the apples are cooked through.", " Working in batches, transfer soup to a blender or a food processor. Cover tightly and blend until smooth. OR use an immersion blender to purée.", "If you want extra smooth soup, pass the purée through a food mill, after it's been through the blender.", "Return the soup to the saucepan.", " With soup on low heat, slowly add the milk and cream, stirring to incorporate. Add salt to taste. Adjust other seasonings to taste.", "Can make a day ahead."]},
{"description": "Tostada recipe with toasted or fried tortillas topped with a layer of chipotle flavored refried beans, cotija cheese, lettuce, tomatoes, radishes, and salsa.", "title": "Chipotle Bean Tostadas", "url": "http://www.simplyrecipes.com/recipes/chipotle_bean_tostadas/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2005/11/tostada-web.jpg", "ingredients": ["2 Tbsp olive oil or grapeseed oil", "1 medium onion, chopped", "1 teaspoon ground cumin", "About 4 cups of cooked pinto beans, drained (either ", " or 2 15-oz cans)", "4 teaspoons of Chipotle Tabasco Sauce (definitely do ", " use regular Tabasco sauce, only the Chipotle kind)", "Salt", "1/2 cup high flash-point vegetable oil, such as grapeseed oil, peanut oil, or canola oil", "1 dozen corn tortillas", "Salt", "1 cup of crumbled ", " Queso Seco (Mexican farmers cheese) or you can use feta cheese", "1 cup finely diced fresh tomato", "1/2 cup thinly sliced red radishes", "1/2 cup loosely packed cilantro leaves", "Iceberg lettuce, thinly sliced and sprinkled with vinegar and salt", "Sour cream"], "directions": [" Prepare the beans by sautéing onions in oil until softened in a large, thick-bottomed skillet. Add ground cumin and cook an additional 30 seconds. Add the beans, a teaspoon of salt, and a cup of water. Use a potato masher to mash the beans into the pan, until the consistency of (somewhat lumpy) mashed potatoes. Cook for a few minutes on medium hight heat until water is absorbed. Stir in the Chipotle Tabasco sauce and season to taste with more salt if needed. Remove to a warm burner out of the way, cover.", " To prepare the tortillas, heat the oven to 200°F. Line a baking pan with paper towels and place next to the stove. Heat 5 Tbsp of oil in a small skillet on medium high heat, until the bubbles form immediately when you insert the edge of a tortilla in it. Using tongs, place a tortilla in the hot oil and let cook until golden brown on both sides, about 30 seconds per side. You can use a metal spatula to flatten down the tortilla while cooking.", "Use tongs to lift the cooked tortilla out of the pan, allowing the excess oil to drip off of it, back into the pan. Place the cooked tortilla on the paper towels to absorb more of the oil. Sprinkle a little salt onto each warm tortilla. Do each tortilla one at a time this way. As you fill up a baking pan, put the pan in the oven to keep the tortillas warm.", "Add more oil as needed. Carefully monitor the oil temperature. Don't let it get too hot, or the tortillas will burn, or too cool - they won't fry up crisp enough.", " To serve, arrange the cheese, cilantro and tomatoes in separate small bowls. Put beans into a serving dish. Bring out the tortillas by batches, keeping the rest warm in the oven. Let people spread beans on to their tortillas and add sprinkle on the cheese, cilantro and tomatoes for each tostada. Optional additions are sliced lettuce, guacamole, sour cream, and salsa (though with the chipotle, you probably don't need any more heat)."]},
{"description": "Italian risotto made with summer vegetables such as corn, bell peppers, green onions and basil.", "title": "Summer Garden Risotto", "url": "http://www.simplyrecipes.com/recipes/summer_garden_risotto/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2013/08/summer-garden-risotto-a.jpg", "ingredients": ["2 Tbsp olive oil", "1 large garlic clove, minced", "1 1/2 cups Arborio or other risotto rice", "1/2 cup white wine", "5 cups hot water", "Salt and black pepper", "1/2 cup sweet corn kernels (fresh or frozen)", "1/2 cup diced red bell pepper (small dice)", "2 green onions, chopped (white and green parts)", "1/2 cup grated parmesan cheese", "10-12 basil leaves, torn up small", "2 Tbsp unsalted butter (optional)"], "directions": ["Bring the water to a simmer in a small pot. In another pot, heat the olive oil over medium-high heat. When the olive oil is shimmery hot, add the garlic and sauté until fragrant, about 30 seconds. Stir in the rice and coat with the olive oil. Sauté, stirring constantly, for 2-3 minutes, at which point the rice will begin to smell nutty.", " Add the white wine to the rice and stir. From this point on, you will be stirring the risotto rice almost constantly. After a minute or two the rice will have absorbed the wine and when you stir, the spoon will leave streaks on the bottom of the pan. Add a cup of the hot water to the pot. Add a generous pinch of salt. Stir until the water has been absorbed by the rice and your spoon is again leaving a trail at the bottom of the pan. Add another cup of hot water and repeat.", " When this second cup of water is absorbed, add the corn and red bell pepper. Add another cup of water and stir until it is absorbed. Repeat with another cup of water and another healthy pinch of salt.", " By now the rice should be close to being done; it should be fully cooked but still al dente, a little firm, not completely soft. When the rice reaches this stage, stir in the green onions and grated parmesan. When the water has been completely absorbed, add a little more water so the risotto is loose. The risotto should fill a bowl, not sit on a plate.", " Stir in the basil and butter, and sprinkle with black pepper to taste . Once the butter has melted, serve at once."]},
{"description": "Quick and easy, sautéed zucchini noodles tossed with pesto, chicken and tomatoes. ", "title": "Zucchini Noodle Chicken Pesto Bowl", "url": "http://www.simplyrecipes.com/recipes/zucchini_noodle_chicken_pesto_bowl/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/07/zucchini-noodle-chicken-pesto-bowl-horiz-a-1600.jpg", "ingredients": ["2 Tbsp olive oil", "1/2 pound boneless skinless chicken breast(s)", "Salt", "1/4 teaspoon paprika", "2 medium large zucchini (a little more than a pound)", "2 garlic cloves, sliced", "1/4 cup prepared ", "Handful of cherry tomatoes, cut in half", "Several fresh basil leaves, thinly sliced, for garnish"], "directions": [" Sprinkle both sides of the chicken breast(s) with a little salt and the paprika. Heat 1 Tbsp of olive oil on high heat in a large sauté pan. Place the chicken breast(s) in the pan and cook for a minute or two on each side, until well browned.", "Lower the heat to low and cover the pan, cook for 2 to 5 more minutes (depending on the thickness of the breast) until the chicken is just cooked through.", "Remove the chicken from the pan and let it rest while you make the zucchini noodles.", " Use a spiralizer to make zucchini noodles with the zucchini.", " Add another 1 Tbsp of olive oil to the pan you used to cook the chicken and heat it on high heat.", "Add the zucchini noodles and the sliced garlic and sauté, stirring often, until the noodles begin to wilt. Sprinkle with 1/4 teaspoon of salt while you cook the zoodles.", "When they are just barely cooked and if they are releasing moisture, remove them to a colander placed over a bowl to drain.", " Place the zucchini noodles in a serving bowl and toss with basil pesto.", "Serve the zucchini noodles in bowls topped with chicken, tomatoes, and sliced fresh basil leaves.", " "]},
{"description": "Smooth carrot soup with ginger, orange and chicken stock. So easy and healthy too!", "title": "Carrot Ginger Soup", "url": "http://www.simplyrecipes.com/recipes/carrot_ginger_soup/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2013/02/carrot-soup-a-e1421128432188.jpg", "ingredients": ["3 Tbsp unsalted butter", "1 1/2 pounds carrots (6-7 large carrots), peeled and sliced thin", "2 cups chopped white or yellow onion", "Salt", "1 teaspoon ", "2 cups ", " or vegetable stock", "2 cups water", "3 large strips of zest from an orange", "Chopped chives, parsley, dill or fennel for garnish"], "directions": [" Melt the butter in a soup pot over medium heat and cook the onions and carrot, stirring occasionally, until the onions soften, about 5 to 8 minutes. Do not let the onions or carrots brown. Sprinkle a teaspoon of salt over the carrots and onions as they cook.", " Add the stock and water and the ginger  the strips of orange zest. Bring to a simmer, cover, and cook until the carrots soften, about 20 minutes.", ". Working in small batches, pour the soup into a blender and purée until completely smooth. Only fill the blender bowl a third full with the hot liquid and keep one hand pressing down on the cap of the blender to keep it from popping off. Add more salt to taste.  (You will need more salt if you are using homemade unsalted stock or unsalted butter.)", "Garnish with chopped chives, parsley, or fennel fronds."]},
{"description": "Quick, easy, healthy! Salmon fillets poached in a tomato onion caper sauce with white wine.", "title": "Salmon with Tomato, Onions, and Capers", "url": "http://www.simplyrecipes.com/recipes/salmon_with_tomato_onions_and_capers/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2005/09/salmon-tomato-onion-capers-horiz-a-1600.jpg", "ingredients": ["3 Tbsp olive oil", "1 medium onion, chopped", "2 garlic cloves, peeled and diced", "2 large fresh tomatoes, diced", "1 teaspoon fresh thyme leaves, chopped", "2 teaspoons freshly grated lemon zest", "2 Tbsp lemon juice", "2 Tbsp of capers, drained", "1 teaspoon of chopped jalapeño peppers (no seeds, no stem, no ribs) either fresh or pickled", "1/3 cup white wine", "1/4 cup water", "Salt and pepper", "2 fresh salmon fillets, 1/2 lb each"], "directions": [" In a large, wide (at least 12 inches wide) saucepan (one that comes with a cover), heat olive oil on medium heat.", "Add the onion and cook, stirring regularly, until just beginning to brown, about 5 minutes. Add the garlic and cook for 1 minute.", " Raise the heat to medium-high and add the tomatoes, thyme, lemon zest, lemon juice, capers, and jalapeño peppers.", "Simmer for 10 minutes, adding a little water if needed to prevent the sauce from getting too dry. Salt and pepper to taste.", " Add 1/3 a cup of white wine - a simple Chardonnay will work. Add 1/4 cup of water. Bring to a simmer.", " Place the fillets in the pan on top of the sauce, skin side down, if the fillets are still in their skin. Cover and reduce heat to medium-low.", "Cook for 4-7 minutes, depending on how thick the cuts of fish are. Poke the fish with a fork and look for doneness. The fish should still be a little rare in the middle, but not raw.", "Serve immediately, with tomato sauce generously applied."]},
{"description": "Whole grilled branzino fish, or European seabass, served with a rosemary vinaigrette sauce.", "title": "Grilled Branzino with Rosemary Vinaigrette", "url": "http://www.simplyrecipes.com/recipes/grilled_branzino_with_rosemary_vinaigrette/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2010/09/grilled-branzino-horiz-640.jpg", "ingredients": ["2 Tbsp minced onion", "1 teaspoon Dijon mustard", "1 teaspoon salt", "3 Tbsp white wine vinegar", "1 large garlic clove, chopped", "1 heaping tablespoon of minced fresh rosemary", "1/2 cup olive oil", "1 whole branzino", "Olive oil", "Salt, preferably sea salt"], "directions": [" Make the rosemary vinaigrette. Put the minced onion, mustard, salt, vinegar, garlic and rosemary into a blender and purée it for about 30 seconds. Use a spatula to scrape down the sides of the blender and puree it again for 10-20 seconds. Scrape the sides down again. Turn the blender on low and take the removable cap off the lid. Hold you hand over the hole, as it might spit a little. Pour the olive oil in slowly and put the cap back on. Turn the blender off and scrape the sides down one more time. Turn the blender back on low, then high for 60 seconds.", " Rinse the fish under cold water. Now make sure its gills and scales are all removed; your fishmonger is not always so diligent about this task, and no one wants a scale on his plate. Gills can impart a bitter taste to the fish, so they need to go, too.", " Use a very sharp knife and make several slashes on the sides of the fish, maybe every inch or so. Make the cuts at an angle to the side of the fish, and slice down until you feel the spine. Do not sever the spine, however. These cuts will help the fish cook faster. Rub olive oil all over the fish and set it aside.", " ", " Prepare your grill for high, direct heat. Scrape down the grates well and close the lid. Salt the fish well. Now grab a paper towel, a set of tongs, and some cheap vegetable oil. Bring all of this out to the grill. Fold the paper towel over several times, moisten it with the vegetable oil, and hold it with tongs to wipe down the grill grates.", " Lay the fish down on the grill and close the lid. Let this cook for 5 minutes without touching it.", " Open the lid and, using tongs, gently see if you can lift the fish off the grates cleanly. Don’t actually do this, but check for sticky spots. If you have some, get a metal spatula. Use the spatula to dislodge the fish from the sticky spots.", " ", "Using tongs in one hand, and the spatula in another, gently flip the fish over. If it sticks, no biggie. It happens sometimes.", " ", " Once the fish has been flipped, let it cook another 3-5 minutes. Again, test for sticky spots with the tongs and spatula. Dislodge them gently and gently lift the fish onto a plate. If the fish is too long or seems like it might break in half, use two metal spatulas instead of the tongs-and-spatula set-up.", "Drizzle the vinaigrette over the fish and serve at once. Goes well with crusty bread and a glass of pilsner beer or white wine."]},
{"description": "Healthy, simple cabbage soup, a nourishing soup with cabbage, chicken stock, onions and tomatoes.", "title": "Cabbage Soup", "url": "http://www.simplyrecipes.com/recipes/cabbage_soup/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2014/01/cabbage-soup-horiz-a-1600.jpg", "ingredients": ["2 teaspoons olive oil", "1 teaspoon butter", "1/2 teaspoon coriander seeds (or 1/4 teaspoon ground coriander)", "1/2 teaspoon fennel seeds (or 1/4 teaspoon ground fennel)", "1/4 teaspoon cumin seeds (or 1/8 teaspoon ground cumin)", "1 medium onion, chopped (about 1 1/4 cups)", "4 to 5 cups, packed, 1/4-inch wide sliced green cabbage (from about 1 small cabbage or 1/2 large cabbage)", "1/2 teaspoon to 1 teaspoon salt (more or less depending on the saltiness of your stock)", "1 15-ounce can whole peeled tomatoes", "4 cups ", "Freshly ground black pepper"], "directions": [" If using whole spices (coriander, fennel, cumin), grind them in a mortar and pestle or in a spice grinder until well ground.", " Heat olive oil and butter in a 4-quart, thick bottomed pot on medium heat. Add the chopped onion and stir in the ground spices. Cook until the onions have softened, about 5 minutes.", " Add the sliced cabbage to the pot and stir to mix the cabbage with the onions. If you are using unsalted stock, sprinkle the cabbage with 1/2 teaspoon of salt. Add the canned whole tomatoes, with their juices, to the pot. Stir to combine.", " Add chicken stock to the pot. Bring to a simmer and taste for salt. Add more salt to taste. Lower the heat and cover the pot. Let simmer for 20 to 25 minutes or until the cabbage is thoroughly cooked.", "Sprinkle with freshly ground black pepper to serve.", " "]},
{"description": "Perfect comfort food! Cheesy mac and cheese with sharp cheddar, parmesan, and broccoli.", "title": "Broccoli Cheddar Mac and Cheese", "url": "http://www.simplyrecipes.com/recipes/broccoli_cheddar_mac_and_cheese/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/01/broccoli-cheddar-mac-cheese-horiz-a2-1800.jpg", "ingredients": ["1 bunch of broccoli, cut into florets", "Salt", "2 cups dry elbow macaroni", "4 Tbsp butter", "3 Tbsp all purpose flour", "3 cups milk (low fat or whole)", "1/2 teaspoon dry mustard", "Pinch of ground nutmeg", "1 1/2 teaspoons freshly grated black pepper", "1/4 teaspoon paprika", "1/2 teaspoon Worcestershire sauce", "2 cups (packed) grated sharp cheddar cheese (8 ounces), divided 1 1/2 cups and 1/2 cup", "1/2 cup grated Parmesan cheese"], "directions": [" Heat 4 quarts of water with 2 Tbsp salt in a large pot on high heat (for pasta). When the water comes to a boil, add the pasta and cook uncovered at a rolling boil for 2 minutes less than the time given on the pasta package instructions. (You want to cook the pasta al dente because it will continue to cook with the cheese mixture.) Rinse quickly in cold water to stop the cooking, drain and set aside.", " While the pasta water is coming to a boil, steam the broccoli. Put a steamer rack in a pot with an inch of water. Bring to a boil. Add the broccoli florets, sprinkle with a little salt, and cover. Steam for 4 minutes. Then remove the broccoli from the pot to a bowl.", " In a microwave or in a small pot on the stovetop, heat the milk until steamy. (Preheating the milk saves time in the next step when you are making the bechamel sauce.)", " at 500°F.", " Melt 4 Tbsp butter in a thick-bottomed oven-safe pot on medium high heat. When the butter is melted and starts to foam sprinkle with 3 Tbsp of flour. Whisk to combine. Lower the heat to medium and cook for 1 to 2 minutes.", " Pour in the hot milk and whisk vigorously to combine, breaking up any clumps of flour. Lower the heat to medium low and let cook, whisking frequently, until the sauce is smooth and thick enough to coat the back of a spoon.", "Stir in the dry mustard, paprika, nutmeg, black pepper, Worcestershire sauce, and 1 teaspoon of salt.", " Whisk in 1 1/2 cups grated cheddar and the 1/2 cup of Parmesan cheese. Stir until the cheese is melted and the sauce is smooth.", " Stir in the broccoli and the pasta until well combined. Sprinkle the remaining 1/2 cup grated cheddar cheese on top and place under preheated broiler for 5 to 7 minutes until bubbly and lightly browned.", "Add more salt and pepper to taste.", " "]},
{"description": "Cheesy lasagna with pesto and greens! Great make-ahead meal for the fridge or freezer.", "title": "Three-Cheese Pesto Lasagna", "url": "http://www.simplyrecipes.com/recipes/three_cheese_lasagna/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/08/2016-08-15-Pesto-Lasagna-16.jpg", "ingredients": ["4 cups lightly packed basil leaves (about 4 ounces)", "2 medium cloves garlic, chopped", "1/2 cup pine nuts", "1 cup grated Parmesan (about 3 ounces)", "1/4 cup extra virgin olive oil", "2 tablespoons freshly squeezed lemon juice", "1/2 teaspoon kosher salt (or slightly less this amount of table salt)", "1 tablespoon extra virgin olive oil", "2 medium cloves garlic, minced", "1/2 teaspoon red pepper flakes", "1/4 teaspoon freshly ground pepper", "2 cup sliced crimini or brown mushroom caps (about 6 ounces)", "1/4 teaspoon kosher salt (or slightly less this amount of table salt)", "1 tablespoon extra virgin olive oil", "4 cups loosely packed spinach", "4 cups loosely packed kale leaves, chopped", "1/2 teaspoon kosher salt (or slightly less this amount of table salt)", "2 tablespoons butter", "2 tablespoons flour", "2 cups milk", "1 cup grated Parmesan (about 3 ounces)", "2 large eggs", "15 to 16 ounce tub ricotta", "1 pound lasagna noodles", "2 teaspoons extra virgin olive oil, divided", "8 ounces mozzarella, sliced and torn into rough half moon pieces"], "directions": [" In the bowl of a food processor, pulse to combine the basil leaves, garlic, and pine nuts. Scrape down sides as needed. With the food processor running, and add the Parmesan, olive oil, lemon juice, and salt. Spoon into a bowl and cover tightly with plastic wrap. Set aside. (This makes about 1 1/2 cups of pesto.)", ": Set a large, deep-sided skillet over medium-low heat. Add 1 tablespoon olive oil, and then garlic, red pepper flakes, and pepper. Cook 1 minute, turn heat to medium, and add mushrooms and 1/4 teaspoon salt. Sauté mushrooms about 4 minutes, until they begin to release their water. Transfer to a bowl.", " In the same pan used to cook the mushrooms, over medium heat, add 1 tablespoon olive oil. Stirring often, add the spinach and kale in 4 batches, salting each as it goes in the pan. Cook until greens have cooked down completely, about 5 minutes. Squeeze to remove excess water and set greens in a bowl.", ": In a large saucepan, melt the butter over medium heat. Whisk in flour and then cook, whisking constantly, 3 minutes. Next, gradually whisk in milk, adding a splash at a time, allowing mixture to thicken between additions; this should take 5 to 7 minutes. Once all milk has been added, cook mixture, stirring frequently, for another 5 minutes. Remove from heat, and stir in 1 cup grated Parmesan.", ": Lightly beat eggs. Fold in ricotta. Set aside.", "Bring a large stockpot of water to a boil. Generously salt water and cook noodles until they are pliable but still have plenty of bite. Toss noodles with remaining teaspoon olive oil and set aside.", "Preheat oven to 425F. Grease a 9x13 baking pan with 1 teaspoon olive oil.", ": Arrange 4 cooked noodles lengthwise on the bottom of the baking dish. Spread half the ricotta mixture over noodles. Scatter half the greens over ricotta. Spoon 1 cup of cheese sauce over greens, scatter half the mushrooms, and dot with 1/2 cup pesto. Add another layer of noodles, and repeat layering.", "Add a final layer of noodles and top with the remaining 1/4 cup cheese sauce, dot with remaining 1/2 cup pesto, scatter mozzarella slices. Finish with a pinch each of salt and pepper.", "Set the lasagna on a tray to catch any drips and slide into hot oven. Cook 30 to 35 minutes, or until the filling is bubbling vigorously and the mozzarella is bubbly and golden brown in spots. Cool 15 minutes, slice, and serve.", "Cover with foil and reheat in a 350F oven for 20 to 30 minutes or until piping hot.", "Cook and cool the lasagna complete. Cover the dish with a piece of foil pressed against the surface and freeze for up to 3 months. To reheat, peel away the foil from the frozen lasagna and recover the pan (so the foil is no longer touching the lasagna but the pan is covered). Warm in a 350F oven for 70 to 90 minutes until the cheese has melted and the center is piping hot. Uncover in the last 10 minutes if you'd like a browner crust.", " Cook and cool the lasagna completely. Tightly wrap individual portions in aluminum foil, transfer to a sealable freezer bag or container, and freeze for up to 3 months. To reheat, unwrap the portions, transfer to an oven-safe dish, and cover with foil. Warm at 350F for 30 to 35 minutes, until the cheese has melted and the center of each portion is hot."]},
{"description": "Great side dish for the holidays! Roasted cubes of butternut squashed tossed with balsamic sautéed onions, kale, pecans, dried cranberries.", "title": "Roasted Butternut Squash Kale Sauté", "url": "http://www.simplyrecipes.com/recipes/roasted_butternut_squash_kale_saute/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2015/11/roasted-butternut-squash-saute-horiz-a-1600.jpg", "ingredients": ["4 cups 3/4-inch cubes of butternut squash (from about 1 3/4 pound whole small butternut squash)", "1 teaspoon olive oil", "1 teaspoon balsamic vinegar", "1/4 teaspoon salt", "Sprinkling of black pepper", "2 Tbsp olive oil", "1 large red onion, quartered and sliced (about 2 cups of sliced red onions)", "3 cloves garlic, minced (about 1 Tbsp)", "1 teaspoon balsamic vinegar", "6 cups thinly (3/4-inch) sliced kale (center ribs removed) (from about 1 bunch of kale)", "1/3 cup dried sweetened cranberries", "1/2 cup slightly broken up pecans", "Salt and pepper to taste"], "directions": [" Preheat oven to 425°F. Place cubed butternut squash in a bowl and toss with olive oil, balsamic vinegar, salt and pepper. Spread out onto a lined baking sheet. Roast in oven for 25 minutes or until the squash is cooked through and browned on the edges.", " 15 minutes into roasting the butternut squash, start on the onions. Heat olive oil on medium high heat in a thick-bottomed 4 to 5 quart pot. Add the sliced red onion and toss to coat. Let cook for 7 to 8 minutes until softened. Add the garlic and cook a minute more.", " Add the balsamic vinegar and the shredded kale. Stir until the kale is mixed well with the onions (it helps to use tongs to turn over the kale). Let cook for a minute or two until the kale is just wilted (don't overcook).", " Then stir in the roasted butternut squash, the dried sweetened cranberries, and pecans. Add salt and pepper to taste."]},
{"description": "Quick, easy, healthy shrimp arugula salad with white beans and cherry tomatoes! Takes 20 min to make. Mediterranean diet.", "title": "Shrimp, Arugula, White Bean, Cherry Tomato Salad", "url": "http://www.simplyrecipes.com/recipes/shrimp_arugula_white_bean_cherry_tomato_salad/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/08/shrimp-arugula-bean-salad-horiz-a-1600.jpg", "ingredients": ["1 pound 16-20 count shelled and deveined shrimp", "2 Tbsp olive oil", "2 15-ounce cans cannellini white beans, rinsed and drained", "1 cup cherry tomatoes, halved or quartered", "1/2 cup finely diced red onion", "3/4 teaspoon grated lemon zest", "3 handfuls baby arugula leaves", "3 Tbsp red wine vinegar", "1/2 cup olive oil", "2 cloves minced garlic", "1/2 teaspoon salt", "1/4 teaspoon black pepper"], "directions": [" Heat a large cast iron skillet or griddle on high heat. Add 2 Tbsp of olive oil to coat the pan. When the oil is hot, working in batches of half of the shrimp at a time, add the shrimp and sauté a minute on each side to sear. (You can also grill the shrimp if you prefer.)", "When the shrimp are barely cooked through, remove from the pan and set aside to cool. (The shrimp will continue to cook for a little bit after you remove them from the pan, and you don't want overcooked rubbery shrimp.)", " Put the drained beans, cut cherry tomatoes, diced onion, lemon zest, and arugula leaves into a large bowl. Fold in the shrimp.", " In a small bowl, whisk together the red wine vinegar, olive oil, garlic, salt and pepper.", "Gently fold the dressing into the salad and serve!"]},
{"description": "Poach delicious salmon steaks or fillets in only 15 minutes! Salmon poached in white wine, seasoned with fresh dill.", "title": "Poached Salmon", "url": "http://www.simplyrecipes.com/recipes/poached_salmon/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2014/12/poached-salmon-horiz-a-1600.jpg", "ingredients": ["1 to 1½ pounds salmon fillets, pin bones removed", "Salt", "½ cup dry white wine (a good Sauvignon Blanc)", "½ cup water", "1 shallot, peeled and thinly sliced or a few thin slices of onion", "Several sprigs of fresh dill or sprinkle of dried dill", "A sprig of fresh parsley", "Freshly ground black pepper", "A few slices of fresh lemon to serve"], "directions": [" Sprinkle the salmon fillets with a little salt. Put the wine, water, dill, parsley and shallots or onions in a sauté pan, and bring to a simmer on medium heat.", " Place salmon fillets, skin-side down on the pan. Cover.", "Cook 5 to 10 minutes, depending on the thickness of the fillet, or to desired done-ness. Do not overcook. Serve sprinkled with freshly ground black pepper and a slice or two of lemon.", " "]},
{"description": "This slow cooker taco soup with ground beef is so easy - and SO GOOD! Perfect for busy weeks. Flexible cooking times.", "title": "Slow Cooker Taco Soup", "url": "http://www.simplyrecipes.com/recipes/slow_cooker_taco_soup/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/10/2016-10-25-TacoSoup-16.jpg", "ingredients": ["1 tablespoon olive oil", "1 pound (450g) lean ground beef", "1 1/2 cups (180g) diced yellow or red onions", "2 to 3 cups (475ml to 710ml) chicken or beef broth (use more if you want a thinner soup)", "1 15-oz. (425g) can diced tomatoes", "1 15-oz. (425g) can black beans, drained and rinsed", "1 15-oz. (425g) can kidney beans, drained and rinsed", "1 4-oz. (115g) can chopped green chiles", "1 1/4 cups (135g) corn kernels, fresh or frozen", "2 1/2 teaspoons chili powder", "1 teaspoon ground cumin", "1 teaspoon paprika", "1 teaspoon salt", "Tortilla chips, lightly crushed", "Sour cream", "Chopped cilantro", "Finely diced red onion", "Lime juice", "Chopped red onions", "4-quart or larger "], "directions": [": Heat the olive oil in a large skillet or sauté pan over medium-high heat. Add beef and onions and cook 2 to 3 minutes, until the ground beef is browned but not completely cooked and the onions are starting to look soft around the edges. Use your spatula to break up the ground beef into smaller pieces as it cooks. Remove from heat and use immediately, or refrigerate for a day or two until needed.", "It's fine if the soup cooks a little longer or the slow cooker switches to the \"warm\" setting.", "Serve soup in bowls and top with crushed tortilla chips, sour cream, cilantro, red onion and lime juice.", "This soup will keep refrigerated for 1 week or frozen for up to 3 months."]},
{"description": "Healthy and satisfying weeknight frittata with potatoes, onions, red peppers, spinach, and ground turmeric.", "title": "Frittata with Potatoes, Red Peppers, and Spinach", "url": "http://www.simplyrecipes.com/recipes/frittata_with_potatoes_red_peppers_and_spinach/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/08/2016-08-22-PotatoFrittata-12.jpg", "ingredients": ["6 large eggs", "1/4 cup (60ml) milk", "2 1/2 tablespoon olive oil", "3/4 teaspoon ground turmeric", "1/2 cup diced red onions", "2 cloves garlic, minced", "8 ounces (225g) fingerling potatoes, thinly sliced down their length", "1 medium red pepper, seeded and diced", "1 scallion, thinly sliced", "1 cup baby spinach", "Freshly ground black pepper"], "directions": [" Set aside.", ": Heat olive oil in a 10-inch oven-safe skillet or pan over medium heat. Add the turmeric and stir so that turmeric dissolves into the oil.", "Add diced onions and cook, stirring occasionally, until they start to soften, about 2 minutes. Add minced garlic and stir for 30 seconds.", ": Add the potatoes and a generous pinch of salt and cook, stirring occasionally, until some of the slices start to brown, 5 to 6 minutes.", "Add the red pepper and cook until they start to soften, about 2 minutes. Add scallions and spinach leaves and cook until the leaves start to wilt, stirring occasionally.", " and reduce heat to medium-low. Cook until the eggs start to set on the bottom, about 2 to 3 minutes.", " Remove skillet from oven with oven mitts. Let frittata cool for 5 minutes before serving. Cut into wedges and season with more salt and some ground pepper, if desired.", "Frittata will keep refrigerated for 5 days. Leftovers can be eaten chilled or briefly warmed in the microwave."]},
{"description": "Teriyaki Chicken Lettuce Wraps make an easy, light meal any night of the week. Skip ordering take-out and make these instead!", "title": "Teriyaki Chicken Lettuce Wraps", "url": "http://www.simplyrecipes.com/recipes/teriyaki_chicken_lettuce_wraps/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/06/2016-07-6-Teriyaki-Chicken-6.jpg", "ingredients": ["¼ cup (60 ml) low-sodium soy sauce (or tamari, for gluten-free)", "3 tablespoons water, divided", "2 tablespoons mirin", "2 tablespoons honey", "2 medium cloves garlic, minced", "1 teaspoon grated fresh ginger", "1 teaspoon cornstarch", "2 tablespoon olive oil, divided", "½ cup diced red onions (1/4 of a large red onion, or 1/3 of a small one)", "1 pound (450 g) ground chicken", "Kosher salt", "1 medium zucchini, diced", "1 medium red bell pepper, seeded and diced", "1 scallion, thinly sliced", "½ teaspoon sesame oil", "1 head butter lettuce, leaves separated and rinsed", "Roasted peanuts, chopped", "Chopped cilantro", "Thinly sliced scallions"], "directions": [": Combine the soy sauce, 2 tablespoons of the water, mirin, honey, minced garlic and grated ginger in a saucepan. ", "Dissolve the cornstarch with the remaining tablespoon of water and add to the teriyaki sauce. Reduce heat to medium-low, and let the sauce simmer until it starts to thicken, about 30 seconds to a minute.", "Turn off the heat and allow the sauce to cool. The sauce will thicken a little more as it cools. You should have about 1/2 to 3/4 cup of sauce.", ": Heat 1 tablespoon of olive oil in a sauté pan over high heat. Add half of the diced red onions and cook until they start to soften, about 2 minutes. Add ground chicken and a pinch of kosher salt. Using your spatula, break up chicken into smaller pieces. Stir occasionally until the chicken is cooked through, 5 to 7 minutes. Transfer the chicken to a clean plate.", ": Quickly wipe down the pan and heat another tablespoon of olive oil over medium heat. Add the remaining diced red onions and cook until they soften, about 2 minutes. Add the zucchini and red pepper, and cook, stirring occasionally, until the peppers start to soften, 3 to 4 minutes. Stir the sliced scallions and cooked chicken into the pan with cooked vegetables.", "Drizzle 6 tablespoons of the prepared teriyaki sauce and ½ teaspoon sesame oil into the pan and stir. Save the rest of the teriyaki sauce for drizzling over wraps. Turn off heat, taste, and adjust seasonings if needed.", ", place several spoonfuls of filling onto a lettuce leaf. Top with chopped peanuts, cilantro, scallions, and an extra drizzle of teriyaki sauce, if desired. Leftover teriyaki sauce will keep for about a week in the refrigerator."]},
{"description": "Fresh and healthy lettuce wrap with poached salmon, cucumber jicama, and ginger.", "title": "Salmon Lettuce Wraps with Cucumber, Jicama, and Ginger", "url": "http://www.simplyrecipes.com/recipes/salmon_lettuce_wraps_with_cucumber_jicama_and_ginger/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2014/06/salmon-lettuce-wraps-horiz-a-1600.jpg", "ingredients": ["12 ounces skinless salmon fillets, cut into two even pieces", "1/2 teaspoon Kosher salt for marinade", "1 teaspoon grated fresh ginger root", "4 cups water", "1 1/2 teaspoons Kosher salt for poaching liquid", "Slice of lemon", "Olive oil", "Lemon juice", "3/4 cup of seeded, diced, thin-skinned (English or Persian) cucumber, peel-on (you can also use regular cucumbers that have been peeled)", "2/3 cup peeled, small diced jicama", "1/4 thinly sliced red onion", "3 Tbsp chopped fresh cilantro", "2 Tbsp fresh lime juice", "2 teaspoons grated fresh ginger", "1 Tbsp chopped fresh mint", "1/2 teaspoon Kosher salt", "1 ripe avocado", "6 large leaves of butter lettuce"], "directions": [" Rub with 1/2 teaspoon Kosher salt and a teaspoon of grated ginger. Set in refrigerator to chill for 30 minutes, while you prep the other ingredients.", " In a medium bowl, gently combine the diced cucumbers, jicama, red onion, cilantro, lime zest, lime juice, grated ginger, chopped mint, and salt. Set aside for the flavors to blend.", " Prepare salmon poaching liquid. Place water, salt, and a slice of lemon in a pot wide enough to hold the salmon fillets. Bring to a boil and let simmer for about 5 minutes.", "Add the salmon fillets that have been marinating in ginger and salt to the poaching liquid. Return to a simmer and cook for about 4 minute at a very low simmer.", "When just cooked through, remove from poaching liquid and place in a bowl. Toss with a teaspoon of olive oil and a teaspoon of lemon juice. Once the salmon has cooled to touch, break up gently into large flakes.", " Slice the avocado. On to each butter lettuce leaf, place a few chunks of salmon, a large spoonful of the cucumber jicama mixture, and top with some slices of avocado.", "Fold up the lettuce wrap and eat!"]},
{"description": "Crispy fried catfish fillets coated in a seasoned cornmeal crust!", "title": "Fried Catfish", "url": "http://www.simplyrecipes.com/recipes/fried_catfish/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2012/07/fried-catfish-horiz-1600.jpg", "ingredients": ["4-6 catfish fillets, about 1-2 pounds", "1 cup milk or buttermilk", "Salt", "3/4 cup fine cornmeal (do not use coarsely ground cornmeal)", "1/2 cup flour", "1 teaspoon garlic powder", "1 teaspoon black pepper", "1 teaspoon paprika", "1/2 teaspoon cayenne", "1/4 teaspoon celery seed", "Oil for frying (use peanut oil if you can)"], "directions": [" In a heavy frying pan (I prefer to use cast iron), pour enough oil to come 1/2 inch up the sides of the pan. Heat the pan on medium-high.", "Heat your oven to 200°F and lay a cookie sheet inside. Place a wire rack on top of the cookie sheet.", " While the oil is heating, soak the catfish in the milk or buttermilk.", " Mix the cornmeal, flour and spices together. (Or you can substitute your favorite seasoning instead.) Place in a shallow dish for dredging.", " Let the oil reach 350°F — a good test is to flick a little of the dry breading into the oil, and if it sizzles at once, you're good to go.", "Once the oil is hot, sprinkle the catfish fillets with salt and dredge them into the breading. Shake off the excess and gently lay into the hot oil.", "Fry until golden brown, about 2-4 minutes, depending on how thick the fillet is. Use a metal spatula and gently turn the fish over and cook for another 2-4 minutes.", "Cast iron heats up and stays hot, so monitor the heat as you fry; you may need to lower the heat on the burner at some point.", " Once the fish is ready, move it to the oven while you cook the rest of the catfish. Keeping the fried catfish warm in the oven will help keep it crispy.", "When they're all done, serve at once with your favorite hot sauce, cole slaw and some hush puppies."]},
{"description": "Cheesy cauliflower gratin with nutty Gruyere cheese, sautéed leeks, and butter toasted breadcrumb topping!", "title": "Cauliflower Gratin", "url": "http://www.simplyrecipes.com/recipes/cauliflower_gratin/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/03/cauliflower-gratin-horiz-a-1200.jpg", "ingredients": ["1 head cauliflower, cored, broken into bite-sized florets", "2 medium-small leeks, cleaned, halved lengthwise, sliced into 1/4-in thick slices, white and light green parts only, about 2 cups", "2 Tbsp butter", "2 Tbsp all purpose flour", "1 1/3 cups milk", "4 ounces Gruyere cheese, grated", "1 teaspoon minced fresh thyme or 1/2 teaspoon dried thyme", "1/8 teaspoon grated nutmeg", "1 teaspoon salt", "Pepper", "1 1/2 cups fresh breadcrumbs (3 slices of sandwich bread or rustic bread, pulsed in a food processor)", "1 Tbsp butter", "1/4 teaspoon salt", "Pepper"], "directions": [" Melt butter on medium heat in a medium sized saucepan. Add the sliced leeks and gently cook until completely softened, about 8 to 10 minutes.", " While the leeks are cooking, place cauliflower florets in a steamer basket in a saucepan over an inch of water. Bring water to a boil, cover, and steam the cauliflower for 3 to 4 minutes.", "The steaming should just take the rawness out of the cauliflower, but not cook it so much that it is tender. You want the cauliflower at this stage to be al dente. Remove strainer and cauliflower from hot pan and set aside.", " Add 2 Tbsp of flour to the leeks and butter. Stir and let cook for a minute or two. Slowly add the milk, stirring as you add it to break up any lumps. Bring to a low simmer and continue to stir as the sauce thickens.", " Once the sauce is thick enough to coat the back of a spoon, stir in 3 ounces of the shredded cheese (reserving the rest of the cheese for the topping), the thyme, nutmeg, and salt.", " Spread a teaspoon of butter over the insides of a 2-quart gratin dish. Place the lightly steamed cauliflower florets in an even layer in the dish. Pour the leek and cheese sauce over the cauliflower. Top with remaining cheese.", " While the gratin is baking, melt 1 Tbsp of butter in a small sauté pan on medium high heat. Add the fresh breadcrumbs and toast in the melted butter for 4 to 5 minutes, until lightly browned. Sprinkle with 1/4 teaspoon of salt, and a sprinkling of pepper. Remove from heat.", " After the gratin has baked for 25 minutes, remove it from the oven. Sprinkle toasted breadcrumbs over the top and return to the oven. Bake for 5 more minutes."]},
{"description": "How to poach an egg, with great results every time. It's easy!", "title": "Easy Poached Eggs", "url": "http://www.simplyrecipes.com/recipes/easy_poached_eggs/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2003/07/easy-poached-eggs-600.jpg", "ingredients": ["Fresh eggs", "Saucepan with cover", "Slotted spoon"], "directions": [" Fill a saucepan with a couple inches of water. Heat the water on high until it reaches a bare simmer and bubbles start appearing at the bottom of the pan, or bring the water to a boil and then lower the heat until the water is at a bare simmer (just a few bubbles coming up now and then).", " Working with the eggs one at a time, crack the egg into a small bowl or cup. Place the bowl close to the surface of the hot water and gently slip the egg into the water.", "If you want, use a spoon to push some of the egg whites closer to their yolks, to help them hold together. Add all of the eggs you are poaching to the pan in the same way, keeping some distance between them.", "Turn off the heat and cover the pan. Set a timer for 4 minutes (or count out loud to 60, four times). At this point the egg whites should be completely cooked, while the egg yolks are still runny.", "Note that the timing depends on the size of the eggs, and if you are cooking at altitude, so adjust accordingly. If you are at altitude, or want firmer egg yolks, you may need to cook them longer. If you try 4 minutes and the eggs are too cooked, reduce the time.", " Gently lift the poached eggs out of the pan with a slotted spoon and place on a plate to serve.", "To help the eggs keep from spreading too much some people have good results by placing a mason jar ring in the pan. Put a mason jar ring in the bottom of the pan and fill the pan with water to just above the mason jar ring. Slip the raw egg into the water over the mason jar ring and let it settle in the ring. Then turn off the heat and cover the pan.", "One way to help your poached egg whites stay together is to remove some of the thin wispy egg whites before you add your eggs to the hot water. An easy way to do this is with a fine mesh sieve.", " Place the raw egg into a fine mesh sieve over a bowl. The very thin egg whites will drain out through the sieve. Then gently pour the raw egg into your pot of hot water.", " Notice how there is much less stray egg whites with this method. Turn off the heat and cover the pot (or just lower the heat to low), and cook for 4 minutes until the whites are cooked through. Remove from the pot with a slotted spoon.", "If you don't want to futz around with trying to keep the eggs from spreading or bumping into each other, the easiest way to make poached eggs is with an ", ".", "The \"poacher\" is actually coddling the eggs, not truly poaching them, but if what you want is an egg with a cooked white and runny yolk, this is an easy way to do it.", "To use an egg poaching pan, remove the cups from the pan that you intend to use.", "Fill the pan with only 1/2-inch of water and bring it to a low boil. Put a drop or so of olive oil in each of the egg cups you are using and spread around. (The cups are stick-free, but the oil helps.)", "Crack the eggs into the egg cups, one egg per cup. Place the egg filled cup back in the slot for it in the pan.", "Cover the pan and cook for 4 minutes.", "Remove from heat and carefully lift the egg cups out of the pan. Slide the cooked eggs out of the cups onto serving plates or bowls."]},
{"description": "Filling, delicious, and affordable, this turkey stew is made with turkey thighs or legs, slow cooked with onion, celery, carrots and other root vegetables.", "title": "Turkey Stew with Root Vegetables", "url": "http://www.simplyrecipes.com/recipes/turkey_stew_with_root_vegetables/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2012/02/turkey-stew-root-vegetables-horiz-a-1600.jpg", "ingredients": ["2 Tbsp olive oil", "3 lbs turkey thighs (preferred) or legs (skin on, bone in)", "1 medium-large yellow onion, peeled and roughly chopped (about 1 1/2 cups)", "2 stalks celery, roughly chopped (about 1 1/2 cups)", "2 teaspoons salt", "1 quart (4 cups) chicken, turkey, or vegetable stock", "2 medium carrots, peeled, 1/4 inch slices (about 1 1 /4 cups)", "1-2 medium turnips, peeled, 1/2 inch cubes", "1 medium rutabaga, peeled, halved, cut into 1/4 inch thick slices", "3 medium Yukon Gold potatoes, peeled and quartered", "1 teaspoon herbes de provence*", "Freshly ground black pepper"], "directions": [" Preheat oven to 300°F. Heat ", " on medium high heat in a Dutch oven on the stove top. Wash and pat dry turkey pieces. Working in batches if necessary, brown the ", " ", ", first skin side down, 2-3 minutes on each side. Sprinkle the thighs with a little ", " as you brown them.", " Once the thighs have browned, remove them from the pan and set them in a bowl. Add the ", " and ", " to the pot. Cook for about 5 minutes or so, until the onions are translucent and starting to brown at the edges. Return the turkey thighs to the pot.", " Add 2 teaspoons of ", " and ", ". Bring to a simmer, remove from the stove top and put in the oven, covered, for an hour and fifteen minutes.", " After an hour and fifteen minutes, remove from oven and add the rest of the vegetables—", ", ", ", ", ", and ", ", the ", ", and the rest of the stock. Return to the oven, covered, and cook until tender, another 45 minutes or more.", " Remove the turkey thighs from the stew and place in a bowl to cool. When cool enough to handle, strip the meat off the bones. Discard the bones and skin. Cut the meat into bite-sized pieces (1 1/2-inches or so chunks) and return to the pot.", "Sprinkle with ", " and add more salt to taste."]},
{"description": "Ever eat cactus? Nopalitos are so GOOD! This easy, budget-friendly salad is a classic Mexican cactus salad with chopped prickly pear cactus paddles (nopalitos), tomatoes, onions, and radishes.", "title": "Nopalitos Cactus Salad", "url": "http://www.simplyrecipes.com/recipes/nopalitos_cactus_salad/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/05/nopalitos-cactus-salad-horiz-a-1600.jpg", "ingredients": ["1 lb (450 g) fresh chopped nopalitos", "1 lb cherry tomatoes, quartered (about 3 cups)", "1 cup chopped red radishes", "1 cup finely chopped red onion", "3 Tbsp lime juice", "1 Tbsp olive oil", "1 1/2 teaspoons salt", "1/4 teaspoon freshly ground black pepper", "1/2 cup chopped cilantro"], "directions": [" Bring a medium pot of salted water to a boil. Add the nopalitos, return to a rolling boil and cook for 1 minute. Strain through a fine mesh sieve. Rinse with water for 1 minute.", " Place rinsed and drained nopalitos in a bowl with the chopped tomatoes, radishes, and onion. Toss with lime juice, olive oil, salt, and pepper. Fold in cilantro."]},
{"description": "Easy Chinese sweet and spicy mushroom stir fry with peas and green onions! Takes only 30-minutes to make, healthy too!", "title": "Mushroom Stir Fry with Peas and Green Onions", "url": "http://www.simplyrecipes.com/recipes/sweet_and_spicy_mushroom_stir_fry/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2012/01/mushroom-stir-fry-peas-horiz-b-1600.jpg", "ingredients": ["1/4 cup chicken or vegetable stock (use vegetable stock for vegetarian option)", "1 tablespoon honey", "1 teaspoon soy sauce (use gluten-free soy sauce if cooking gluten-free)", "1/2 cup chicken or vegetable stock (use vegetable stock for vegetarian option)", "3 tablespoons soy sauce (use gluten-free soy sauce if cooking gluten-free)", "1/4 cup honey", "1 tablespoon rice vinegar", "1 tablespoon shaoxing cooking wine or cooking sherry", "1 tablespoon cornstarch", "4 garlic cloves, sliced thinly", "1 tablespoon grated ginger", "2-5 dried red chilies, roughly chopped OR 1/4-1/2 teaspoon dried chili flakes", "3 tablespoons sesame, grapeseed, or other high smoke-point oil", "2 lbs. of mixed mushrooms (oyster, crimini, button, shiitake, and/or enoki), roughly chopped or quartered (you want bite-sized pieces)", "1 1/2 cups of snow peas or snap peas, de-stringed", "8 green onions, chopped", "Toasted sesame seeds (optional)"], "directions": [" Make the glaze by whisking together the stock, honey, and soy sauce in a bowl and set aside. Make the sauce by whisking together the stock, soy sauce, honey, rice vinegar, cooking wine or sherry, and the cornstarch in a bowl and set that aside as well.", " Place 1 tablespoon of oil in a large skillet or a wok over high heat. When the oil is glistening and a bead of water evaporates in under a second, add the mushrooms and toss.", "Allow the mushrooms to cook for a few minutes until they start to squeak and give up their water (you'll see their water in the pan). When they do add the glaze. Allow the glaze to boil off, stirring occasionally, about 5-6 minutes.", "When barely any more liquid remains take the mushrooms off the heat and set them aside in a bowl. There may be bits of sugar caramelized to the side of the pan, don't fret about it.", " Reduce the heat to medium and add the remaining 2 tablespoons of oil. Add the garlic, ginger, and chilies and cook until fragrant, about 30 seconds.", ": Add the snow peas and green onions and toss for about 30 more seconds.", " Increase heat to high. Add the sauce and allow the mixture to come to a boil. The sauce will thicken considerably.", "Add the mushrooms back to the mixture and cook for about 20 more seconds. Take off the heat.", "Serve over rice and garnish with sesame seeds if using."]},
{"description": "A creamy holiday oyster stew with oysters, milk, butter, onions, celery, parsley, and a dash of Tabasco.", "title": "Oyster Stew", "url": "http://www.simplyrecipes.com/recipes/oyster_stew/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2011/03/oyster-stew-alt-landscape.jpg", "ingredients": ["5 Tbsp unsalted butter", "1 pint oysters with their liquor, jarred or freshly shucked, about 2 dozen*", "1/4 cup flour", "2 celery stalks, minced", "1 medium yellow or white onion, minced", "1 3/4 cup milk", "1/4 cup cream (can use all milk if you want)", "Splash of Tabasco, Crystal, or other hot sauce", "Salt", "Freshly ground black pepper", "1/2 cup parsley, minced"], "directions": [" Strain the oyster juice through a fine-meshed sieve into a bowl to remove any grit. Reserve the juices. Rinse the oysters well, under cold water. Put them in a bowl.", " Melt the butter in a pot over medium heat. Add the flour and stir to make a roux. Reduce the heat to medium-low and cook the mixture for a few minutes, stirring often.", " When the roux turns the color of coffee-with-cream, stir in the celery and onions. Increase the heat to medium and cook for 2-3 minutes, stirring frequently.", " Add the oyster juice and any juices the oysters in the bowl have released. The flour in the roux will absorb the liquid and turn into a paste. Slowly add the milk and cream, stirring to incorporate as you pour them in. Add a healthy splash or two of hot sauce, to taste.", " Heat the soup to steamy, but below a simmer, over low heat, cook for 15 minutes. (Do not let the soup boil!)", " If you are working with large oysters, you may want to chop them into bite-sized pieces. Add the oysters and cook for another 2 minutes, or until the edges of the oysters just begin to curl.", "If you want the stew to be more like a smooth soup, purée until smooth.", "Add salt and freshly ground black pepper to taste. Garnish with fresh chopped parsley to serve."]},
{"description": "Slow-cooked chicken drumsticks coated in Ethiopian style berbere spice.", "title": "Chicken Drumsticks, Ethiopian Style", "url": "http://www.simplyrecipes.com/recipes/chicken_drumsticks_ethiopian_style/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2012/07/ethiopian-chicken-drumsticks.jpg", "ingredients": ["3-4 pounds chicken legs, thighs or wings", "2 Tbsp peanut oil, or melted butter (or ghee)", "Salt", "Lemons or limes for serving", "2 Tbsp sweet paprika", "1 Tbsp hot paprika, or 1-2 teaspoons cayenne", "2 teaspoons garlic powder", "1 teaspoon ground ginger", "1 teaspoon ground cumin", "1 teaspoon onion powder", "1 teaspoon black pepper", "1 teaspoon ground fenugreek", "1/2 teaspoon salt", "1/2 teaspoon ground cardamom", "1/4 teaspoon ground cloves"], "directions": [" Preheat oven to 325°. Coat the drumsticks in the peanut oil or melted butter, then sprinkle with salt.", " Mix all the spices together in a small bowl. In a large bowl, mix half of the spice mix with the chicken, then arrange the drumsticks in a casserole dish lined with enough foil to make a package; you will be cooking these legs covered for most of the time.", " Sprinkle more of the spice mix over the drumsticks. You can use all of the spice mix, or stop whenever you want. The more mix, the spicier the chicken. Fold over the foil to seal up the drumsticks and bake for 90 minutes.", " At 90 minutes, open up the foil packet to let the chicken continue to cook uncovered. Continue cooking for at least another 15 minutes, and as long as you like. I like the meat to almost fall off the bone on my drumsticks, so I cook uncovered for another 30-45 minutes.", " To serve, baste with a little of the sauce that forms at the bottom of the pan, and use the rest to flavor some rice or flatbread. Squeeze some lemon or lime juice over the chicken right before you serve it. A green salad is a good side dish, too."]},
{"description": "Classic Boston brown bread studded with raisins and steamed in a coffee can.", "title": "Boston Brown Bread", "url": "http://www.simplyrecipes.com/recipes/boston_brown_bread/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2011/03/boston-brown-bread-horiz-a-2000.jpg", "ingredients": ["Butter for greasing loaf pans or coffee cans", "1/2 cup (heaping) all-purpose flour", "1/2 cup (heaping) rye flour", "1/2 cup (heaping) finely ground corn meal (must be finely ground)", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/2 teaspoon allspice", "1/2 cup molasses (any kind)", "1 cup buttermilk", "1 teaspoon vanilla extract (optional)", "1/2 cup raisins (optional)", "One metal 6-inch tall by 4-inch diameter coffee can, or a 4x8 loaf pan"], "directions": [" You can either make the bread on the stovetop with a coffee can, or you can make it in the oven with a coffee can or loaf pan.", " If you are using the stovetop method, set the steamer rack inside a tall stockpot and fill the pot with enough water to come 1/3 of the way up the sides of your coffee can. Turn the burner on to medium as you work.", " If you are using the oven method, preheat the oven to 325° and bring a large pot of water to a boil.", " Grease a coffee can or small loaf pan with butter.", " In a large bowl, whisk together the all-purpose flour, rye flour, corn meal, baking powder and soda, salt and allspice. Add the raisins if using.", " In another bowl, mix together the buttermilk and vanilla extract if using. Whisk in the molasses.", "Pour the wet ingredients into the dry and stir well with a spoon.", " Pour the batter into the coffee can or loaf pan taking care that the batter not reach higher than 2/3 up the sides of the container.", "Cover the loaf pan or coffee can tightly with foil.", " If you are using the stovetop method, set the can in the pot on the steamer rack. Make sure there is enough water in the pot to come up 1/3 of the way up the sides of your coffee can or loaf pan. Cover the pot and turn the heat to high.", " If you are using the oven method, find a high-sided roasting pan that can hold the coffee can or loaf pan. Pour the boiling water into the roasting pan until it reaches one third up the side of the coffee can or loaf pan. Put the roasting pan into the oven.", " Steam the bread on the stovetop or in the oven for at least 2 hours and 15 minutes.", "Check to see if the bread is done by inserting a toothpick into it. If the toothpick comes out clean, you're ready. If not, re-cover the pan and cook for up to another 45 minutes.", " Remove from the stovetop or oven and let cool for 10 minutes before putting on a rack. Let the bread cool for 1 hour before turning out of the container.", "Slice and eat plain, or toast in a little butter in a frying pan."]},
{"description": "Long and crunchy Chinese green beans, quickly stir-fried Sichuan style with red chilies, Sichuan peppercorns, and sesame oil.", "title": "Sichuan Style Stir-Fried Chinese Long Beans", "url": "http://www.simplyrecipes.com/recipes/sichuan_style_stir-fried_chinese_long_beans/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2010/10/chinese-green-beans.jpg", "ingredients": ["1/2 pound Chinese long beans", "1 tablespoon peanut oil (sesame or vegetable can suffice)", "4-6 dried chilies, preferably Sichuanese, roughly chopped", "1 teaspoon whole ", ",", " lightly crushed", "1/4 teaspoon salt", "1/2 teaspoon sugar", "3 teaspoons sesame oil", "Splash of soy sauce (use gluten-free soy sauce for gluten-free option)"], "directions": [" Add a tablespoon of peanut oil to a wok or a large sauté pan over medium heat and swirl until hot. Add chilies and peppers and stir-fry briefly until fragrant. ", " Add the long beans and stir-fry vigorously for 3-4 minutes (you don't want the spices to burn, if they start to then turn down the heat a bit). Season with salt and sugar and stir-fry a few seconds more to mix it all together. ", " Remove from heat. Stir in the sesame oil and soy sauce. Serve immediately."]},
{"description": "These Spicy Paleo Pumpkin Muffins are grain-free and vegetarian. Perfect grab-and-go breakfast! ", "title": "Spicy Paleo Pumpkin Muffins", "url": "http://www.simplyrecipes.com/recipes/spicy_paleo_pumpkin_muffins/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2016/09/2016-09-28-Paleo-Muffins-7.jpg", "ingredients": ["2 1/2 cups almond flour", "3/4 cup tapioca starch", "1 1/2 tablespoons coconut flour", "1 teaspoon baking soda", "1 1/2 teaspoons baking powder", "1/2 tablespoon smoked paprika", "1 teaspoon crushed chili flakes (I used chipotle chili flakes)", "1 1/2 teaspoons ground cumin", "1/2 teaspoon salt", "4 large eggs", "1/2 cup olive oil, melted ghee, or melted butter", "2 tablespoons honey", "1 tablespoon red wine vinegar", "1 packed cup grated raw sugar or pie pumpkin (avoid jack-o-lantern pumpkins)", "1/2 cup diced red bell pepper", "1/2 cup diced onion", "3/4 cups toasted pepitas or pumpkin seeds (divided)"], "directions": [" Line a muffin tin with muffin papers", " Sift together the almond flour, tapioca starch, coconut flour, baking soda, baking powder, spices, and salt. I like to sift at least twice with Paleo baked goods to make sure there are no clumps and everything is well-mixed.", "In a separate bowl, beat the eggs, then whisk in the oil, honey, and vinegar.", " Save the rest of the pepitas for topping. Rest the batter for at least 10 minutes so that the flours can hydrate.", " Top each muffin with a few of the remaining 1/4 cup of pepitas.", " When done, the muffins should look toasted around the edges, be dry on top, and a toothpick inserted in the middle will come out clean.", " Transfer the muffins to a cooling rack. Cool briefly before serving, or cool completely and store in an airtight container at room temperature for 3 days (or refrigerate for up to a week)."]},
{"description": "Bright green and gently garlicky pesto made with parsley and spring ramps.", "title": "Ramp and Parsley Pesto", "url": "http://www.simplyrecipes.com/recipes/ramp_and_parsley_pesto/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2010/04/ramp-pesto.jpg", "ingredients": ["2/3 cup walnuts", "1/2 cup olive oil", "1/2 cup grated parmiggiano-reggiano cheese (you could also use pecorino)", "1 small bunch parsley", "1 small bunch ", " or thin green garlic", "Pinch of salt"], "directions": [" Toast the walnuts in a dry frying pan over medium heat, tossing from time to time, until you can smell them, about 5-7 minutes.", " Bring a large kettle of salty water to a rolling boil. Fill a large bowl with ice water. Blanch the parsley in the boiling water for 1 minute, then submerge it in the ice water (shocking the parsley with ice water will keep it bright green). Cut off the leaves of the ramps, leaving the white parts for another use (see sautéed ramps with truffle salt recipe). Blanch the ramp leaves in the boiling water for 30 seconds. Douse in the ice water.", " Drain the parsley and ramp leaves, then put them in a kitchen towel. Wrap the towel around the greens, and twist one end of the towel one way, and the other end of the towel the opposite way. Wring out the parsley and ramps tightly. You want as much water as you can to drain away.", " Chop the parsley and ramps well and put into the bowl of a food processor. Chop the walnuts well and put them in, too. Add the parmiggiano cheese and a healthy pinch of salt. Buzz the mixture together a few times, then, with the motor running, drizzle in the olive oil slowly. Stop the food processor immediately after the oil is incorporated. Taste for salt, and add if needed.", "Serve within a couple days. For storage, keep covered in the fridge with a thin layer of olive oil over it. Freeze if you will have any left over after 3 days."]},
{"description": "Simple shrimp risotto, in the Venetian style, with tiny pink shrimp, shallots, parsley and lemon zest.", "title": "Shrimp Risotto", "url": "http://www.simplyrecipes.com/recipes/shrimp_risotto/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2010/04/shrimp-risotto.jpg", "ingredients": ["1 cup risotto rice (Arborio or if you can get it, Carnaroli or ", ")", "3 tablespoons butter", "1 large shallot, finely chopped", "1 cup dry white wine (Sauvignon Blanc)", "8 ounces clam juice or fresh seafood stock", "2 cups of the smallest pink shrimp you can find", "2 tablespoons finely chopped parsley", "1 tablespoon finely grated lemon zest", "Salt"], "directions": [" Add the clam juice to 4 cups of water in a pot, heat until steamy. Do not let it boil.", " In separate pot (thick-bottomed), heat 2 tablespoons butter over medium heat, and sauté the minced shallots for 2-3 minutes, until just translucent.", " Add the rice to the pot. Stir-fry the rice for 2-3 minutes, until all the grains are well coated in butter and are beginning to toast.", " Increase the heat to high and add the white wine. With a wooden spoon, stir the rice vigorously. Once the wine boils, turn the heat down until the wine is just simmering gently. Stir almost constantly. You are doing this to agitate the rice, which releases its starch and creates the creamy sauce you want in a risotto.", " When the wine is almost cooked away – under no circumstances should you let the rice sizzle on the bottom of the pot – pour in two ladles of the hot clam broth-water mixture. Stir well to combine, and add a healthy pinch of salt.", " Stirring almost constantly, let this liquid reduce until it is almost gone, then add another ladle of broth. Continue this until the sauce coats the back of a spoon. Taste the spoon and see if the risotto needs salt. If so, add a small pinch.", "This much risotto rice should need about 4-5 cups of liquid total (including the wine) to come together, so start tasting the rice at the 3rd cup. If it is almost there – firm in the center but translucent on the outside, and fully surrounded with a creamy sauce – add one more cup of broth, stir well, and taste one more time for salt. (If not, you have old rice and you’ll need to go one more cup and let it cook away.)", " Now add in the shrimp, the parsley, and the remaining tablespoon of butter. Stir constantly until this last cup of broth is about half gone: Remember you want this risotto to be loose and creamy.", "Right before you serve, add in the lemon zest and serve at once. Best served with bowls and spoons rather than plates and forks."]},
{"description": "Naturally high-protein and gluten-free quinoa, cooked with onions, garlic, bell peppers, pilaf style, with chopped fresh herbs added for the finish. Healthy and easy!", "title": "Quinoa Pilaf", "url": "http://www.simplyrecipes.com/recipes/quinoa_pilaf/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2009/07/quinoa-pilaf-horiz-a-1200.jpg", "ingredients": ["2 Tbsp olive oil, divided 1 Tbsp and 1 Tbsp", "1/2 medium yellow onion, finely chopped", "1/4 bell pepper, finely chopped", "1 garlic clove, minced", "2 Tbsp pine nuts", "1 cup uncooked ", "2 cups water", "Pinch freshly ground black pepper", "2 Tbsp chopped fresh mint", "2 Tbsp chopped fresh basil or Thai basil*", "1 Tbsp chopped fresh chives (or green onions including the greens)", "1 small cucumber, peeled, seeds removed, chopped", "Salt and pepper"], "directions": [" Check your box of quinoa, if it recommends rinsing the quinoa, place the quinoa in a large sieve and rinse it until the water runs clear. (Some brands don't require rinsing.)", " Heat 1 Tbsp of olive oil on medium high heat in a 1 1/2 to 2 quart pot. Add the onion, bell pepper, garlic and pine nuts and cook, stirring occasionally until the onions are translucent, but not browned.", " Add the uncooked quinoa and cook, stirring occasionally for a couple more minutes. You can let some of the quinoa get a little toasted.", "Add 2 cups of water and one teaspoon of salt. Bring to a boil and reduce the heat to low so that the quinoa and water are simmering while the pot is partially covered (enough to let out some steam).", "Simmer for 20 minutes, or until the quinoa is tender and the water has been absorbed. Remove from heat and put into a large serving bowl. Fluff up with a fork.", " Let cool until just slightly warm, add another tablespoon of olive oil. Stir in chopped mint, basil, chives, and cucumber. Add salt and pepper to taste.", "Serve chilled or at room temperature."]},
{"description": "Tastes like apple pie! Smoothie with applesauce, almond milk, cashews, dates, and vanilla.", "title": "Apple Pie Smoothie", "url": "http://www.simplyrecipes.com/recipes/apple_pie_smoothie/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2014/04/apple-pie-smoothie-horizontal.jpg", "ingredients": ["1 cup unsweetened almond milk", "1 cup unsweetened ", " or ", "1/2 cup raw, unsalted cashews, soaked in water for 1 hour", "2 teaspoons vanilla extract", "1/2 teaspoon ground cinnamon", "2 chopped, pitted dates, soaked in water for 1/2 hour OR 2 Tbsp maple syrup*", "1 cup ice cubes"], "directions": ["Place all ingredients in a blender and purée until smooth, 30 to 60 seconds."]},
{"description": "Blueberry, peach, nectarine fruit salad seasoned with fresh thyme, ginger, and lemon juice.", "title": "Blueberry Peach Fruit Salad with Thyme", "url": "http://www.simplyrecipes.com/recipes/blueberry_peach_fruit_salad_with_thyme/amp/", "image": "http://assets.simplyrecipes.com/wp-content/uploads/2008/07/stone-fruit-blueberry-salad.jpg", "ingredients": ["4 peaches", "4 nectarines", "1 cup of blueberries", "2 teaspoons of fresh, chopped thyme", "1 teaspoon of grated ginger", "1/4 cup of lemon juice", "1 teaspoon of lemon zest", "1/2 cup of water", "1/4 cup of sugar (depending on how sweet the fruit is, you may be able to skip all together)"], "directions": [" If using water and sugar place them into a saucepot and bring to a boil and liquid is reduced by half into a simple syrup. Allow to cool.", " Chop up the peaches and nectarines and place them in a bowl with the blueberries. Pour over the cooled simple syrup or agave syrup. Add the thyme, lemon juice, lemon zest, and ginger.", " Stir and cover with plastic wrap, place in the fridge and allow to macerate for one hour. Serve."]}]
